<!DOCTYPE html>
<html lang="ca">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="description" content="Associació d'usuaris de GNU/Linux de la Catalunya Central">
    <meta name="keywords" content="gnu/linux, linux, programari lliure, gnu, lug, associacio, manresa, sant joan de vilatorrada, catalan, català, catalunya">
    <meta name="author" content="Catux">
    <link rel="icon" href="https://catux.org/images/favicon.ico">

    <title>Catux - Associació d'usuaris de GNU/Linux de la Catalunya Central</title>

    <!-- Bootstrap 5 CSS is included in main.css -->
    <link rel="stylesheet" type="text/css" href="https://catux.org/css/main.css">
    <!-- Bootstrap 5 JS and dependencies are included in main.js -->
    <script src="https://catux.org/js/main.js" defer></script>
</head>
<body>
    <header class="sticky-top">
        <nav class="navbar navbar-expand-lg navbar-dark bg-dark py-3">
            <div class="container-fluid">
                <a class="navbar-brand" href="https://catux.org/">
                    <img src="https://catux.org/images/catuxlogo.png" alt="Catux" height="50" class="me-3">
                    <div class="d-none d-lg-block">Associació d'usuaris de GNU/Linux de la Catalunya Central</div>
                </a>
                <button class="navbar-toggler" type="button" data-bs-toggle="collapse" data-bs-target="#navbarMain" aria-controls="navbarMain" aria-expanded="false" aria-label="Toggle navigation">
                    <span class="navbar-toggler-icon"></span>
                </button>
                <div id="navbarMain" class="collapse navbar-collapse">
                    <ul class="navbar-nav ms-auto mb-2 mb-lg-0">
                        <li class="nav-item"><a class="nav-link px-3" href="https://catux.org/post_list.html">Blog</a></li>
                        <li class="nav-item"><a class="nav-link px-3" href="https://catux.org/traduccio.html">Traducció</a></li>
                        <li class="nav-item"><a class="nav-link px-3" href="https://catux.org/contactar.html">Contactar</a></li>
                    </ul>
                </div>
            </div>
        </nav>
    </header>

    <div class="container main-container">
        
    <div class="container-fluid">

        <div class="post">
            <a href="https://catux.org/post_list.html">
                <i class="fas fa-chevron-left"></i>
                Arxius
            </a>

            <h1>
                
        Article de la Sólo Linux de Catux-USB
    
            </h1>

            <h3>
                Escrit al
                
        2004-11-09 00:00:00
    
                per
                
        cpina
    
            </h3>

            <p>
                
        <p>Actualitzaci&oacute;: <a href="catux/catux-usb-hist-ria.html">Catux-USB no es mant&eacute;</a> &nbsp;</p><p>&nbsp;</p><p><span class="noticia">Com alguns ja saben, el passat setembre a la revista S&oacute;lo Linux va sortir un article sobre la Catux-USB.<br /> <br /> L&#39;article original &eacute;s m&eacute;s extens que el publicat i &eacute;s per aix&ograve; que hem considerat interessant posar-lo al nostre web.<br /> <br /> Ara &eacute;s un bon moment per provar la Catux-USB i, si teniu problemes,  <a href="cgi-bin/mailman/listinfo/catux-usb">apuntar-vos</a> a la llista per tal de solucionar-los i poder-los tenir en compte per la propera versi&oacute;. Recorda que aquesta &eacute;s una manera de fer costat al programari lliure: suggerir millores, informar d&#39;errors, etc.</span> </p><p>Actualitzaci&oacute;: <a href="catux/catux-usb-hist-ria.html">Catux-USB no es mant&eacute;&nbsp;</a> </p><p>&nbsp;</p><h2>CATUX-USB: UNA DISTRIBUCI&Oacute; EXECUTADA DES D&#39;USB</h2><br /> Nota: hi ha un <a href="http://www.catux.org/index.php?contingut=articles&amp;num=39">article m&eacute;s breu</a> sobre Catux-USB que us pot interessar tamb&eacute;.<br /> Nota2: aquest article &eacute;s el publicat a la revista S&oacute;lo Linux de Setembre passat tradu&iuml;t al catal&agrave;.<br /> <a name="dalt" title="dalt"></a><br /> <br /> <div id="article" class="article_normal"><li><a href="http://www.catux.org/index.php?contingut=articles&amp;num=74#intro">Introducci&oacute;</a></li><br /> <li><a href="http://www.catux.org/index.php?contingut=articles&amp;num=74#util">Utilitats de Catux-USB</a></li><br /> <li><a href="http://www.catux.org/index.php?contingut=articles&amp;num=74#desavantatges">Desavantatges d&#39;un dispositiu USB</a></li><br /> <li><a href="http://www.catux.org/index.php?contingut=articles&amp;num=74#install">&quot;Instal&middot;lant&quot; Catux-USB</a></li><br /> <li><a href="http://www.catux.org/index.php?contingut=articles&amp;num=74#bios">Configurant la BIOS</a></li><br /> <li><a href="http://www.catux.org/index.php?contingut=articles&amp;num=74#problemes">Possibles problemes de l&#39;arranc d&#39;USB</a></li><br /> <li><a href="http://www.catux.org/index.php?contingut=articles&amp;num=74#cdrom">Arrancant mitjan&ccedil;ant CD-ROM</a></li><br /> <li><a href="http://www.catux.org/index.php?contingut=articles&amp;num=74#primer">Arrancant per primer cop</a></li><br /> <li><a href="http://www.catux.org/index.php?contingut=articles&amp;num=74#login">Fent login</a></li><br /> <li><a href="http://www.catux.org/index.php?contingut=articles&amp;num=74#unitats">Unitats montades</a></li><br /> <li><a href="http://www.catux.org/index.php?contingut=articles&amp;num=74#fitxers">Rep&agrave;s dels fitxers</a></li><br /> <li><a href="http://www.catux.org/index.php?contingut=articles&amp;num=74#mida">Canviant la mida del sistema de fitxers</a></li><br /> <li><a href="http://www.catux.org/index.php?contingut=articles&amp;num=74#arranc">Proc&eacute;s d&#39;arranc</a></li><br /> <li><a href="http://www.catux.org/index.php?contingut=articles&amp;num=74#kernel">Com canviar el Kernel</a></li><br /> <li><a href="http://www.catux.org/index.php?contingut=articles&amp;num=74#noucd">Generar un nou CD</a></li><br /> <li><a href="http://www.catux.org/index.php?contingut=articles&amp;num=74#micro">Com preparar la instal&middot;laci&oacute; des de Microsoft Windows</a></li><br /> <li><a href="http://www.catux.org/index.php?contingut=articles&amp;num=74#agraits">Agra&iuml;ments</a></li><br /> <li><a href="http://www.catux.org/index.php?contingut=articles&amp;num=74#conclu">Conclusions</a></li><br /> <br /> <a name="intro" title="intro"></a><br /> <h3>Introducci&oacute;</h3><br /> Catux &eacute;s una associaci&oacute; d&#39;usuaris de GNU/Linux de Catalunya Central (<a href="http://www.catux.org/">http://www.catux.org</a>) que existeix des de fa m&eacute;s o menys un any.<br /> <br /> Durant aquest any hem fent diverses activitats com la configuraci&oacute; del nostre propi servidor, la realitzaci&oacute; en PHP d&#39;un gestor de continguts per la nostra Web o la distribuci&oacute; GNU/Linux que a continuaci&oacute; explicarem.<br /> <br /> A aquest article tractarem d&#39;explicar perqu&egrave; emprar aquesta distribuci&oacute;, que avantatges t&eacute;, com instal&middot;lar-la (en un Pendrive, no en el disc dur), alguns trucs, etc.<br /> <br /> Catux-USB &eacute;s una distribuci&oacute; de GNU/Linux basada inicialment en els paquets de Damn Small Linux, per&ograve; amb el sistema de fitxers ext2 i el pegat e2compr.<br /> <br /> Aix&ograve; significa que ens trobem davant la primera distribuci&oacute; que pot arrancar i executar-se des d&#39;un Pendrive de manera comprimida i que t&eacute; un &uacute;s convencional, &eacute;s a dir, podem instal&middot;lar, desinstal&middot;lar, actualitzar tants paquets com vulguem o ens calguin.... tot aix&ograve; nom&eacute;s amb l&#39;intervenci&oacute; de conegut apt-get, totalment com si es tractara d&#39;una Debian convencional.<br /> <br /> A m&eacute;s a m&eacute;s, Catux-USB t&eacute; la detecci&oacute; de hardware autom&agrave;tica que empra Knoppix, apart d&#39;uns scripts que hem fet o modificat (de Knoppix, Damn Small Linux,...) sobre la configuraci&oacute; d&#39;X-Windows. D&#39;aquesta forma &eacute;s molt f&agrave;cil portar la distribuci&oacute; a qualsevol ordinador sense problemes d&#39;adaptabilitat.<br /> <br /> La idea &eacute;s facilitar un sistema base, que siga d&#39;&uacute;s senzill, amb nom&eacute;s uns 100MB(emprable amb Pendrives de 128MB o 256MB) amb el qual l&#39;usuari de Catux-USB no hagi de fer res m&eacute;s que executar l&#39;apt-get per actualitzar els paquets que desitge, o per fer personalitzacions per cobrir certes mancances. En cap cas cal ser un expert en Debian per a utilitzar la distribuci&oacute;. El sistema que oferim, malgrat ser un sistema base al qual se li poden afegir paquets m&eacute;s tard, &eacute;s totalment funcional per defecte, amb Xfree, amb un client Web (dillo), un client FTP (Xftp), un altre de correu (sylpheed), un gestor de finestres(Fluxbox), etc.<br /> <br /> Catux-USB no intenta ser una distribuci&oacute; completa que tinga de tot. Sin&oacute; que neix amb la vocaci&oacute; de ser una distribuci&oacute; base per cobrir la major part de les necessitats. Aportem en pocs megabytes un sistema que arranca, que t&ntilde;e un sistema X-Windows, un client de Web, FTP i correu.<br /> <br /> <a href="http://www.catux.org/index.php?contingut=articles&amp;num=74#dalt">Tornar a l&#39;&iacute;ndex.</a><br /> <a name="util" title="util"></a><br /> <h3>Utilitats de Catux-USB</h3><br /> &Eacute;s &uacute;til tenir una distribuci&oacute; en un Pendrive? segurament m&eacute;s d&#39;un lector s&#39;ho estar&agrave; plantejant.<br /> <br /> A continuaci&oacute; descrivim unes quantes situacions en les que s&iacute; ser&agrave; molt &uacute;til tenir un sistema como aquest a la nostra disposici&oacute;:<br /> <br /> Per exemple, tindrem en la nostra butxaca un dispositiu de 256 MB (per pocs diners), o de 512 MB amb la nostra distribuci&oacute; i configuracions personals. Aix&ograve; significa que podrem emprar qualsevol ordinador amb arquitectura i386 que dispongui d&#39;un port USB com si es tractara del nostre ordinador, entenent com ordinador propi aquell amb el que s&#39;executen les nostres aplicacions favorites, amb una configuraci&oacute; personalitzada, etc, i tot aix&ograve; sense tindre que fer res &ldquo;extrany&rdquo; (no tenim que resmasteritzar la distribuci&oacute;, ja que podem escriure en ella, etc). D&#39;aquesta manera podem moure&#39;ns amb el nostre &ldquo;kit&rdquo; d&#39;eines i treballar del mode habitual sense tenir que portar un ordinador port&agrave;til.<br /> <br /> Un altre cas seria, si ens cal un ordinador molt silenci&oacute;s. Un dels components que generen soroll en un ordinador &eacute;s el disc dur, mitjan&ccedil;ant Catux-USB podem aconseguir un ordinador funcional sense disc dur. Com a curiositat, hi ha fonts d&#39;alimentaci&oacute; sense ventilador i tamb&eacute; configuracions de processadors i dissipadors sense necessitat de ventiladors, per tant podr&iacute;em aconseguir un ordinador sense parts m&ograve;bils.<br /> <br /> Alguns cops &eacute;s molt important el pes (m&eacute;s que la capacitat) o b&eacute; el consum el&egrave;ctric. En els dos casos, un dispositiu USB pesa molt menys que un disc dur i tamb&eacute; consumeix de l&#39;ordre de 10 vegades menys que un disc dur.<br /> <br /> O b&eacute;, en un entorn amb moltes vibracions o cops, un dispositiu USB &eacute;s molt m&eacute;s resistent que un disc dur t&iacute;pic. Un dispositiu USB pot rebre un xoc de 1000G, en canvi un disc dur t&iacute;pic en funcionament pot suportar un xoc de 60G (segons les especificacions del fabricant).<br /> <br /> <br /> <a href="http://www.catux.org/index.php?contingut=articles&amp;num=74#dalt">Tornar a l&#39;&iacute;ndex.</a><br /> <a name="desavantatges" title="desavantatges"></a><br /> <h3>Desavantatges d&#39;un dispositiu USB</h3><br /> Els desavantatges, s&oacute;n els t&iacute;pics d&#39;un dispositiu USB front un dispositiu IDE com &eacute;s el disc dur.<br /> <br /> El cost dels dispositius USB, de moment molt m&eacute;s car que un disc dur, (com a m&iacute;nim en la relaci&oacute; &euro;/MB). Per&ograve; aquest desavantatge amb el temps es reduir&agrave;, a l&#39;anar apareixent cada cop dispositius de major capacitat i m&eacute;s econ&ograve;mics.<br /> <br /> Un altre desavantatge &eacute;s la velocitat, amb USB 1.0 aquesta &eacute;s unes 22 vegades m&eacute;s lenta que la d&#39;un disc dur. En tot cas, actualment els processadors tenen una capacitat de processament molt alta i a l&#39;emprar el pegat e2compr podem supondre que cada MB llegit s&oacute;n 2 MB descomprimits, ajudant-nos aix&iacute; a reduir en cert mode aquest desavantatge.<br /> <br /> Tanmateix, malgrat no &eacute;s una distribuci&oacute; d&#39;&uacute;s convencional, el seu &uacute;s ens satisfar&agrave; ja que en la pr&agrave;ctica no notarem cap difer&egrave;ncia significativa. En altres usos m&eacute;s intensius d&#39;entrada/sortida del dispositiu si que es faria evident aquesta disminuci&oacute; de velocitat.<br /> <br /> Una caracter&iacute;stica dels pendrive que podria semblar un desavantatge &eacute;s el nombre limitat de sobreescriptures que un dispositiu tipus Pendrive t&eacute;. Els fabricants donen una estimaci&oacute; de 1.000.000 escriptures en una zona determinada. &Eacute;s a dir, que si escrivim 2 cops diaris en el mateix lloc, ens resulten 300 sobreescriptures a l&#39;any, amb aquest c&agrave;lcul resulta que el pendrive ens durar&agrave; m&eacute;s de 1.000 anys, m&eacute;s que suficient. Per&ograve;, si ara tenim en compte que GNU/Linux aporta un sistema de buffers/cach&eacute; per a accelerar l&#39;acc&eacute;s a disc que evita les escriptures innecess&agrave;ries sobre una mateixa zona, encara durar&agrave; m&eacute;s el dispositiu. A m&eacute;s a m&eacute;s els logs estan configurats per a que syslog-ng els tinga en buffers de manera que no s&#39;afegisquen l&iacute;nia a l&iacute;nia. Tamb&eacute; disposem d&#39;una opci&oacute; addicional, amb la que podr&iacute;em muntar el sistema amb l&#39;opci&oacute; noatime (modificant el /etc/fstab) per evitar que escriga el temps d&#39;acc&eacute;s als inodes cada cop que s&#39;accedeix a un fitxer.<br /> <br /> <a href="http://www.catux.org/index.php?contingut=articles&amp;num=74#dalt">Tornar a l&#39;&iacute;ndex.</a><br /> <a name="install" title="install"></a><br /> <h3>&quot;Instal&middot;lant&quot; Catux-USB</h3><br /> Catux-USB est&agrave; pensada per ser utilitzada en Pendrives de 128 MB , 256 MB o incl&uacute;s de major capacitat, per el que en cap cas es modificar&agrave; el disc dur.<br /> <br /> En els servidors, per descarregar-la trobarem dos fitxers: el fitxer per a 128MB i el fitxer per el pendrive de 256MB (anomenats respectivament catuxusb-0.1a-128.tar.bz y catuxusb-0.1a-256.tar.bz). S&#39;ha de senyalar que un cop la tinguem sempre podem adaptar-la de forma f&agrave;cil a la mida que desitgem mitjan&ccedil;ant scripts ja preparats.<br /> <br /> Entre les dos versions nom&eacute;s canvia el dimensionament del sistema, ja que els paquets s&oacute;n els mateixos. Aix&iacute; si emprem el del 256MB tindrem m&eacute;s espai per a poder afegir els nostres paquets.<br /> <br /> En primer lloc descarreguem el paquet d&#39;algun dels dos servidors on estan disponibles: <br /> <br /> <li><a href="http://catux.org/distribucions/catux/">http://catux.org/distribucions/catux/</a><br /> <br /> <br /> Una vegada el tinguem al disc dur el descomprimim:<br /> <br /> <br /> bunzip2 catuxusb-0.1a-256.tar.gz<br /> tar -xvf catuxusb-0.1a-256.tar<br /> <br /> <br /> D&#39;aquesta forma ja tindrem en el directori catuxusb-0.1a-256 la distribuci&oacute; llesta per copiar-la al Pendrive. M&eacute;s endavant veurem en que consisteixen els fitxers que en ella hi ha.<br /> <br /> Al Pendrive haur&iacute;em de tenir una partici&oacute; tipus FAT, per exemple tipus 6. Sent root podem fer:<br /> <br /> <br /> pinux:~# fdisk -l /dev/sda<br /> <br /> <br /> <br /> La resposta ser&agrave; similar a a&ccedil;&ograve;:<br /> <br /> <br /> pinux:~# fdisk -l /dev/sda<br /> Disk /dev/sda: 255 MB, 255590400 bytes<br /> 8 heads, 61 sectors/track, 1022 cylinders<br /> Units = cylinders of 488 * 512 = 249856 bytes<br /> <br /> Device Boot Start End Blocks Id System<br /> /dev/sda1 * 1 1022 249337+ 6 FAT16<br /> pinux:~#<br /> <br /> <br /> (suposant que el dispositiu per al Pendrive sia /dev/sda)<br /> <br /> Aquest tipus de configuraci&oacute; (una sola partici&oacute; tipus FAT16) &eacute;s la configuraci&oacute; que sol venir per defecte en els dispositius Pendrives, aix&iacute; que segurament no haurem de modificar la taula de particions. Si per cap motiu hagu&eacute;rem modificat aquesta configuraci&oacute; anteriorment haurem de deixar-la novament com a FAT16, almenys la primera partici&oacute;.<br /> <br /> Ens em de fixar en que la columna Boot tinga el asterisc. Aix&ograve; indica que aquesta partici&oacute; &eacute;s l&#39;activa. En cas que no estiga marcada d&#39;aquesta manera, hem d&#39;executar:<br /> <br /> <br /> fdisk /dev/sda<br /> <br /> <br /> Llavors pressionant &ldquo;a&rdquo; i la partici&oacute; 1 per marcar-la com activa.<br /> <br /> Comentar que Catux-USB no s&#39;executa sobre la partici&oacute; FAT, sin&oacute; que crea un fitxer tipus ext2 compressed dins la partici&oacute; i s&#39;executa des d&#39;all&iacute; (&eacute;s transparent per a l&#39;usuari). Tamb&eacute; crea un altre fitxer tipus ext2 per al HOME (aquest sense comprimir).<br /> <br /> Un cop tinguem la partici&oacute; de tipus FAT16 s&#39;ha de muntar en un punt del sistema. Per muntar el contingut del pendrive al directori /mnt/pendrive (aquest directori ha d&#39;existir pr&egrave;viament) executarem el seg&uuml;ent:<br /> <br /> <br /> mount -t vfat /dev/sda1 /mnt/pendrive<br /> <br /> <br /> A continuaci&oacute; copiem el contingut de Catux-USB aqu&iacute; dins:<br /> <br /> cp -r catuxusb-0.1a-256/* /mnt/pendrive<br /> <br /> <br /> I desmuntar el dispositiu:<br /> <br /> umount /mnt/pendrive<br /> <br /> <br /> Aquest umount pot tardar un temps considerable, ja que Linux haur&agrave; d&#39;escriure realment les dades que en un primer moment s&#39;han guardat a la mem&ograve;ria cau.<br /> <br /> Un cop hem fet aix&ograve;, si volem que arranqui des del propi USB executarem:<br /> <br /> syslinux /dev/sda1<br /> <br /> <br /> D&#39;aquesta manera s&#39;est&agrave; escrivint l&#39;inici de la partici&oacute; per a que sia arrancable mitjan&ccedil;ant un gestor d&#39;arranc anomenat syslinux.<br /> <br /> Si de cas no disposarem del programa syslinux, es pot trobar a la nostra distribuci&oacute; un paquet anomenat syslinux, o b&eacute; en la seg&uuml;ent adre&ccedil;a: <a href="http://syslinux.zytor.com/">http://syslinux.zytor.com/</a><br /> <br /> <a href="http://www.catux.org/index.php?contingut=articles&amp;num=74#dalt">Tornar a l&#39;&iacute;ndex.</a><br /> <a name="bios" title="bios"></a><br /> <h3>Configurant la BIOS</h3> <br /> Si la nostra BIOS &eacute;s relativament recent i permet arrancar des d&#39;USB els passos a seguir seran: posar el Pendrive, entrar a la BIOS. Algunes BIOS si no detecten el Pendrive mentre la estem configurant no ens el mostren com a opci&oacute; d&#39;arranc, per tant ser&agrave; convenient tindre&#39;l posat mentre configurem la BIOS.<br /> <br /> Normalment en la secci&oacute; de &ldquo;Boot Options&rdquo;, en la &ldquo;Boot Sequence&rdquo; posarem abans que el disc dur el USB-FDD (o b&eacute; USB-Floppy), sortir desant els canvis realitzats.<br /> <br /> Aix&iacute; quan tinguem insertat el Pendrive ens apareixer&agrave; la car&agrave;tula de la distribuci&oacute; (una m&agrave;) llesta per arrancar.<br /> <br /> <a href="http://www.catux.org/index.php?contingut=articles&amp;num=74#dalt">Tornar a l&#39;&iacute;ndex.</a><br /> <a name="problemes" title="problemes"></a><br /> <h3>Possibles problemes de l&#39;arranc d&#39;USB</h3> <br /> <br /> Sobre tot no tenim que desesperar. L&#39;arranc per a dispositius USB &eacute;s molt recent i &eacute;s possible que la nostra BIOS no el suporti (a aquest cas no trobarem l&#39;opci&oacute; USB-FDD al men&uacute; de la seq&uuml;&egrave;ncia d&#39;arranc).<br /> <br /> Tamb&eacute; &eacute;s possible que la BIOS el suporti per&ograve; no correctament, o b&eacute; que tinga algun tipus d&#39;incompatibilitat amb el nostre dispositiu Pendrive.<br /> <br /> Sempre estem a temps d&#39;arrancar mitjan&ccedil;ant el CD-ROM, encara tenim algunes darreres configuracions que comprovar.<br /> <br /> <br /> Un punt que hem de comprovar &eacute;s que l&#39;opci&oacute; de la BIOS de com emprar dispositius UBS estigui en mode &quot;BIOS&quot; i no en mode &quot;legacy&rdquo;. Aquest canvi facilita la disponibilitat dels dispositius USB durant l&#39;arrancada del sistema, malgrat no haver engegat cap sistema operatiu (per exemple, un teclat USB, que ha d&#39;estar disponible abans que l&#39;arranc del sistema operatiu per poder escriure les opcions durant l&#39;arranc) o com en el nostre cas: un dispositiu USB &eacute;s indispensable per arrancar el sistema operatiu.<br /> <br /> Si no tenim l&#39;opci&oacute; per arrancar des d&#39;USB-FDD o encara que la tinguem no ens funciona correctament, podem executar el syslinux amb l&#39;opci&oacute; -s:<br /> <br /> syslinux -s /dev/sda1<br /> <br /> <br /> I tornar-ho a provar.<br /> <br /> Un altra opci&oacute; ser&agrave; buscar una actualitzaci&oacute; de la BIOS en la p&agrave;gina Web del fabricant. Hi ha altres casos en els que solucionen errors en l&#39;arranc relacionats amb dispositius USB.<br /> <br /> En tot cas, les plaques i BIOS que van sortint darrerament s&oacute;n cada cop m&eacute;s clares al respecte. Al comen&ccedil;ament dels CD-ROMs arrancables tamb&eacute; hi havia problemes e incompatibilitats, com amb tota nova tecnologia.<br /> <br /> <br /> <a href="http://www.catux.org/index.php?contingut=articles&amp;num=74#dalt">Tornar a l&#39;&iacute;ndex.</a><br /> <a name="cdrom" title="cdrom"></a><br /> <h3>Arrancant mitjan&ccedil;ant CD-ROM</h3> <br /> Si seguix sense arrancar podem iniciar la distribuci&oacute; des d&#39;un CD-ROM. Veurem que no es perd pr&agrave;cticament cap dels avantatges de Catux-USB, sols que: <br /> <br /> </li><li><strong>haurem de fer servir el CD-ROM</strong>,</li><br /> <li>l&#39;ordinador li caldr&agrave; el CD-ROM per arrancar.</li><br /> <br /> Un cop iniciat el sistema, el CD-ROM quedar&agrave; lliure per inserir nous CD&#39;s, enregistrar CD&#39;s, etc.<br /> <br /> Si arranquem mitjan&ccedil;ant CD-ROM evidentment a la seq&uuml;&egrave;ncia d&#39;arranc de la BIOS triarem el CD-ROM.<br /> <br /> Fem notar que si arranquem emprant el CD-ROM la part inicial del proc&eacute;s d&#39;arranc &eacute;s prou m&eacute;s r&agrave;pida que si ho fem des del propi dispositiu USB.<br /> <br /> La imatge del ISO que ens cal per arrancar est&agrave; a /mnt/pendrive o all&agrave; on hagem descomprimit la Catux-USB. Se&#39;n diu disk.iso i la podem enregistrar amb el programa que empreu per gravar CD&#39;s, o si estem en l&iacute;nia de comandes mitjan&ccedil;ant:<br /> <br /> cdrecord -v dev=0,3,0 -eject -data disk.iso<br /> <br /> (on dev &eacute;s el que tinguem a cada ordenador)<br /> <br /> <br /> <a href="http://www.catux.org/index.php?contingut=articles&amp;num=74#dalt">Tornar a l&#39;&iacute;ndex.</a><br /> <a name="primer" title="primer"></a><br /> <br /> <h3>Arrancant per primer cop</h3><br /> Ja sigui per un m&egrave;tode per un altre tindrem el logo del gestor d&#39;arranc a la pantalla.<br /> <br /> Podem pr&eacute;mer F3 per veure les opcions d&#39;arranc en catal&agrave;.<br /> <br /> Catux-USB &eacute;s totalment triling&uuml;e (catal&agrave;, castell&agrave;, angl&eacute;s), aix&iacute; que podem arrancar fent:<br /> <br /> knoppix lang=ca<br /> <br /> <br /> Per tenir-la en catal&agrave;, des dels missatges de reconeixement abans dels programes, men&uacute;s, scripts.<br /> <br /> Si &eacute;s el primer cop que arranca i li passem el par&agrave;metre de llengua Catux-USB el guardar&agrave; al USB per als seg&uuml;ents cops; sempre els missatges a partir d&#39;on hagi accedit al USB (hi ha missatges anteriors que si no s&#39;especifica res en el par&agrave;metre d&#39;arranc lang seran en angl&egrave;s).<br /> <br /> Les altres opcions s&oacute;n lang=es per al castell&agrave; o b&eacute; lang=en per a l&#39;angl&egrave;s.<br /> <br /> Al usar els scripts d&#39;autodetecci&oacute; de Knoppix podem passar-li altres par&agrave;metres que veurem en pantalla com poden ser noscsi, nopcmcia, etc.<br /> <br /> Al ser la primera vegada que arranca, quan intentem muntar el directori HOME no podr&agrave; ja que no existir&agrave; el fitxer que el representa (el HOME &eacute;s un fitxer del USB amb format ext2).<br /> <br /> Ser&agrave; llavors quan ens demanar&agrave; la mida del fitxer HOME que desitgem. El sistema, si estem emprant un Pendrive de 256 MB ocupa per defecte 170MB per tant tenim uns 85 MB disponibles per al nostre HOME. Farem un HOME de m&eacute;s d&#39;1 &oacute; 2 MB i inferior a 85 MB, per a que no ens falte per&ograve; tampoc ens quedem curts, aix&ograve; dependr&agrave; ja del que vulguem desar al HOME<br /> <br /> All&ograve; que no sigui ni sistema ni HOME quedar&agrave; disponible com a un Pendrive de la forma habitual, aix&iacute; que t&eacute; sentit ajustar una mica el HOME.<br /> <br /> Un cop que li hagem indicat la mida del HOME ens demanar&agrave; de manera manual que el va a formatar i que no &eacute;s un dispositiu de blocs on li direm &ldquo;y&rdquo; per que ho faci.<br /> <br /> Despr&eacute;s continuar&agrave; amb l&#39;arranc normal del sistema. Veurem que l&#39;arranc, despr&eacute;s de l&#39;execuci&oacute; del script de Knoppix d&#39;autodetecci&oacute; de hardware &eacute;s el d&#39;una Debian normal.<br /> <br /> <br /> <a href="http://www.catux.org/index.php?contingut=articles&amp;num=74#dalt">Tornar a l&#39;&iacute;ndex.</a><br /> <a name="login" title="login"></a><br /> <h3>Fent login</h3> <br /> Ens deixar&agrave; aleshores a la pantalla de login. Per defecte Catux-USB t&eacute; l&#39;usuari catux amb contrasenya catux i l&#39;usuari root amb contrasenya catux, tal com se&#39;ns indicar&agrave; des de la mateixa pantalla.<br /> <br /> Podem canviar de la manera habitual la contrasenya d&#39;aquests usuaris (mitjan&ccedil;ant l&#39;ordre passwd) o fins i tot eliminar aquests usuaris, o afegir-ne altres, etc.<br /> <br /> En cas que vulguem que Catux-USB sigui una distribuci&oacute; segura localment haur&iacute;em de modificar la configuraci&oacute; de sudo ja que aquest en la pr&agrave;ctica d&oacute;na permisos de root a l&#39;usuari catux.<br /> <br /> Un cop estiguem a la l&iacute;nia de comandes podem treballar com si d&#39;una Debian es tractara. Per tant, i a nivell de refer&egrave;ncia per a qui no empri Debian o apt-get de forma habitual podem fer:<br /> <br /> apt-get update<br /> <br /> <br /> I aix&iacute; podr&iacute;em actualitzar la llista de paquets.<br /> <br /> O b&eacute;:<br /> <br /> apt-get install mozilla-firefox<br /> <br /> <br /> Si desitgem instal&middot;lar mozilla-firefox o qualsevol dels m&eacute;s de 10.000 programes disponibles a Debian.<br /> <br /> Per cercar un paquet podr&iacute;em fer:<br /> <br /> apt-cache search &ldquo;descripci&oacute;n&rdquo;<br /> <br /> <br /> Per veure el llistat de paquets:<br /> <br /> dpkg -l<br /> <br /> I per eliminar un paquet concret<br /> <br /> dpkg --purge nombre_paquete<br /> <br /> <br /> Hem fet un script que facilita la configuraci&oacute; d&#39;alguns aspectes de la distribuci&oacute;. Aquest s&#39;anomena configurar.sh i ens permetr&agrave; configurar:<br /> <br /> <li>X-Window<br /> </li><li>Xarxa<br /> </li><li>Idioma<br /> </li><li>M&ograve;dem<br /> <br /> <br /> Veurem que els scripts s&oacute;n molt intu&iuml;tius, fets amb dialog. S&oacute;n scripts de Knoppix, Damn Small Linux, del mateix sistema o propis per&ograve; adaptats per a que siguin triling&uuml;es en funci&oacute; de l&#39;idioma seleccionat al sistema.<br /> <br /> Podrem configurar les X-Window. Normalment empra el driver vesa que &eacute;s compatible amb quasi tot tipus de targeta gr&agrave;fica, encara que podem emprar el que desitgem, per a tenir un rendiment superior, acceleraci&oacute; 3D, etc.<br /> <br /> Mitjan&ccedil;ant startx podrem arrancar el sistema gr&agrave;fic, el qual es basa en XFree 4.3 i com gestor de finestres hem triat fluxbox, que tamb&eacute; es pot canviar f&agrave;cilment.<br /> <br /> En fluxbox tenim un fons que si cliquem a sobre amb el bot&oacute; dret del ratol&iacute; ens apareixer&agrave; un men&uacute; amb alguns dels programes que estan instal&middot;lats al sistema.<br /> <br /> Com anotaci&oacute; r&agrave;pida, diem que est&agrave; disponible dillo com a navegador Web (ja que ocupava molt poc), sylpheed com a client de correu, axftp com client FTP. Podem afegir o llevar programes com hem vist abans.<br /> <br /> Tamb&eacute; tenim un client per ssh per a connectar-nos a altres m&agrave;quines, un client VNC, i un llarg etc&egrave;tera d&#39;aplicacions apart de les que podem instal&middot;lar.<br /> <br /> <br /> <a href="http://www.catux.org/index.php?contingut=articles&amp;num=74#dalt">Tornar a l&#39;&iacute;ndex.</a><br /> <a name="unitats" title="unitats"></a><br /> <h3>Unitats muntades</h3> <br /> Un cop dins de Catux-USB tindrem varies unitats muntades o preconfigurades per muntar.<br /> <br /> A /mnt tindrem hda1, hda2, hdb1, etc. que seran les particions del nostre sistema que podem muntar amb mount /mnt/hda1. Si hi ha un CD-ROM el deixa tamb&eacute; preparat per muntar.<br /> <br /> Des del dock al fluxbox, podem muntar o desmuntar les unitats de forma gr&agrave;fica.<br /> <br /> A m&eacute;s a m&eacute;s tindrem a /mnt/pendrive el nostre dispositiu USB per accedir a ell si volem.<br /> <br /> A /mnt/catux-usb est&agrave; muntat el fitxer que cont&eacute; el HOME (per tant, /home &eacute;s un enlla&ccedil; a /mnt/catux-usb/home)<br /> <br /> El sistema / (root) &eacute;s el mateix que miniroot.gz (un sistema en RAM) per&ograve; tots els directoris s&oacute;n enlla&ccedil;os a /KNOPPIX, el qual &eacute;s el punt de muntatge del fitxer (tipus ext2 compressed) /mnt/pendrive/knoppix/knoppix.<br /> <br /> <a href="http://www.catux.org/index.php?contingut=articles&amp;num=74#dalt">Tornar a l&#39;&iacute;ndex.</a><br /> <a name="fitxers" title="fitxers"></a><br /> <h3>Rep&agrave;s dels fitxers</h3> <br /> Des de la nostra distribuci&oacute; habitual, si mirem el contingut de /mnt/pendrive veurem:<br /> <br /> </li><li>/mnt/pendrive/knoppix/knoppix. Aqu&iacute; hi ha el sistema, &eacute;s un fitxer amb format comprimit mitjan&ccedil;ant el pegat e2compr (<a href="http://e2compr.sourceforge.net/">http://e2compr.sourceforge.net</a>). Aix&iacute; podem tenir m&eacute;s capacitat per a programes amb un sistema escrivible totalment (hi ha altres com cloop que estan orientats sols a lectura). Aix&ograve; t&eacute; un problema: si no tenim en la nostra distribuci&oacute; un Kernel amb el pegat e2compr ( i de moment nom&eacute;s est&agrave; disponible per a Kernels 2.4.x) no podrem accedir a aquest fitxer, per aix&ograve; tenim el HOME apart:<br /> <br /> </li><li>/mnt/pendrive/catux-usb.ext2. Aqu&iacute; tenim el directori HOME de la distribuci&oacute;. Aix&iacute; que si hem treballat amb Catux-USB i guardat algun fitxer en el HOME d&#39;ella est&agrave; a aquest fitxer. Si el volem muntar des de la nostra distribuci&oacute; hem de fer:<br /> <br />       mount -t ext2 -o loop /mnt/pendrive/catux-usb.ext2 /mnt/home_catux<br /> <br /> (sempre i quan existeixi el directori /mnt/home_catux)<br /> <br /> </li><li>miniroot.gz. Cont&eacute; el sistema de fitxers inicial, ja ho comentarem m&eacute;s endavant quan expliquem la seq&uuml;&egrave;ncia d&#39;arranc.<br /> </li><li>boot.msg, f2, f3, f4. Fitxers amb els textos que s&#39;empren al syslinux (el gestor d&#39;arranc)<br /> </li><li>logo.16. Fitxer gr&agrave;fic que cont&eacute; el logo d&#39;arranc<br /> </li><li>syslinux.cfg. &Eacute;s la configuraci&oacute; de syslinux<br /> </li><li>ldlinux.sys. Fitxer auxiliar para syslinux<br /> </li><li>utils/ . Directori amb uns fitxers auxiliars i un script per modificar la mida del fitxer knoppix/knoppix<br /> <br /> <br /> <a href="http://www.catux.org/index.php?contingut=articles&amp;num=74#dalt">Tornar a l&#39;&iacute;ndex.</a><br /> <a name="mida" title="mida"></a><br /> <h3>Canviant la mida del sistema de fitxers</h3> <br /> La versi&oacute; de 256 ve amb el sistema base uns 100 MB ocupats i dimensionant a 170 MB (per tant tenim uns 70 MB d&#39;espai, m&eacute;s el que guanyem amb la compressi&oacute;, per instal&middot;lar programes).<br /> <br /> La versi&oacute; de 128 MB t&eacute; uns 20 MB lliures (m&eacute;s compressi&oacute;) per als nostres paquets<br /> <br /> Per redimensionar la distribuci&oacute; es pot fer amb el programa resize2fs, per&ograve; aquest t&eacute; que estar compilat amb suport per a la compressi&oacute;.<br /> <br /> Hem fet un script que ens demanar&agrave; la variaci&oacute; en la mida de la distribuci&oacute;. Tamb&eacute; incloem una versi&oacute; del resize2ffs i del fsck.ext2 compilats en mode est&agrave;tic i amb el pegat de e2compr per no tenir cap problema.<br /> <br /> El mode d&#39;&uacute;s ser&agrave;:<br /> <br /> mount -t vfat -o exec /dev/sda1 /mnt/pendrive<br /> <br /> <br /> I llavors:<br /> <br /> cd /mnt/pendrive/utils<br /> ./modify_size.sh<br /> <br /> <br /> &Eacute;s necessari muntar-lo amb l&#39;opci&oacute; exec ja que per defecte moltes distribucions munten els sistemes vfat sense capacitat per executar els fitxers al seu si.<br /> <br /> Aquest script ens demanar&agrave; la llengua i les mides possibles per poder canviar-la. El proc&eacute;s no dura m&eacute;s enll&agrave; de 5 minuts, i ens permet dimensionar el sistema al nostre gust.<br /> <br /> <br /> <a href="http://www.catux.org/index.php?contingut=articles&amp;num=74#dalt">Tornar a l&#39;&iacute;ndex.</a><br /> <a name="arranc" title="arranc"></a><br /> <h3>Proc&eacute;s d&#39;arranc</h3> <br /> Aqu&iacute; descriurem el proc&eacute;s d&#39;arrancada de Catux-USB, per saber qu&egrave; passa si hi ha algun problema o b&eacute; per satisfer als xafarders.<br /> <br /> Un cop tenim el logo de l&#39;arranc de Catux-USB a la pantalla estem a syslinux, un gestor d&#39;arranc bastant curi&oacute;s, ja que sap accedir a fitxers que estan a la partici&oacute; FAT que se li indiqui. Per tant, quan fem F2, F3, F4 (per veure les ajudes amb els diferents idiomes) accedeix al dispositiu i llegeix el fitxer a mostrar.<br /> <br /> Quan premem &ldquo;Enter&rdquo; i arranca el Kernel, sap en quins fitxer est&agrave; perqu&egrave; l&#39;hem configurat al fitxer syslinux.cfg. Tamb&eacute; s&#39;ha configurat per a que empri el fitxer miniroot.gz com fitxer d&#39;initrd.<br /> <br /> Per tant s&#39;executa el Kernel i aquest accedeix al fitxer minroot.gz. El fitxer miniroot.gz &eacute;s un fitxer comprimit amb gzip, per&ograve; tamb&eacute; un fitxer tipus ext2 que cont&eacute; all&ograve; que &eacute;s imprescindible per poder detectar el dispositiu USB. Fins que no es detecta el dispositiu USB a nivell de m&ograve;duls del Kernel &eacute;s la BIOS qui s&#39;encarrega de gestionar l&#39;entrada/sortida.<br /> <br /> En cas que estigu&eacute;rem arrancant des d&#39;un CD-ROM, el proc&eacute;s &eacute;s el mateix per&ograve; es llegeix el Kernel i el miniroot.gz des del mateix CD.<br /> <br /> Un cop s&#39;ha carregat miniroot.gz en RAM, passa a executar-se el fitxer linuxrc que &eacute;s un script compatible amb Bourne Shell, encara que s&#39;executa amb ash.<br /> <br /> Ash &eacute;s un int&egrave;rpret, com poguera ser Bash, per&ograve; t&eacute; la caracter&iacute;stica que &eacute;s molt petit. Aquest ash est&agrave; compilat de manera est&agrave;tica per a que no calguin llibreries(el miniroot t&eacute; una capacitat limitada) i un bash compilat est&agrave;tic seria excessiu (2.3 MB) en contra dels XXX KB de ash (com &eacute;s evident, ash no t&eacute; totes les capacitats que t&eacute; Bash).<br /> <br /> El script linuxrc s&#39;encarrega de varies feines, encara que una d&#39;elles, la m&eacute;s important sense dubte, &eacute;s la de carregar els m&ograve;duls USB necessaris.<br /> <br /> En /static/modules tenim els m&ograve;duls USB, per exemple usb-uhci, usb-ohci, usb-ehcd. Depenent de la placa que tinga l&#39;usuari es carregar&agrave; un m&ograve;dul o un altre. Tamb&eacute; carrega el m&ograve;dul usb-storage per poder accedir al dispositiu. Quan carrega un m&ograve;dul apareix el seu nom al costat.<br /> <br /> A continuaci&oacute; linuxrc munta en /KNOPPIX el fitxer que cont&eacute; el sistema, passa el control a /sbin/init i s&#39;elimina a ell mateix (per no veure un fitxer anomenat linuxrc en el /)<br /> <br /> Tot el conjunt de directoris de GNU/Linux (per exemple /bin, /sbin, /lib, /usr, etc.) s&oacute;n enlla&ccedil;os simb&ograve;lics cap a /KNOPPIX. Podr&iacute;em haver evitat aquests enlla&ccedil;os &ldquo;pivotant&rdquo; amb chroot per exemple a /KNOPPIX per&ograve; no ha fet falta.<br /> <br /> Si linuxrc no pot passar el control a /sbin/init perqu&egrave; no ha pogut muntar la Catux-USB el que far&agrave; &eacute;s deixar una shell molt limitada per intentar saber que ha passat. Si no ha pogut pot ser el USB no estava endollat (i est&agrave;vem arrancant des de CD-ROM), a que la imatge del sistema ha tingut algun problema (i per tant no s&#39;ha pogut muntar), o no ha pogut carregar cap controlador per a gestionar el nostre USB, ...<br /> <br /> Al cas que ens deixe en la shell limitada, comentar que no tindrem ni ls per&ograve; per veure els directoris i fitxers del directori actual podem fer echo *, s&iacute; que tenim cd i insmod per intentar carregar els m&ograve;duls i veure quin error donen exactament.<br /> <br /> A continuaci&oacute;, si no hi hagut problemes, init entrar&agrave; al runlevel 2 habitual en Debian executant els scripts d&#39;iniciaci&oacute; de System V (els /etc/rc2.d). A partir d&#39;aquest moment estem en una Debian normal per a l&#39;&uacute;s que desitgem.<br /> <br /> <br /> <a href="http://www.catux.org/index.php?contingut=articles&amp;num=74#dalt">Tornar a l&#39;&iacute;ndex.</a><br /> <a name="kernel" title="kernel"></a><br /> <h3>Com canviar el Kernel</h3><br /> Canviar el Kernel a aquesta distribuci&oacute; &eacute;s una mica diferent i m&eacute;s cost&oacute;s que a altres distribucions.<br /> <br /> Malgrat aix&ograve; &eacute;s possible que ens calgui canviar-lo per algun motiu (actualitzaci&oacute; urgent, afegir un pegat no incl&ograve;s, etc) per tant farem un resum aqu&iacute; del proc&eacute;s.<br /> <br /> El Kernel (fitxer t&iacute;pic bzImage) resideix a /mnt/pendrive baix el nom de vmlinuz. Aquest Kernel t&eacute; que concordar amb la versi&oacute; dels m&ograve;duls que ens s&oacute;n necessaris per a la detecci&oacute; del dispositiu USB que hi ha a miniroot.gz.<br /> <br /> Al mateix temps, en el fitxer que cont&eacute; el sistema (/mnt/pendrive/knoppix/knoppix), en el directori /lib/modules/version_kernel es troben els m&ograve;duls per a la resta de dispositius.<br /> <br /> A m&eacute;s a m&eacute;s, i de vital import&agrave;ncia, el Kernel que instal&middot;lem ha de tenir el pegat de e2compr, ja que sin&oacute; no es podr&agrave; muntar el sistema. Aquest pegat es troba a <a href="http://e2compr.sourceforge.net/">http://e2compr.sourceforge.net</a> i es t&eacute; que aplicar al Kernel abans de compilar-lo.<br /> <br /> Per a totes les opcions, hem de provar que sia el m&eacute;s modular possible per a tenir suport per a tot tipus de dispositius baix comanda.<br /> <br /> Per canviar el vmlinuz &eacute;s suficient sobreescriure&#39;l amb el nou, o b&eacute; modificar el fitxer de configuraci&oacute; de syslinux (syslinux.cfg) i intentar tenir els dos disponibles.<br /> <br /> Per canviar el /lib/modules/version_kernel, podem fer-ho arrancant la Catux-USB i copiant els nous m&ograve;duls all&iacute; dins, hauri a de ser suficient. Copiem tota l&#39;estructura del /lib/modules/versio_kernel del Kernel que hajam arrancat, incl&ograve;s el modules.dep.<br /> <br /> Com a darrera cosa, podem canviar els m&ograve;duls que estan continguts al fitxer miniroot.gz, des de Catux-USB haur&iacute;em de fer quelcom similar a:<br /> <br /> <br /> gunzip miniroot.gz<br /> mkdir m<br /> mount -t ext2 -o loop miniroot m<br /> cd m<br /> cd static/modules<br /> <br /> <br /> I els veurem all&iacute; dins, podent aix&iacute; sobreescriure-los.<br /> <br /> <a href="http://www.catux.org/index.php?contingut=articles&amp;num=74#dalt">Tornar a l&#39;&iacute;ndex.</a><br /> <a name="noucd" title="noucd"></a><br /> <h3>Generar un nou CD</h3> <br /> Si per alguna ra&oacute; hem canviat el Kernel, pot ser ens calgui fer de nou el CD-ROM per poder arrancar, en cas que no podam arrancar per USB.<br /> <br /> Per fer-lo, primer farem un fitxer de 2880 KB:<br /> <br /> <br /> dd if=/dev/zero of=disk.vfat bs=1k count=2880<br /> <br /> <br /> A continuaci&oacute; formatarem el fitxer amb format VFAT, &uacute;til per poder utilitzar syslinux:<br /> <br /> mkfs -t vfat disk.vfat<br /> <br /> <br /> I crearem un directori, per exemple, d:<br /> <br /> mkdir d<br /> <br /> <br /> En ell podem muntar el nou fitxer:<br /> <br /> mount -t disk.vfat d<br /> <br /> <br /> I finalment copiarem els fitxers necessaris per aquesta part de l&#39;arranc:<br /> <br /> cp boot.msg f2 f3 f4 ldlinux.sys logo.16 miniroot.gz syslinux.cfg vmlinuz d<br /> <br /> <br /> Desmuntem el fitxer:<br /> <br /> umount d<br /> <br /> <br /> Li instal&middot;lem syslinux:<br /> <br /> syslinux disk.vfat<br /> <br /> <br /> Posem el fitxer dins del mateix directori d:<br /> <br /> mv disk.vfat d<br /> <br /> <br /> I finalment generem la nova ISO:<br /> <br /> mkisofs -l -J -o disk.iso -v -b disk.vfat -V catux-usb d/<br /> <br /> <br /> D&#39;aquesta manera ja tenim una ISO per gravar com vam veure abans amb el nou Kernel.<br /> <br /> <a href="http://www.catux.org/index.php?contingut=articles&amp;num=74#dalt">Tornar a l&#39;&iacute;ndex.</a><br /> <a name="micro" title="micro"></a><br /> <h3>Com preparar la instal&middot;laci&oacute; des de Microsoft Windows</h3> <br /> Fins ara hem vist com instal&middot;lar-la des d&#39;una distribuci&oacute; GNU/Linux. Ara veurem com podem fer el mateix des d&#39;un Microsoft Windows, &uacute;til per al cas en que no tingu&eacute;rem cap distribuci&oacute; instal&middot;lada.<br /> <br /> Encara que sempre podr&iacute;em instal&middot;lar-la des d&#39;una Knoppix (un CD arrancable que ens deixaria en condicions paregudes a la instal&middot;laci&oacute; ja vista a l&#39;article).<br /> <br /> Haurem de descarregar igualment un dels fitxers, ja sigui catuxusb-0.1-128a.tar.bz2 o b&eacute; catuxusb-0.1a-256.tar.bz2. A continuaci&oacute; emprarem algun programa com <a href="http://www.7-zip.org/">7-zip</a> o b&eacute; el programa comercial <a href="http://www.winzip.com/">Winzip</a> per descomprimir i desempaquetar els fitxers continguts en ell.<br /> <br /> Els podem extraure directament a la unitat que tinguem el Pendrive (per exemple, e:) sempre que aquest sia tipus FAT (tipus per defecte).<br /> <br /> Un cop copiats al Pendrive, tindrem que preparar-lo per a que arranqui autom&agrave;ticament al iniciar l&#39;ordinador. Per fer aix&ograve; emprarem un petit programa anomenat syslinux.<br /> <br /> Aquest programa modificar&agrave; l&#39;inici del Pendrive i crear&agrave; uns fitxers en ell per a que pugui arrancar.<br /> <br /> El podem trobar aqu&iacute;:<br /> <br /> <a href="http://syslinux.zytor.com/download.php">http://syslinux.zytor.com/download.php</a><br /> <br /> <br /> A aquesta p&agrave;gina trobarem un enlla&ccedil; al ftp de kernel.org. Descarreguem <a href="http://www.kernel.org/pub/linux/utils/boot/syslinux/syslinux-2.10.zip">syslinux-2.10.zip</a> <br /> <br /> Dintre d&#39;aquest fitxer trobarem syslinux.exe, el qual extraurem a c:\ o qualsevol directori conegut.<br /> <br /> Anant al bot&oacute; Inici, i triant Executar. Escrivim en la caixa que apareix cmd.<br /> <br /> A la pantalla S&iacute;mbol de sistema que ens apareixer&agrave; teclejarem:<br /> <br /> c:\<br /> syslinux e:<br /> <br /> <br /> Sempre suposant que en e: es troba el nostre Pendrive. Haurem de veure en quina unitat est&agrave; realment, per exemple mitjan&ccedil;ant &quot;El meu Pc&quot;.<br /> <br /> Ara el pendrive ja est&agrave; preparat per arrancar la Catux-USB.<br /> <br /> A partir d&#39;aqu&iacute; haur&iacute;em de comprovar les opcions de la BIOS, veure m&eacute;s detalls a la secci&oacute; de l&#39;article &ldquo;<a href="http://www.catux.org/index.php?contingut=articles&amp;num=74#bios">Configurant la BIOS</a>&rdquo;.<br /> <br /> <a href="http://www.catux.org/index.php?contingut=articles&amp;num=74#dalt">Tornar a l&#39;&iacute;ndex.</a><br /> <a name="agraits" title="agraits"></a><br /> <h2>Agra&iuml;ments</h2> <br /> Des de Catux hem fet un treball fort per aconseguir aquesta distribuci&oacute;, amb gent testejant-la durant mesos (emprant-la com a distribuci&oacute; habitual) a gent traduint i corregint textos, aportant idees, material, etc.<br /> <br /> De tota manera no hagu&eacute;rem pogut fer la distribuci&oacute; si no fora pels milers de persones que han treballat durant anys en projectes com el Kernel de Linux, GNU, Debian, Knoppix i un llarg etc.<br /> <br /> Gent que ha fet el seu treball amb llic&egrave;ncies lliures (GPL, LPGL o altres similars) i hem pogut aprofitar els seus treballs. Si no fora per tot aix&ograve; ara no estar&iacute;em escrivint tot a&ccedil;&ograve;, sin&oacute; que estar&iacute;em reinventant el sistema complet de nou.<br /> <br /> <a href="http://www.catux.org/index.php?contingut=articles&amp;num=74#dalt">Tornar a l&#39;&iacute;ndex.</a><br /> <a name="conclu" title="conclu"></a><br /> <h2>Conclusions</h2> <br /> La distribuci&oacute; funciona correctament, encara que al ser la primera versi&oacute; sempre tindr&agrave; alguns errors que s&#39;hauran de corregir en les posteriors edicions.<br /> <br /> Als pr&ograve;xims mesos farem una segona versi&oacute; de la distribuci&oacute; amb aquests errors solucionats i amb noves idees i aportacions generals.<br /> <br /> Qui tinga problemes, recomanacions, idees, etc, el convidem a la nostra p&agrave;gina Web on hi ha una llista de correu on tractarem de solucionar els problemes que plantege.<br /> <br /> Nota: molts agra&iuml;ments a Laura per la traducci&oacute;!</li></div>
    
            </p>

            <h3>
                Categories:
                
        Articles, Varis
    
            </h3>

            <hr />
            <h1>Comentaris</h1>
            <ul class="list-group">
                
        <li class="list-group-item">Sense comentaris</li>
    
            </ul>


            <a href="https://catux.org/post_list.html">
                <i class="fas fa-chevron-left"></i>
                Arxius
            </a>
        </div>

    </div>


    </div> <!-- /.container -->

    <footer class="bg-dark text-light py-4 mt-5 fixed-bottom">
        <div class="container">
            <div class="row">
                <div class="col-md-8">
                    <p class="mb-0">
                        <small><small>Tot el contingut de Catux està subjecte sota la nova versió de la llicència de
                        <a href="http://creativecommons.org/licenses/by/2.5/es/deed.ca" class="text-light">Creative Commons</a></small></small>
                    </p>
                </div>
                <div class="col-md-4 text-md-end">
                    <p class="mb-0">
                        <a href="https://github.com/catux" class="text-light me-3"><i class="fab fa-github"></i></a>
                        <a href="https://t.me/+UaRevB06YidmYTY0" class="text-light"><i class="fab fa-telegram"></i></a>
                    </p>
                </div>
            </div>
        </div>
    </footer>



</body>
</html>
