<!DOCTYPE html>
<html>
<head lang="cat">
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="description" content="Associació d'usuaris de GNU/Linux de la Catalunya Central">
    <meta name="keywords" content="gnu/linux, linux, programari lliure, gnu, lug, associacio, manresa, sant joan de vilatorrada, catalan, català, catalunya">
    <meta name="author" content="Catux">
    <link rel="icon" href="http://catux.org/images/favicon.ico">

    <title>Catux</title>

    <link rel="stylesheet" type="text/css" href="http://catux.org/css/main.css">
    <script src="http://catux.org/js/main.js"></script>
</head>
<body>
    <div class="navbar-wrapper">
        <div class="container">

            <nav class="navbar navbar-inverse">
                <div class="container">
                    <div class="navbar-header col-sm-5">
                        <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
                            <span class="sr-only">Toggle navigation</span>
                            <span class="icon-bar"></span>
                            <span class="icon-bar"></span>
                            <span class="icon-bar"></span>
                        </button>
                        <a href="http://catux.org/">
                            <img src="http://catux.org/images/catuxlogo.png" alt="Catux" width="40%"><br>
                            <div class="visible-lg"> Associació d'usuaris de GNU/Linux de la Catalunya Central</div>
                        </a>
                    </div>
                    <div id="navbar" class="navbar-collapse collapse navbar-links">
                        <ul class="nav navbar-nav navbar-right">
                            <li><a href="http://catux.org/post_list.html">Blog</a></li>
                            <li><a href="http://catux.org/traduccio.html">Traducció</a></li>
                            <li><a href="http://catux.org/contactar.html">Contactar</a></li>
                        </ul>
                    </div>
                </div>
            </nav>
        </div>
    </div> <!-- /.navbar-wrapper -->

    <div class="container">
        
    <div class="container-fluid">

        <div class="post">
            <a href="http://catux.org/post_list.html">
                <i class="fas fa-chevron-left"></i>
                Arxius
            </a>

            <h1>
                
        BOFH-How-to
    
            </h1>

            <h3>
                Escrit al
                
        2004-10-04 00:00:00
    
                per
                
        franhp
    
            </h3>

            <p>
                
        <span class="noticia">Pringao how-to, segona versi&oacute;.</span> <h2>1. Qu&eacute; es BOFH-Howto</h2> <p>&iexcl;Bienvenido al mundo de los pringaos! este documento est&aacute; dedicado a todos los pringaos del mundo, personas que trabajan para otras sin recibir nada a cambio, indiferencia, y en algunos casos desprecio. </p> <p>Antes de nada debes leer el famoso &quot;<a href="http://pinsa.escomposlinux.org/sromero/linux/pringao/Pringao_Howto.html">Pringao-Howto</a>&quot; un texto de lectura obligatoria, donde podr&aacute;s comprobar si eres un pringao.</p> <h2>2. &iquest;Qu&eacute; he hecho yo para merecer esto?</h2> <p>Ayudar a los dem&aacute;s no es malo. Que cada uno use lo que quiera tampoco lo es (es un principio b&aacute;sico de libertad). Ayudar a los dem&aacute;s a usar productos mediocres y hacerlo gratis tampoco tiene por qu&eacute; ser malo, pero ayudar a los dem&aacute;s gratis sin que valoren tu trabajo, eso <strong>s&iacute;</strong> que no es tolerable.</p> <p>El pringao es un pringao por que dejan que los dem&aacute;s le pisen &iquest;que te llaman a las cinco de la ma&ntilde;ana por que no sab&iacute;an cambiar el cartucho de tinta de la impresora y no te dan ni las gracias? &iquest;que les descargas los tres gigas del ultimo juego que esta en cualquier tienda por treinta euros y te ponen caras raras cuando les pides que te paguen el DVD virgen? &iquest;que te pegas cuatro horas instal&aacute;ndoles el puto Windows XP y cada vez que tienen un problema con un dialer te echan la culpa? &iexcl;di BASTA! t&uacute; <strong>no</strong> eres su criado, ellos son ignorantes, vagos y est&uacute;pidos, son, en definitiva, <a href="http://es.wikipedia.org/wiki/Luser">LUSERS</a> (en ingl&eacute;s, combinaci&oacute;n de loser (perdedor) y user (usuario)) y t&uacute; eres su pringado.</p> <h2> 3. Soluciones del Pringao-Howto.</h2> <p>El famoso texto &quot;Pringao-Howto&quot; da ciertas recomendaciones para no ser un pringao, pero ninguna de ellas es satisfactoria:</p> <p>La primera de ellas es que no instales Windows. Bien, desgraciadamente, la gente <strong>quiere Windows</strong> as&iacute; que en la mayor&iacute;a de los casos <strong>no conseguir&aacute;s nada.</strong></p> <p>La segunda parte consiste en explicarle c&oacute;mo funciona Windows... bueno, adem&aacute;s de pringao, &iquest;profesor? esto no servir&aacute; de nada, excepto para que el luser bostece y que t&uacute; <strong>pierdas el tiempo</strong>.</p> <p>No instalarle software pirateado... cualquiera sabe instalar cualquier programa, si no sabe ya le dar&aacute;n instrucciones y ning&uacute;n luser puede pasar sin Office ni Photoshop.</p> <p>Cobrar es una buena opci&oacute;n, pero muchas veces no te pagar&aacute;n por todo lo que te van a hacer sufrir. T&uacute; les das unas recomendaciones y las ignoran, estropean su ordenador de las peores formas posibles y esperan que lo soluciones en minutos, no les funciona Internet y no se molestan en asociarlo a la perdida de l&iacute;nea para llamarte desde un m&oacute;vil mientras cenas &iexcl;hay cosas que el dinero no puede comprar!</p> <h2> 4. El luser </h2> <p>Antes de continuar es importante dejar claro quien es el luser. El luser es la tipica persona que no tiene ni idea de inform&aacute;tica, que ni tiene ni quiere tener porque cerca de &eacute;l hay un pringao, y espera que &eacute;ste le solucione cualquier cosa, y en diez minutos, adem&aacute;s de gratis. Otra caracteristica que suelen tener en com&uacute;n es que los lusers suelen usar Windows. Existen casos en los que se ha convencido a estos usuarios para que abandonen esta plataforma, pero esto no suele solucionar nada. Lo peor de los lusers no es que sean unos ignorantes en el tema, es que son unos desagradecidos a los que no le importa molestarte a las seis de la ma&ntilde;ana por que el ADSL no le funciona y no pueden cargar sus p&aacute;ginas guarras.</p> <h2> 5. El  BOFH.</h2> <p>&iquest;Que es un BOFH? BOFH es un acr&oacute;nimo, y su significado es Bastard Operator From Hell, &quot;Operador Bastardo del Infierno&quot; Pod&eacute;is leer algunas de sus historias traducidas al castellano <a href="http://www.benavent.org/bofh/">aqu&iacute;</a>. </p> <p>T&uacute;, pringao, t&uacute;, que tienes el poder, un poder que desconoces, t&uacute; puedes ser un BOFH. &iquest;Que hay que hacer para ser un BOFH? Para ser un BOFH tienes que dejar de pensar que quiere el usuario, eso no es asunto tuyo, lo que quieres es que esos lusers dejen de molestarte sin tener que dar imagen de un ignorante que no puede ayudarles.</p> <p>T&uacute; tienes el poder del conocimiento, sabes manejarte con Windows y sabes que tienes que hacer para que haga lo que <strong>t&uacute;</strong> quieres que haga. Ellos saben que sabes, no te dejes coaccionar, ni llantos ni pataletas, ni ostias en vinagre, ellos no saben <strong>nada</strong>, y no quieren saber, as&iacute; que <strong>aprovechalo o ser&aacute;n ellos </strong>los que se aprovechen de ti.</p> <h2> 6. Mis programas favoritos. </h2> <p>Uno de los privilegios de los BOFH es el de coartar las libertades a sus lusers, una de ellas es la de elecci&oacute;n, que se manifiesta en varias facetas. Una de ellas es el software que se instala en el equipo. Como se ha indicado antes, el manual del &quot;Pringao-Howto&quot; recomienda no instalar software pirata a los usuarios coment&aacute;ndoles nuestras ideas, pero eso a los lossers no les importa. Si les instalas OpenOffice no &quot;molar&aacute;n&quot; en el colegio y se pondr&aacute;n en Office 2003 y el Photoshop UltimateEdition, as&iacute; que hay que utilizar otros m&eacute;todos.</p> <p>Imaginemos, a los ni&ntilde;os del quinto se les ha jodido el Windows Media Player. Un pringao ir&iacute;a y se lo reparar&iacute;a o como mucho les comentar&iacute;a otras opciones, pero <strong>&iexcl;alto!</strong> t&uacute; no quieres ser un pringao, y a ti no te gusta esa mierda de programa, y lo m&aacute;s seguro es que si lo arreglas vuelva a joderse dentro de un mes, adem&aacute;s no te van a dar las gracias, ni dinero as&iacute; que &iquest;para que propiciar otro d&iacute;a perdido? </p> <p>&iquest;Soluci&oacute;n? &iexcl;se un puto BOFH! mira a esos cr&iacute;os consentidos y diles muy seriamente que si usan ese programa les entraran virus, que perder&aacute;n sus partidas (&iquest;amenazarles con sus ejercicios? solo funciona si son empollones) que se les quemar&aacute; el procesador por un fallo intr&iacute;nseco de los plugin, que sus padres les echar&aacute;n la culpa y no podr&aacute;n jugar en meses. Ellos saben que sabes, as&iacute; que no importa que gilipolleces digas para convencerles mientras les mires seriamente, sobre todo si tienes un web que lo comente. Les convencer&aacute;s, luego les quitas permisos sobre el directorio del WMP y les instalas... <strong>&iexcl;lo que te d&eacute; la gana! </strong>(como si les instalas el GCC) y esto se extiende a cualquier programa. &iquest;MS Office? &iexcl;OpenOffice! &iquest;Photoshop? &iexcl;Gimp! &iquest;que lloran? pues &quot;mira es que el Photoshop no es compatible con este parche del Windows XP especial, y te podr&iacute;a joder el pipeline del bus de RAM, yo, si quieres, te lo instalo, pero t&uacute; ser&aacute;s el responsable y la ostia te la dar&aacute; tu padre a ti, no a m&iacute;..&quot;</p> <p>Recuerda, los lusers tienen cuentas de usuario <strong>&iexcl;nunca de administrador!</strong> as&iacute; que nunca les instales un Windows que no sea 2000 o XP.</p> <h2> 7. Control</h2> <p>Otra de las formas de coartar sus libertades se extiende a su escritorio, como BOFH puedes controlarlo todo, desde los papeles tapices, el salvapantallas, el escritorio... sus padres se han gastado mucho dinero en un equipo que puede que sea incluso mejor que el tuyo, y no quieres que lo dejen como el peor de los tuneros &iquest;verdad? </p> <p>No dejes que su caro ordenador quede hecho un asco, ponles un papel tapiz que te guste, los iconos en el escritorio que te agraden, un buen salvapantallas y luego usa las directivas del sistema para bloquearles esas configuraciones, bloqueales tambi&eacute;n la configuraci&oacute;n de Windows y el acceso al panel de control y sus elementos, si protestan hablas con sus padres y les hablas de los peligros de Internet, de los dialers (aunque tengan ADSL), de los archivos de sus amigos, que te ha costado mucho trabajo... Todo es por su seguridad, si quieren comprar un equipo cada seis meses no es asunto tuyo, seguro que te apoyaran y as&iacute; es m&aacute;s dif&iacute;cil que jodan el sistema y te vengan llorando, y recuerda que existen cientos de utilidades gratuitas que har&aacute;n que este paso sea sumamente sencillo. </p> <p>Instales programas de control, sobre todo para Internet, son lusers, no saben nada y hay cientos de paginas peligrosas y ya sabes quien les arreglar&aacute; el ordenador. Dales el control sobre esos programas a sus padres (te lo agradecer&aacute;n). Cuando fueron a comprar el ordenador dijeron que iba a ser para trabajar &iquest;no? &iexcl;pues a trabajar ellos, no t&uacute;! seguro que as&iacute; sus hijos se lo pensar&aacute;n dos veces antes de entrar en paginas guarras o de hacking. </p> <h2> 8. Soluciones r&aacute;pidas.</h2> <p>En Windows como en cualquier S.O. las cosas se pueden arreglar de diversas maneras, pero buscar el origen del problema, documentarlo, estudiar las posibles soluciones, aplicarlas, hacerlo todo de una forma ordenada, limpia y eficiente es costoso, y con los <strong>lusers</strong> no tienes que perder el tiempo, no se lo merecen, as&iacute; que  tranquilo, en el 99% de las ocasiones hay una soluci&oacute;n universal, <strong>formatea y reinstala.</strong> Si no tienen copias de seguridad aprender&aacute;n a hacerlas, y si no, la pr&oacute;xima vez, y si no, la pr&oacute;xima vez, y si no... <strong>&iquest;que cojones te importa? &iexcl;eres un BOFH! </strong>Si el problema es de hardware es que es incompatible y pone en peligro la integridad del equipo, necesitan hardware nuevo y el viejo &iquest;adivinas? &iexcl;te lo quedas t&uacute;! </p> <p>Otra cosa es; tu tiempo es oro, aunque lo gastes haciendote pajas, viendo South Park o estudiando la reproducci&oacute;n de los gamusinos o &iexcl;lo que sea! as&iacute; que cuando la soluci&oacute;n sea reinstalar... que te lleven el ordenador a tu casa (puedes avisarles de que no necesitas el monitor o el teclado, pero hazlo despu&eacute;s de que te los hayan subido), donde tendr&aacute;s un archivo de instalaci&oacute;n desatendida de Windows (registrado a nombre de: luser), despu&eacute;s de reinstalar el Windows (cosa que te llevar&aacute; unos pocos minutos) y tus aplicaciones favoritas (las m&iacute;nimas e imprescindibles)... abre la caja, saca un poco los cables y espera el tiempo que te parezca necesario... quince d&iacute;as, un mes... (lo de dejarlo abierto es para dar buena imagen ante visitas)</p> <p>Recuerda, estas muy ocupado, tienes ex&aacute;menes, no te encuentras bien, existen miles de excusas para alargar su espera, como dijo aqu&eacute;l &quot;vuelva usted ma&ntilde;ana&quot; o si no un m&aacute;s elegante &quot;te lo podr&iacute;a dar, pero hay un problema con el checkbus de la BIOS y no me fi&oacute;, que espero respuesta de Redmon y tal...&quot;</p> <h2>9. Los resultados.</h2> <p>Puede que mucha gente deje de acudir a ti (te costara llegar a ese punto), pero no te ver&aacute;n como un ignorante o como alguien que ha abandonado el S.O. m&aacute;s usado, ante ellos seguir&aacute;s siendo el que m&aacute;s sabe, sobre todo por que aquellas personas que te aprecian y aprecias ser&aacute;n las mismas que te alagaran ante cualquiera, no importa a cuantos lusers jodas, siempre estar&aacute;n aquellos a los que reparas su ordenador como si fuera tuyo, as&iacute; que la explicaci&oacute;n a la que llegar&aacute;n estas personas al encontrarse para los casos de los lusers ser&aacute;n del tipo &quot;es que compra el ordenador en el Carrefeteur&quot; o &quot;es que tu hijo es muy torpe&quot; adem&aacute;s &iquest;quien quiere a esos <strong>lusers</strong>, desagradecidos y taca&ntilde;os? pues t&uacute;. mi amigo BOFH, por que si no &iquest;a quien ibas a amargar el d&iacute;a hoy? cuando llegues a BOFH ver&aacute;s que necesitas a esos peque&ntilde;os perdedores a los que hacer la vida imposible, y lo mejor de todo es que &iexcl;&iexcl;no pueden despedirte!! </p>
    
            </p>

            <h3>
                Categories:
                
        Articles, Humor
    
            </h3>

            <hr />
            <h1>Comentaris</h1>
            <ul class="list-group">
                
        <li class="list-group-item">Sense comentaris</li>
    
            </ul>


            <a href="http://catux.org/post_list.html">
                <i class="fas fa-chevron-left"></i>
                Arxius
            </a>
        </div>

    </div>


    </div> <!-- /.container -->

    <div class="container">
        <nav class="navbar navbar-inverse catux-footer">
            <p class="navbar-text">
                Tot el contingut de Catux està subjecte sota la nova versió de la llicència de
                <a href="http://creativecommons.org/licenses/by/2.5/es/deed.ca">Creative Commons</a>
            </p>
        </nav>
    </div>



</body>
</html>
