<!DOCTYPE html>
<html>
<head lang="cat">
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="description" content="Associació d'usuaris de GNU/Linux de la Catalunya Central">
    <meta name="keywords" content="gnu/linux, linux, programari lliure, gnu, lug, associacio, manresa, sant joan de vilatorrada, catalan, català, catalunya">
    <meta name="author" content="Catux">
    <link rel="icon" href="https://catux.org/images/favicon.ico">

    <title>Catux</title>

    <link rel="stylesheet" type="text/css" href="https://catux.org/css/main.css">
    <script src="https://catux.org/js/main.js"></script>
</head>
<body>
    <div class="navbar-wrapper">
        <div class="container">

            <nav class="navbar navbar-inverse">
                <div class="container">
                    <div class="navbar-header col-sm-5">
                        <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
                            <span class="sr-only">Toggle navigation</span>
                            <span class="icon-bar"></span>
                            <span class="icon-bar"></span>
                            <span class="icon-bar"></span>
                        </button>
                        <a href="https://catux.org/">
                            <img src="https://catux.org/images/catuxlogo.png" alt="Catux" width="40%"><br>
                            <div class="visible-lg"> Associació d'usuaris de GNU/Linux de la Catalunya Central</div>
                        </a>
                    </div>
                    <div id="navbar" class="navbar-collapse collapse navbar-links">
                        <ul class="nav navbar-nav navbar-right">
                            <li><a href="https://catux.org/post_list.html">Blog</a></li>
                            <li><a href="https://catux.org/traduccio.html">Traducció</a></li>
                            <li><a href="https://catux.org/contactar.html">Contactar</a></li>
                        </ul>
                    </div>
                </div>
            </nav>
        </div>
    </div> <!-- /.navbar-wrapper -->

    <div class="container">
        
    <div class="container-fluid">

        <div class="post">
            <a href="https://catux.org/post_list.html">
                <i class="fas fa-chevron-left"></i>
                Arxius
            </a>

            <h1>
                
        Catux-USB: història
    
            </h1>

            <h3>
                Escrit al
                
        2007-06-06 22:21:59
    
                per
                
        cpina
    
            </h3>

            <p>
                
        <p>En aquest article es fa un repas de la distribuci&oacute; Catux-USB. La seva hist&ograve;ria aix&iacute; com el seu estat present i futur. </p><p>&nbsp;</p><p>Un avan&ccedil; pels impacients: un futur negre.&nbsp;</p><h1>Hist&ograve;ria</h1><p>&nbsp;</p><p>&nbsp;</p><p>Va ser a finals de l&#39;any 2003 que diversa gent de Catux va tenir la idea de fer una distribuci&oacute; que funcion&eacute;s directament des d&#39;una mem&ograve;ria USB. Que arranqu&eacute;s, aprofit&eacute;s b&eacute; l&#39;espai i sobretot que es pogu&eacute;s escriure tant a l&#39;&agrave;rea d&#39;usuari (el /home, vaja) com a l&#39;&agrave;rea de sistema (tota la resta). A m&eacute;s a m&eacute;s, que tingu&eacute;s auto-reconeixement de maquinari. De fet, era for&ccedil;a el comen&ccedil;ament de Catux! </p><p>Des de finals de 2003 fins al juliol del 2004 vam estar-hi treballant. Molta gent de Catux hi va col&middot;laborar, per&ograve; diria que els que m&eacute;s vam fer va ser en Jordi Vilalta, en Mario Molano i en Carles Pina (ull! sense desmer&egrave;ixer altre gent!)</p><p>&nbsp;</p><p>El punt culminant va ser la presentaci&oacute; de la Catux-USB com a pon&egrave;ncia a les Jornades de Programari Lliure. Aquelles jornades van ser fetes a Manresa, i a m&eacute;s a m&eacute;s Catux hi va col&middot;laborar extensivament: taller de xarxa WI-FI, pon&egrave;ncia de Catux-USB i vam col&middot;laborar molt tamb&eacute; com a &quot;vigilants de tauler&quot; (&eacute;s a dir, controlant les inscripcions i tot aix&ograve;).</p><p>&nbsp;</p><p>A les Jornades es va presentar la Catux-USB 0.1. Poc despr&eacute;s vam pujar la Catux-USB 0.1a que corregia alguna errada &quot;senzilla per&ograve; important&quot;. Aquesta Catux-USB estava basada amb la Damn Small Linux i el pegat d&#39;ext2-compr (per comprimir extended 2). De fet, vam ser (que jo s&agrave;piga) els primers a permetre escriure en un USB a la zona de sistema: per tant pod&iacute;em fer un apt-get install Program_Que_Sigui i funcionava. </p><p><img src="arxius/fotos/catux-usb/WEB3JPL_105.jpg" alt="Catux-USB: presentaci&oacute; a les jornades" width="600" height="450" /> </p><p>&nbsp;</p><p>&nbsp;</p><p><img src="arxius/fotos/catux-usb/WEB3JPL_111.jpg" alt="Presentaci&oacute; Jornades II" width="600" height="450" /> </p><p>&nbsp;</p><p>L&#39;experi&egrave;ncia va ser molt bona. Vam tenir el nostre moment de fama&nbsp;:-) A l&#39;agost vam apar&egrave;ixer a la Linux Format. Unes 5 p&agrave;gines, explicant qu&egrave; era la Catux-USB, com baixar-la, instal&middot;lar-la, etc. </p><p>El setembre seg&uuml;ent vam estar presents durant la Merc&eacute; presentant la Catux-USB al Passeig de Gr&agrave;cia, a Barcelona. Vam explicar dos o tres cops al dia qu&egrave; era Catux-USB (i vam donar suport a gent que venia a con&egrave;ixer Linux, el programari lliure, etc.) </p><p><img src="arxius/fotos/catux-usb/WEBLaMerce_035.jpg" alt="Catux a la Merc&eacute; 2005" width="600" height="450" /> </p><br /><h2>Decad&egrave;ncia</h2><p>Per&ograve; aix&ograve; no va tenir continu&iuml;tat. Calia fer canvis estructurals a la Catux-USB: el pegat ext2-compr no era mantingut i tampoc ho pod&iacute;em/vol&iacute;em fer (ning&uacute; ho ha fet, el projecte e2compr est&agrave; abandonat tamb&eacute; i superat per altres projectes). </p><p>&nbsp;</p><p>La Catux-USB 0.1 venia d&#39;una Damn Small Linux, per&ograve; calia recomen&ccedil;ar amb tot el qu&egrave; ja sab&iacute;em per continuar amb el projecte. Dels 3 membres del nucli de l&#39;equip, dos van perdre for&ccedil;a r&agrave;pidament l&#39;inter&egrave;s amb els canvis. Un per feina i fam&iacute;lia, i un altre segurament es va cansar despr&eacute;s de dedicar for&ccedil;a temps a la primera versi&oacute; i esperava un substitut. I per adobar-ho, despr&eacute;s de treballar una temporada a una empresa fent una distribuci&oacute; en CD (feina trobada a arrel de la Catux-USB!). El tercer membre va comen&ccedil;ar l&#39;aventura de refer la Catux-USB per&ograve; tot anava lent i va trobar poc suport d&#39;altra gent. Vaja, que ning&uacute; va tirar del carro. Es va muntar el Trac (gestor de projectes, subversion, etc.) al servidor de Catux. Va anar molt lent el desenvolupament.</p><p>&nbsp;</p><p>Fer una distribuci&oacute; necessita for&ccedil;a temps (provar, reprovar, etc.) i almenys un grup d&#39;usuaris per provar la feina feta a diverses m&agrave;quines i minimitzar problemes. Durant aquests anys quasi no s&#39;ha fet feina per la Catux-USB 0.2. B&eacute;, feina a &quot;trompicades&quot; per&ograve; poca feina. A m&eacute;s a m&eacute;s, hi ha hagut altres coses que han evolucionat: ara hi ha distribucions MOLT bones que funcionen amb USB (de fet, ara s&#39;hi pot posar una Ubuntu entre altres). La Catux-USB funcionava b&eacute; amb mem&ograve;ries USB de 128 MB (i molt b&eacute; amb 256 MB). Per&ograve; ara les mem&ograve;ries de m&eacute;s capacitat s&oacute;n molt abastables i no cal treballar tant amb l&#39;optimitzaci&oacute; d&#39;aquests. Vaja: ara hi ha distribucions que ja fan el qu&egrave; feia la Catux-USB, i a m&eacute;s a m&eacute;s el qu&egrave; tenia de molt bo la Catux-USB ja no cal tenir-ho&nbsp;:-) (compressi&oacute;).</p><p>&nbsp;</p><p> De fet, tamb&eacute; van apar&egrave;ixer altres sistemes de fitxers comprimits i no cal el ext2-compr, per&ograve; diria que les distribucions aquestes tampoc fan servir aquests sistemes de fitxers. Un altre problema &eacute;s que ning&uacute; del nucli de desenvolupadors la feia servir habitualment. &Eacute;s molt m&eacute;s f&agrave;cil mantenir un programa que qui el desenvolupa el fa servir que no nom&eacute;s fer-lo servir per desenvolupar-lo (aix&ograve;, a la feina funciona, per&ograve; fora de la feina no funciona).</p><p>&nbsp;</p><p>Per tant, i despr&eacute;s de 3 anys i poc amb una sola versi&oacute;, i sense que ning&uacute; tingui &agrave;nims per continuar el projecte a curt termini: la Catux-USB est&agrave; discontinuada. Ha estat molt maco mentre ha durat. Per&ograve; allargar-ho artificialment no conv&eacute; i crec/creiem que ja s&#39;ha allargat massa i tot. O no, sempre podia reviure. I aix&ograve; que la versi&oacute; segona tenia for&ccedil;a coses interessants (properament posarem algun enlla&ccedil; aqu&iacute; amb aquestes idees).</p><p>&nbsp;</p><p>Gr&agrave;cies a tothom qui ha donat suport, a qui l&#39;ha fet servir, etc. Potser hi tornarem, qui sap! De fet, si alg&uacute; vol fer una distribuci&oacute; USB que ens demani idees/consells: en tenim uns quants! ens falten ganes, temps, for&ccedil;a per fer-ho. Altres projectes s&oacute;n m&eacute;s prioritaris per membres individuals de Catux, i Catux en s&iacute; com a grup actualment &eacute;s orfe d&#39;un &quot;gran projecte&quot;.</p>
    
            </p>

            <h3>
                Categories:
                
        Articles, Catux
    
            </h3>

            <hr />
            <h1>Comentaris</h1>
            <ul class="list-group">
                
        <li class="list-group-item comment">Amb tot, FELICITATS!!!! Tot i que el final de l\'article sembleu una mica \"decepcionats\", la feina que vareu fer en el seu moment va ser molt bona, i no es desmereix el fet que després no s\'hagi pogut continuar-ho. 

Vaja, que mireu el passat amb l\'alegria d\'haver estat els primers en pensar i FER una distro sobre USB !! i no pas amb l\'enyorança del que podria haver estat.

FELICITATS per la feina!!!

* e *<p class="comment-author">Escrit al 2007-06-11 11:29:37 per *e*</p></li><li class="list-group-item comment">Bona feina La veritat es que buscant una distro per  USB he conegut el vostre projecte... al final, he carregat una DSL, però, si algun dia puc muntar un producte CAT... seria genial.
M\'agradaria poder ajudar, però soc poc mes que un usuari, sap greu.
Apa nois, salut i empenta, i com diu l\'anterior comentari...
FELICITATS per la feina!!!<p class="comment-author">Escrit al 2007-06-26 11:23:49 per Albert</p></li><li class="list-group-item comment">* e *: no, no estem decepcionats. Jo em sento molt orgullós d\'haver col·laborat en el projecte! I sóc conscient que va ser un bon pas important, que érem els primers, etc.

Home, un punt de tristor que ningú va continuar (ni nosaltres ni altre gent) sí, però les coses són com són. Jo hi tornaria!

Albert: gràcies pels ànims. Potser més endavant continuem, però ara ja era el moment de tancar barraca si realment no volíem continuar properament.

Gràcies

Carles.<p class="comment-author">Escrit al 2007-07-07 18:15:01 per cpina</p></li>
    
            </ul>


            <a href="https://catux.org/post_list.html">
                <i class="fas fa-chevron-left"></i>
                Arxius
            </a>
        </div>

    </div>


    </div> <!-- /.container -->

    <div class="container">
        <nav class="navbar navbar-inverse catux-footer">
            <p class="navbar-text">
                Tot el contingut de Catux està subjecte sota la nova versió de la llicència de
                <a href="http://creativecommons.org/licenses/by/2.5/es/deed.ca">Creative Commons</a>
            </p>
        </nav>
    </div>



</body>
</html>
