<!DOCTYPE html>
<html>
<head lang="cat">
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="description" content="Associació d'usuaris de GNU/Linux de la Catalunya Central">
    <meta name="keywords" content="gnu/linux, linux, programari lliure, gnu, lug, associacio, manresa, sant joan de vilatorrada, catalan, català, catalunya">
    <meta name="author" content="Catux">
    <link rel="icon" href="http://catux.org/images/favicon.ico">

    <title>Catux</title>

    <link rel="stylesheet" type="text/css" href="http://catux.org/css/main.css">
    <script src="http://catux.org/js/main.js"></script>
</head>
<body>
    <div class="navbar-wrapper">
        <div class="container">

            <nav class="navbar navbar-inverse">
                <div class="container">
                    <div class="navbar-header col-sm-5">
                        <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
                            <span class="sr-only">Toggle navigation</span>
                            <span class="icon-bar"></span>
                            <span class="icon-bar"></span>
                            <span class="icon-bar"></span>
                        </button>
                        <a href="http://catux.org/">
                            <img src="http://catux.org/images/catuxlogo.png" alt="Catux" width="40%"><br>
                            <div class="visible-lg"> Associació d'usuaris de GNU/Linux de la Catalunya Central</div>
                        </a>
                    </div>
                    <div id="navbar" class="navbar-collapse collapse navbar-links">
                        <ul class="nav navbar-nav navbar-right">
                            <li><a href="http://catux.org/post_list.html">Blog</a></li>
                            <li><a href="http://catux.org/traduccio.html">Traducció</a></li>
                        </ul>
                    </div>
                </div>
            </nav>
        </div>
    </div> <!-- /.navbar-wrapper -->

    <div class="container">
        
    <div class="container-fluid">

        <div class="post">
            <a href="http://catux.org/post_list.html">
                <i class="fas fa-chevron-left"></i>
                Arxius
            </a>

            <h1>
                
        Catux a la Universitat de Prades
    
            </h1>

            <h3>
                Escrit al
                
        2006-08-22 00:00:00
    
                per
                
        laura
    
            </h3>

            <p>
                
        <span class="noticia"><strong>Actualitzaci&oacute;</strong>: Ja hem penjat les <a href="http://catux.org/fotos/index.php?list=23">fotos de Prades</a>.<br /> <br /> <br /> Com segur sabeu, Catux est&agrave; participant en el manteniment de l&#39;aula d&#39;inform&agrave;tica que hi ha a la <a href="http://www.ucestiu.com/"> Universitat d&#39;Estiu a Prada de Conflent</a> en la Catalunya Nord.<br /> <br /> Fa una setmana llarga vam pujar tres catuxers per preparar i posar en marxa una sala d&#39;ordinadors amb GNU/Linux instal&middot;lat. La funci&oacute; b&agrave;sica d&#39;aquests ordinadors &eacute;s i era facilitar l&#39;acc&eacute;s a Internet dels assistents a la UCE, per&ograve; segurament hem fet algun nou interessat amb el m&oacute;n del programari lliure ja que hem estat donant distribucions Ubuntu i Kubuntu a tot aquell que s&#39;ha interessat pel tema i repartint follets explicant que &eacute;s tot aquest m&oacute;n i qui som els de Catux.<br /> <br /> El diumenge, tanmateix, alguns dels que vam pujar, vam haver d&#39;anar cap a casa per diversos motius, deixant aquelles terres que ens han furtat el cor. Per&ograve; malgrat la nostra partida l&#39;activitat no ha cessat, i uns altres catuxers ens vam substituir, estic segura qu&egrave; ho faran tan b&eacute; o millor que nosaltres.<br />  <br /> S&#39;ha de dir que ens han facilitat un bon material, com per exemple ordinadors potents que son capa&ccedil;os de donar servei moltes hores al dia a tot aquell expert o inexpert internauta que t&eacute; curiositat per veure el que tenim muntat all&agrave;. La sala tamb&eacute; disposa d&#39;una ADSL d&#39;1MB d&#39;ample de banda, que tenint en compte la situaci&oacute; geogr&agrave;fica del poble, &eacute;s m&eacute;s que lloable.<br /> <br /> Abans d&#39;acabar, haig de mencionar el bon tracte que hem rebut per part de la gent que porta la UCE, ens han donat tot el que hem demanat i estava al seu abast, i ens han deixat fer a la nostra manera moltes coses, fent realitat all&ograve; que diuen de la UCE que &eacute;s una Universitat Oberta en molts sentits.<br /> <br /> Tamb&eacute; recordar als periodistes i als assistents a la UCE com a professors o com a alumnes, tinc la convicci&oacute; de que tots ells han quedat satisfets del servei que els hem facilitat, dintre dels problemes inicials que hi ha sempre a qualsevol activitat d&#39;aquest tipus.<br /> <br /> Concloent ja, no puc deixar de transmetre el bon regust de boca que ens deixa el nostre pas per les terres de la Catalunya Nord, l&#39;experi&egrave;ncia ha estat enriquidora i engrescadora. Esperem poder repetir a les seg&uuml;ents edicions de la UCE.<br />  <br /> Gracies a tots aquells que han fet possible la nostra participaci&oacute; i han ajudat a que fora com est&agrave; marxant tot :)<br /> <br /> <br /> Enlla&ccedil;os relacionats:<br /> <br /> <a href="http://www.ucestiu.com/">http://www.ucestiu.com/</a><br /> <a href="http://ca.wikipedia.org/wiki/UCE">Universitat Catalana d&#39;Estiu segons la wikipedia</a><br /> <a href="http://www.elpais.es/articulo/cataluna/Empieza/38/Universitat/d/Estiu/Prada/800/alumnos/elpepiautcat/20060816elpcat_3/Tes/">Article de El Pa&iacute;s, Empieza la 38&ordf; Universitat d&#39;Estiu de Prada con 800 alumnos</a></span>
    
            </p>

            <h3>
                Categories:
                
        Notícies, Últimes notícies
    
            </h3>

            <hr />
            <h1>Comentaris</h1>
            <ul class="list-group">
                
        <li class="list-group-item">Sense comentaris</li>
    
            </ul>


            <a href="http://catux.org/post_list.html">
                <i class="fas fa-chevron-left"></i>
                Arxius
            </a>
        </div>

    </div>


    </div> <!-- /.container -->

    <div class="container">
        <nav class="navbar navbar-inverse catux-footer">
            <p class="navbar-text">
                Tot el contingut de Catux està subjecte sota la nova versió de la llicència de
                <a href="http://creativecommons.org/licenses/by/2.5/es/deed.ca">Creative Commons</a>
            </p>
        </nav>
    </div>



</body>
</html>
