<!DOCTYPE html>
<html>
<head lang="cat">
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="description" content="Associació d'usuaris de GNU/Linux de la Catalunya Central">
    <meta name="keywords" content="gnu/linux, linux, programari lliure, gnu, lug, associacio, manresa, sant joan de vilatorrada, catalan, català, catalunya">
    <meta name="author" content="Catux">
    <link rel="icon" href="https://catux.org/images/favicon.ico">

    <title>Catux</title>

    <link rel="stylesheet" type="text/css" href="https://catux.org/css/main.css">
    <script src="https://catux.org/js/main.js"></script>
</head>
<body>
    <div class="navbar-wrapper">
        <div class="container">

            <nav class="navbar navbar-inverse">
                <div class="container">
                    <div class="navbar-header col-sm-5">
                        <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
                            <span class="sr-only">Toggle navigation</span>
                            <span class="icon-bar"></span>
                            <span class="icon-bar"></span>
                            <span class="icon-bar"></span>
                        </button>
                        <a href="https://catux.org/">
                            <img src="https://catux.org/images/catuxlogo.png" alt="Catux" width="40%"><br>
                            <div class="visible-lg"> Associació d'usuaris de GNU/Linux de la Catalunya Central</div>
                        </a>
                    </div>
                    <div id="navbar" class="navbar-collapse collapse navbar-links">
                        <ul class="nav navbar-nav navbar-right">
                            <li><a href="https://catux.org/post_list.html">Blog</a></li>
                            <li><a href="https://catux.org/traduccio.html">Traducció</a></li>
                        </ul>
                    </div>
                </div>
            </nav>
        </div>
    </div> <!-- /.navbar-wrapper -->

    <div class="container">
        
    <div class="container-fluid">

        <div class="post">
            <a href="https://catux.org/post_list.html">
                <i class="fas fa-chevron-left"></i>
                Arxius
            </a>

            <h1>
                
        CLUF
    
            </h1>

            <h3>
                Escrit al
                
        2005-10-08 00:00:00
    
                per
                
        franhp
    
            </h3>

            <p>
                
        <span class="noticia">En aquest article comprobarem les parts m&eacute;s interessants del contracte que estableix Microsoft amb els seus usuaris, conegut normalment com a CLUF.</span><br />    <div id="article" class="article_normal">Parts interessants d&#39;un CLUF<br /> <br /> Amb aquest article pretenc trobar totes les coses que te aquest contracte que hom fa amb Microsoft moltes vegades a desgana o d&#39;altres sense saber-ho. Durant la fase d&#39;instal&middot;laci&oacute; ofereix la possibilitat de llegir-lo per&ograve; ning&uacute; ho fa, doncs saben que si pitgen F8 no ho tindran que llegir i la instal&middot;laci&oacute; del seu Windows XP seguir&agrave; sense oposar-s&#39;hi en res. (Al menys durant la instal&middot;laci&oacute; de l&#39;OpenOffice et fa baixar fins al final del contracte per a poder acceptar!)<br /> El que molta gent no sap, &eacute;s que si el llegissin riurien molt m&eacute;s que amb un mon&ograve;leg del Buenafuente. Observeu.<br /> <br /> Es seguir&agrave; el seg&uuml;ent estil:<br /> -- significa que &eacute;s un article del CLUF<br /> **comentari de l&#39;autor sobre l&#39;article<br /> <br /> -- AL INSTALAR, COPIAR O DE OTRA MANERA UTILIZAR EL SOFTWARE, USTED ACEPTA QUEDAR OBLIGADO POR LOS T&Eacute;RMINOS DE ESTE CLUF. SI USTED NO EST&Aacute; DE ACUERDO CON LOS T&Eacute;RMINOS DE ESTE CLUF, ENTONCES NO UTILICE NI COPIE EL SOFTWARE Y P&Oacute;NGASE EN CONTACTO CUANTO ANTES CON EL FABRICANTE PARA OBTENER INSTRUCCIONES ACERCA DE C&Oacute;MO DEVOLVER EL PRODUCTO O LOS PRODUCTOS NO UTILIZADOS A LOS EFECTOS DE OBTENER UN REEMBOLSO, DE ACUERDO CON LAS NORMAS DEL FABRICANTE EN MATERIA DE DEVOLUCIONES.<br /> <br /> **Aquesta opci&oacute; &eacute;s molt interessant: Ens podem negar a utilitzar el software que l&#39;ordinador portava pre-instal&middot;lat. A m&eacute;s a m&eacute;s, estan obligats a retornar-te els calers que costa la seva llic&egrave;ncia sin&oacute; la utilitzes. El que no es comenta &eacute;s la dificultat que reflexa aix&ograve;, i la quantitat de diners que costen les trucades; es podria arribar a dir que &eacute;s m&eacute;s car tornar el producte que quedar-se amb ell.<br /> <br /> -- Usted s&oacute;lo puede instalar, usar, acceder, mostrar y ejecutar una copia del SOFTWARE en el EQUIPO. El SOFTWARE no puede ser utilizado en el EQUIPO al mismo tiempo por m&aacute;s de dos (2) procesadores.<br /> <br /> ** Aqu&iacute; la cosa es comen&ccedil;a a complicar i ja es plantegen els primers dubtes. Segons aquest article jo, no puc instal&middot;lar diverses versions de Windows al meu equip. Per exemple, hi ha molta gent que instal&middot;la Windows 98 per poder jugar a jocs que van deixar de funcionar al Windows XP i Windows XP per als jocs que no funcionen en Windows 98, d&#39;aquesta manera el teu equip passa a ser il&middot;legal a pesar de que tinguis les dues llic&egrave;ncies.<br /> El dubte m&eacute;s gran que em plantejo sobre aquest article &eacute;s: Per qu&eacute; van fer un BootLoader si no es poden executar m&eacute;s de una copia? <br /> Tamb&eacute; es posa en dubte la seva pr&ograve;pia pot&egrave;ncia en dir que no pot ser utilitzat per dos processadors al mateix temps, de fet si executes Linux en dos processadors notar&agrave;s una gran millora.<br /> <br /> -- [...]Si el SOFTWARE no va acompa&ntilde;ado del HARDWARE, Usted no puede utilizar el SOFTWARE. [...]<br /> <br /> ** Aqu&iacute; vaig caure a terra del riure. 20 minuts m&eacute;s tard em vaig intentar aixecar per&ograve; no ho vaig aconseguir davant d&#39;un altre atac de riure.<br /> <br /> -- Los derechos de licencia concedidos en el presente CLUF est&aacute;n limitados a los treinta (30) primeros d&iacute;as despu&eacute;s de instalar por primera vez el SOFTWARE<br /> <br /> ** Significar&agrave; aix&ograve; que despr&eacute;s de 30 dies serem lliures de fer el que ens plagui amb la nostre copia de Windows? Tamb&eacute; em va sorprendre que anomen&eacute;s drets a aquest seguit d&#39;articles si m&eacute;s b&eacute; eren obligacions o deures.<br /> <br /> -- Conexiones de Dispositivos. Usted puede permitir que un m&aacute;ximo de cinco (5) equipos u otros dispositivos electr&oacute;nicos (cada uno denominado &quot;Dispositivo&quot;) se conecten al EQUIPO para utilizar uno o m&aacute;s de los servicios del SOFTWARE<br /> <br /> ** Aquesta pot ser molt dram&agrave;tica, doncs si jo tinc 6 reproductors d&#39;MP3 (optimista), no podr&eacute; connectar-los tots a la vegada! Segur que &eacute;s que encara no han descobert com es fa per poder posar m&eacute;s de 5 dispositius sense fer perillar la estabilitat del sistema.<br /> <br /> --Copia de seguridad. USTED S&Oacute;LO PUEDE HACER UNA &Uacute;NICA COPIA DE SEGURIDAD DEL SOFTWARE. USTED PUEDE UTILIZAR UNA (1) COPIA DE SEGURIDAD &Uacute;NICAMENTE CON FINES DE ARCHIVO Y PARA REINSTALAR EL SOFTWARE EN EL EQUIPO. SALVO POR LO DISPUESTO EXPRESAMENTE EN EL PRESENTE CLUF O POR LA LEGISLACI&Oacute;N LOCAL, USTED NO PUEDE HACER DE NINGUNA OTRA MANERA COPIAS DEL SOFTWARE NI DE LOS MATERIALES IMPRESOS QUE ACOMPA&Ntilde;AN AL SOFTWARE. NO PODR&Aacute; DAR EL CD O LA COPIA DE SEGURIDAD EN ALQUILER, ARRENDAMIENTO O PR&Eacute;STAMO, AS&Iacute; COMO TAMPOCO CEDERLO A OTRO USUARIO.<br /> <br /> ** Aquest cop em vaig prepara un matal&agrave;s a terra, aix&iacute; vaig poder tirar-me tranquil&middot;lament a riure.<br /> <br /> -- SELECCI&Oacute;N DE IDIOMA. Es posible que el Fabricante haya decidido proporcionarle a Usted, una sola vez, una selecci&oacute;n de dos o m&aacute;s versiones de idioma del SOFTWARE como parte del proceso de instalaci&oacute;n del SOFTWARE. En dicho caso, Usted s&oacute;lo tiene licencia para utilizar una (1) de las versiones de idioma proporcionadas. Una vez Usted haya utilizado una versi&oacute;n de idioma, no dispondr&aacute; de licencia para usar ninguna de las dem&aacute;s versiones de idioma que el Fabricante haya incluido con el EQUIPO.<br /> <br /> ** Si trio castell&agrave; durant la instal&middot;laci&oacute; vol dir que mai m&eacute;s podr&eacute; triar catal&agrave; i tindr&eacute; que viure la resta de la meva vida en castell&agrave;? Doncs si. Si tinguessis Linux, aix&ograve; no passaria, doncs es pot configurar l&#39;idioma tantes vegades com vulguis! <br /> <br /> -- SOPORTE T&Eacute;CNICO DE PRODUCTO. El soporte t&eacute;cnico del SOFTWARE no es proporcionado por MS, Microsoft Corporation ni las sociedades de su grupo. Para obtener servicios de soporte t&eacute;cnico para el SOFTWARE, consulte el n&uacute;mero de tel&eacute;fono de soporte t&eacute;cnico del Fabricante que se proporciona junto con la documentaci&oacute;n que acompa&ntilde;a al HARDWARE <br /> <br /> ** Molt b&eacute;, el primer argument que donen les empreses &eacute;s aquest, Microsoft ens dona suport t&egrave;cnic mentre que Linux no ( Feu veure que no heu llegit l&#39;anterior frase, doncs &eacute;s conegut que hi han empreses que donen suport, em referia a l&#39;empresari indec&iacute;s). Doncs no, Microsoft tampoc ens dona suport, i llavors qui el d&oacute;na? Els pobres fabricants de hardware que no tenen res a veure amb Microsoft ?<br /> <br /> <br /> -- [...] p&oacute;ngase en contacto con la filial de Microsoft que atiende a su pa&iacute;s o escriba en ingl&eacute;s a Microsoft Sales Information Center/One Microsoft [...]<br /> <br /> ** Jo no vull escriure en un altre idioma que no sigui el meu, si m&#39;hi veig obligat seria capa&ccedil; d&#39;escriure en castell&agrave; per&ograve; tampoc ho accepten, nom&eacute;s accepten angl&egrave;s! Es veu que no tindran gaires traductors en n&ograve;mina.(Posteriorment he sigut informat de la exist&eacute;ncia de Microsoft Ib&egrave;rica, on es pot escriure en castell&agrave;)<br /> <br /> -- 20. RESOLUCI&Oacute;N. Sin perjuicio de cualquier otro derecho, el Fabricante o MS pueden resolver inmediatamente este CLUF en caso de que Usted incumpla los t&eacute;rminos y condiciones del mismo. En dicho caso, Usted deber&aacute; destruir todas las copias del SOFTWARE y todos sus componentes.<br /> <br /> ** Voleu dir que fa falta destruir tots els nostres components? Pobres de vosaltres que incompliu qualsevol dret, haureu de cremar el CD i enviar les cendres per correu a can Bill.<br /> <br /> -- 21. AVISO RELATIVO A LA SEGURIDAD. Como ayuda en la protecci&oacute;n frente a infracciones de seguridad y software pernicioso, le rogamos haga peri&oacute;dicamente copias de seguridad de los datos y la informaci&oacute;n del sistema, utilice caracter&iacute;sticas de seguridad como servidores de seguridad e instale y utilice actualizaciones de seguridad.<br /> <br /> ** &ldquo; software pernicioso &ldquo; se li pot aplicar aquest distintiu al software ? De totes maneres gr&agrave;cies per l&#39;av&iacute;s ho tindr&eacute; en compte.<br /> <br /> -- Usted acepta que ning&uacute;n Producto est&aacute; libre de errores, y le recomendamos vivamente que haga copias de seguridad de sus archivos con regularidad. Siempre que Usted tenga una licencia v&aacute;lida, el Fabricante le garantiza que a) durante el periodo de 90 d&iacute;as siguientes a la fecha en que Usted reciba el Producto o durante el periodo m&iacute;nimo exigido por la ley aplicable, el Producto funcionar&aacute; sustancialmente de conformidad con los materiales que lo acompa&ntilde;an<br /> <br /> ** M&eacute;s recomanacions per part del pobre Bill, tots sabem que Windows no te forats de seguretat, per qu&egrave; ho deu dir doncs? <br /> Aquest article est&agrave; malament, he vist gent infectada amb el Blaster i el Sasser pasades 2 hores de la instal&middot;laci&oacute;.<br /> <br /> -- [Continua] Producto entregado en sustituci&oacute;n de otro estar&aacute; garantizado durante el tiempo restante del periodo de garant&iacute;a del Producto sustituido o, al menos, durante un periodo de treinta (30) d&iacute;as.<br /> <br /> ** S&#39;acaba el temps nois. Correu que encara hem de infectar m&eacute;s ordinadors (Blaster dixit)<br /> <br /> Conclusions:<br /> <br /> Mitjan&ccedil;ant aquest CLUF podem comprobar que GPL &eacute;s molt millor i que GNU/Linux encara ho &eacute;s m&eacute;s. Un contracte aix&iacute; no mereix la pena ser revisat ni ser utilitzat (haur&eacute; perdut el temps?). De totes maneres espero que vos hagueu divertit una estoneta!</div>
    
            </p>

            <h3>
                Categories:
                
        Articles, Humor
    
            </h3>

            <hr />
            <h1>Comentaris</h1>
            <ul class="list-group">
                
        <li class="list-group-item">Sense comentaris</li>
    
            </ul>


            <a href="https://catux.org/post_list.html">
                <i class="fas fa-chevron-left"></i>
                Arxius
            </a>
        </div>

    </div>


    </div> <!-- /.container -->

    <div class="container">
        <nav class="navbar navbar-inverse catux-footer">
            <p class="navbar-text">
                Tot el contingut de Catux està subjecte sota la nova versió de la llicència de
                <a href="http://creativecommons.org/licenses/by/2.5/es/deed.ca">Creative Commons</a>
            </p>
        </nav>
    </div>



</body>
</html>
