<!DOCTYPE html>
<html lang="ca">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="description" content="Associació d'usuaris de GNU/Linux de la Catalunya Central">
    <meta name="keywords" content="gnu/linux, linux, programari lliure, gnu, lug, associacio, manresa, sant joan de vilatorrada, catalan, català, catalunya">
    <meta name="author" content="Catux">
    <link rel="icon" href="https://catux.org/images/favicon.ico">

    <title>Catux - Associació d'usuaris de GNU/Linux de la Catalunya Central</title>

    <!-- Bootstrap 5 CSS is included in main.css -->
    <link rel="stylesheet" type="text/css" href="https://catux.org/css/main.css">
    <!-- Bootstrap 5 JS and dependencies are included in main.js -->
    <script src="https://catux.org/js/main.js" defer></script>
</head>
<body>
    <header class="sticky-top">
        <nav class="navbar navbar-expand-lg navbar-dark bg-dark py-3">
            <div class="container-fluid">
                <a class="navbar-brand" href="https://catux.org/">
                    <img src="https://catux.org/images/catuxlogo.png" alt="Catux" height="50" class="me-3">
                    <div class="d-none d-lg-block">Associació d'usuaris de GNU/Linux de la Catalunya Central</div>
                </a>
                <button class="navbar-toggler" type="button" data-bs-toggle="collapse" data-bs-target="#navbarMain" aria-controls="navbarMain" aria-expanded="false" aria-label="Toggle navigation">
                    <span class="navbar-toggler-icon"></span>
                </button>
                <div id="navbarMain" class="collapse navbar-collapse">
                    <ul class="navbar-nav ms-auto mb-2 mb-lg-0">
                        <li class="nav-item"><a class="nav-link px-3" href="https://catux.org/post_list.html">Blog</a></li>
                        <li class="nav-item"><a class="nav-link px-3" href="https://catux.org/traduccio.html">Traducció</a></li>
                        <li class="nav-item"><a class="nav-link px-3" href="https://catux.org/contactar.html">Contactar</a></li>
                    </ul>
                </div>
            </div>
        </nav>
    </header>

    <div class="container main-container">
        
    <div class="container-fluid">

        <div class="post">
            <a href="https://catux.org/post_list.html">
                <i class="fas fa-chevron-left"></i>
                Arxius
            </a>

            <h1>
                
        Configuració de clients de correu
    
            </h1>

            <h3>
                Escrit al
                
        2005-02-06 00:00:00
    
                per
                
        whats_up
    
            </h3>

            <p>
                
        <span class="noticia">Ja teniu <a href="http://www.catux.org/index.php?contingut=articles&amp;num=81">l&#39;article</a> que explica com configurar els vostres comptes de correu amb l&#39;evolution i amb el thunderbird. <br /> <br /> Tot i estar explicat pas a pas i amb un munt de captures de pantalla com fer-ho amb aquests dos clients, l&#39;article intenta anar una mica m&eacute;s enll&agrave; i ampliar els conceptes per tal que la gent sigui capa&ccedil; de configurar &quot;qualsevol&quot; client de correu.<br /> <br /> A gaudir-lo!</span> <br />    <div id="article" class="article_normal">Molta gent que segueix algun d&#39;aquests articles tant ben fets que volten per Internet que expliquen com muntar-se un servidor de correu (com per exemple aquest ;) ) es troben, que un cop han aconseguit muntar el servidor, no es saben configurar el seu client habitual, ja sigui l&#39;Evolution o el Thunderbird ;).<br /> <br /> En aquest article intentar&eacute; explicar com configurar els dos clients de correu m&eacute;s usats (del m&oacute;n? :P). Si enteneu m&eacute;s o menys com va, llavors sereu capa&ccedil;os de configurar-ne qualsevol per molt estranya que sigui la configuraci&oacute;.<br /> <br /> Comen&ccedil;arem amb l&#39;Evolution que &eacute;s el que estic usant actualment. La meva versi&oacute; encara &eacute;s la 1.4.6, perqu&egrave; m&#39;ha fet mandra actualitzar, per&ograve; tots aquells que useu la 2.0 o superior, veureu que &eacute;s quasi id&egrave;ntic.<br /> <br /> <br /> <h2>EVOLUTION</h2><br /> <br /> L&#39;Evolution &eacute;s un client de programari de grup (&#39;groupware&#39;) dels millors que hi han. Aquest client gestiona el correu, els contactes, les cites, el calendari, etc.<br /> <br /> <img src="http://www.catux.org/imatges/articles/81/evolution1.jpg" alt="" /><br /> <br /> Per accedir a la configuraci&oacute; dels diferents comptes de correu, anirem a:<br /> Tools --&gt; Settings , i ens apareixer&agrave; una pantalla com la seg&uuml;ent:<br /> <br /> <img src="http://www.catux.org/imatges/articles/81/evolution2.jpg" alt="" /><br /> <br /> Per afegir un compte farem clic a Add:<br /> <br /> <img src="http://www.catux.org/imatges/articles/81/evolution3.jpg" alt="" /><br /> <br /> A la primera casella hi va una descripci&oacute; del compte, jo he posat Personal, i entre par&egrave;ntesis el servidor que em proporciona el servei, en aquest cas wekk.net.<br /> <br /> Si voleu que sigui el vostre compte per defecte, marqueu la casella de sota.<br /> <br /> Les caselles de sota s&oacute;n per ordre:<br /> <br /> - El vostre nom. Aquest &eacute;s el nom amb que apareixer&agrave;s a tos els destinataris de dels teus correus. <br /> <br /> - La vostra adre&ccedil;a de correu electronic que esteu configurant.<br /> <br /> Normalment, quan reps un correu, veus qui &eacute;s qui te l&#39;envia amb un nom i entre par&egrave;ntesis una adre&ccedil;a de correu. En el nostre cas, quan jo envii correus, la gent veur&agrave; que els rep de &ldquo;Albert Sellar&egrave;s (whats@wekk.net)&rdquo;<br /> <br /> - En cas que volgu&eacute;ssim que tots els correus enviats des d&#39;aquest compte de correu ens contestessin a una altre compte, posar&iacute;em en aquest requadre l&#39;adre&ccedil;a on volem rebre les respostes als nostres correus. Com que no &eacute;s el cas, la deixem en blanc.<br /> <br /> - Organitzaci&oacute;. En cas que sigui, per exemple, el correu de la feina, podem posar el nom de l&#39;empresa que sempre queda b&eacute; :P<br /> <br /> - Signatura. Si volem que a cada correu que enviem, s&#39;afegeixi autom&agrave;ticament un text al capdavall del correu, haurem de crear una signatura fent clic al bot&oacute; &ldquo;Add signature...&rdquo;, un cop creada, la seleccionarem a &ldquo;Default signature&rdquo;.<br /> <br /> Jo per exemple hi tinc:<br /> <br /> -- <br />   Albert Sellar&egrave;s        GPG id: 0xB88C621A     <br />   http://www.wekk.net    whats_up@jabber.org <br />   Membre de Catux.org    http://catux.org    <br />   Linux User: 324456     Catalunya           <br /> <br /> <br /> A la seg&uuml;ent pantalla triarem de quina manera ens baixarem el correu. Nom&eacute;s explicar&eacute; el cas en que el servidor de correu es troba en una m&agrave;quina diferent de la qu&egrave; tenim instal&middot;lat l&#39;Evolution.<br /> <br /> Aqu&iacute; ja necessitem saber dades del nostre compte de correu. Segurament tindreu alguna d&#39;aquestes dues opcions per tal de descarregar-vos el correu: IMAP o POP (tamb&eacute; anomenat pop3).<br /> <br /> Aquests dos tipus de protocols serveixen per consultar el correu, i descarregar-lo del servidor cap a la nostra m&agrave;quina per poder-los llegir. Un cop descarregats tenim la possibilitat de borrar-los del servidor, o deixar-los-hi.<br /> <br /> Aix&ograve; &eacute;s el qu&egrave; hem de posar en el primer bot&oacute;. En el meu cas he triat IMAP, per&ograve; els seg&uuml;ents passos seran id&egrave;ntics. <br /> <br /> Si el vostre prove&iuml;dor us diu que el vostre compte &eacute;s del tipus imap-ssl, o pop-ssl, no canvia res, ja que la &uacute;nica difer&egrave;ncia, &eacute;s que usareu xifratge per tal de comunicar-vos amb el vostre servidor. M&eacute;s endavant explico quins canvis implica si &eacute;s el vostre cas.<br /> <br /> <img src="http://www.catux.org/imatges/articles/81/evolution4.jpg" alt="" /><br /> <br /> On posa &ldquo;Host&rdquo;, hi hem de posar el nom del nostre servidor de correu entrant, en el nostre cas mail.wekk.net.<br /> <br /> &ldquo;Username&rdquo;: Aqu&iacute; hi va el nom de l&#39;usuari. Acostuma a ser o la part de davant @, o tota la direcci&oacute; de correu.<br /> <br /> &ldquo;User secure connection SSL&rdquo;: Aqu&iacute; &eacute;s on hem de posar &ldquo;Allways&rdquo; si el nostre prove&iuml;dor ens ha dit que tenim connexi&oacute; segura. Si no ho suporta, posarem Never, i en tot cas, podem posar &ldquo;Whenever possible&rdquo; que, en cas que ho suporti, ens ho far&agrave; servir.<br /> <br /> &ldquo;Authentication type&rdquo;: Primer farem clic al bot&oacute; de &ldquo;Check for supported types&rdquo; que, en cas que haguem configurat b&eacute; el nom del servidor i l&#39;opci&oacute; de SSL, ens indicar&agrave; els diferents sistemes d&#39;autenticaci&oacute; que suporta el nostre servidor. Nom&eacute;s dir que els dos primers tipus s&oacute;n amb text pla, i els altres s&oacute;n amb contrasenya xifrada, per tant en cas que no fem servir l&#39;opci&oacute; de SSL, &eacute;s important que triem una autenticaci&oacute; xifrada.<br /> <br /> La seg&uuml;ent pestanya (Receiving opcions) me la salto ja que no &eacute;s necess&agrave;ria per a poder usar el nostre compte correu.<br /> <br /> La seg&uuml;ent pestanya &eacute;s &ldquo;Sending Mail&rdquo;. En aquesta pestanya haurem de configurar el compta que volem usar per enviar correu. L&#39;Evolution ens deixa triar entre dues opcions: Sendmail o SMTP.<br /> <br /> A nosaltres ens interessa SMTP, ja que sendmail nom&eacute;s la far&iacute;em servir en el cas que tingu&eacute;ssim un servidor de correu a la mateixa m&agrave;quina on tenim instal&middot;lat l&#39;Evolution. Com que la majoria dels casos no &eacute;s aix&iacute;, anem directes al gra.<br /> <br /> <img src="http://www.catux.org/imatges/articles/81/evolution5.jpg" alt="" /><br /> <br /> &ldquo;Host&rdquo;: aix&ograve; ens ho ha de donar el nostre prove&iuml;dor de correu. Normalment &eacute;s una cosa semblant a smtp.wekk.net o mail.wekk.net.<br /> <br /> &ldquo;Use secure connection SSL&rdquo;: Aix&ograve; &eacute;s el mateix que en la pestanya de receiving mail. Si ens ho permet, usarem SSL, sino provarem el whenever possible, i en cas de no anar, hi posarem Never.<br /> <br /> &ldquo;Autenticaction type&rdquo;: Repetirem el proc&eacute;s que hem fet abans. Fem clic a &ldquo;Check for supported types&rdquo;, i llavors triarem un dels tipus suportats, a poder ser, un que estigui a la tercera posici&oacute; o m&eacute;s enll&agrave;.<br /> <br /> <br /> Un cop fet aix&ograve;, ja podem enviar i rebre correus des de el nostre magnific Evolution! :)<br /> <br /> <br /> <br /> <h2>MOZILLA THUNDERBIRD 0.9</h2><br /> <br /> Recomano haver llegit pr&egrave;viament com configurar l&#39;Evolution ja que aqu&iacute; no explico tant que &eacute;s cada camp.<br /> <br /> El client de correu de la gent de Mozilla, est&agrave; molt b&eacute; com totes les eines d&#39;aquesta gent, el principal avantatge que jo hi trobo, &eacute;s que &eacute;s multi-plataforma.<br /> <br /> <img src="http://www.catux.org/imatges/articles/81/thunderbird1.jpg" alt="" /><br /> <br /> Per a configurar un compte de correu, haurem d&#39;anar a Tools -&gt; Account Settings... i ens apareixer&agrave; una pantalla com aquesta:<br /> <br /> <img src="http://www.catux.org/imatges/articles/81/thunderbird2.jpg" alt="" /><br /> <br /> Aquesta &eacute;s la configuraci&oacute; del SMTP. Aquesta configuraci&oacute; ens permetr&agrave; enviar correus cap a altres comptes de correu. Aquesta informaci&oacute; us la ha de proporcionar el vostre prove&iuml;dor de correu.<br /> <br /> Una peculiaritat de Thunderbird, &eacute;s que nom&eacute;s es pot especificar un servidor smtp, personalment no m&#39;agrada.<br /> <br /> Servername: aqu&iacute; escriurem l&#39;adre&ccedil;a del servidor de correus.<br /> Port: aqu&iacute; escriurem el port que usa el servidor de correu, per defecte el 25.<br /> Username: el nom d&#39;usuari sol ser o la part de la vostra adre&ccedil;a de correu anterior a la @, o l&#39;adre&ccedil;a sencera. Si no us funcion&eacute;s, doncs a demanar-la al prove&iuml;dor. :P<br /> Secure connection: Aqu&iacute; posarem si el nostre SMTP suporta algun tipus de xifratge. Les opcions principals solen ser: o usar una capa TLS, o no usar xifratge. El xifratge tamb&eacute; pot ser SSL, per&ograve; llavors aniria per un altre port, concretament el 465.<br /> <br />  <br /> <br /> Si volem configurar-nos un compte des de la qual ens volem descarregar el correu, haurem de fer clic a Add account, i llavors li direm que volem configurar un compte de correu.<br /> <br /> <img src="http://www.catux.org/imatges/articles/81/thunderbird3.jpg" alt="" /><br /> <br /> Ho omplirem amb el nom i la nostra adre&ccedil;a de correu..<br /> <br /> Despr&eacute;s triarem si usem POP o usem IMAP, i hi escriurem el nom del servidor que ens proveeix del servei:<br /> <br /> <img src="http://www.catux.org/imatges/articles/81/thunderbird4.jpg" alt="" /><br /> <br /> Fem clic a next i ens demanar&agrave; el nom de l&#39;usuari:<br /> <br /> <img src="http://www.catux.org/imatges/articles/81/thunderbird5.jpg" alt="" /><br /> <br /> Despr&eacute;s ens demanar&agrave; una descripci&oacute; per al compte de correu:<br /> <br /> <img src="http://www.catux.org/imatges/articles/81/thunderbird6.jpg" alt="" /><br /> <br /> Un cop fets tots aquests passos, ens demana confirmaci&oacute; de tots els par&agrave;metres que hem inserit.<br /> <br /> <img src="http://www.catux.org/imatges/articles/81/thunderbird7.jpg" alt="" /><br /> <br /> Un cop s&#39;ha acabat l&#39;assistent, haurem de configurar els par&agrave;metres avan&ccedil;ats, per fer-ho tornarem a anar a la pestanya de configuraci&oacute; (Tools -&gt; Account Settings...) i farem clic sobre server settings del compte que acabem de seleccionar.<br /> <br /> <img src="http://www.catux.org/imatges/articles/81/thunderbird8.jpg" alt="" /><br /> <br /> Aqu&iacute; &eacute;s on podrem triar si el nostre servidor imap o pop3 &eacute;s un servidor amb ssl, en cas de ser-ho activarem l&#39;opci&oacute; use secure connection (SSL). Quan ho fem, ens canviar&agrave; el port al port per defecte del tipus de servei.<br /> <br /> Tamb&eacute; podrem triar el tipus d&#39;autenticaci&oacute; a usar. Si ho suporta, millor activar tamb&eacute; l&#39;opci&oacute; Use secure authentication, ara... si usem SSL, no &eacute;s tant important com si no l&#39;usem.<br /> <br /> <br /> En principi ara ja sou capa&ccedil;os de configurar el vostre compte a qualsevol client de correu. :)</div>
    
            </p>

            <h3>
                Categories:
                
        Articles, Iniciació
    
            </h3>

            <hr />
            <h1>Comentaris</h1>
            <ul class="list-group">
                
        <li class="list-group-item">Sense comentaris</li>
    
            </ul>


            <a href="https://catux.org/post_list.html">
                <i class="fas fa-chevron-left"></i>
                Arxius
            </a>
        </div>

    </div>


    </div> <!-- /.container -->

    <footer class="bg-dark text-light py-4 mt-5 fixed-bottom">
        <div class="container">
            <div class="row">
                <div class="col-md-8">
                    <p class="mb-0">
                        <small><small>Tot el contingut de Catux està subjecte sota la nova versió de la llicència de
                        <a href="http://creativecommons.org/licenses/by/2.5/es/deed.ca" class="text-light">Creative Commons</a></small></small>
                    </p>
                </div>
                <div class="col-md-4 text-md-end">
                    <p class="mb-0">
                        <a href="https://github.com/catux" class="text-light me-3"><i class="fab fa-github"></i></a>
                        <a href="https://t.me/+UaRevB06YidmYTY0" class="text-light"><i class="fab fa-telegram"></i></a>
                    </p>
                </div>
            </div>
        </div>
    </footer>



</body>
</html>
