<!DOCTYPE html>
<html>
<head lang="cat">
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="description" content="Associació d'usuaris de GNU/Linux de la Catalunya Central">
    <meta name="keywords" content="gnu/linux, linux, programari lliure, gnu, lug, associacio, manresa, sant joan de vilatorrada, catalan, català, catalunya">
    <meta name="author" content="Catux">
    <link rel="icon" href="http://catux.org/images/favicon.ico">

    <title>Catux</title>

    <link rel="stylesheet" type="text/css" href="http://catux.org/css/main.css">
    <script src="http://catux.org/js/main.js"></script>
</head>
<body>
    <div class="navbar-wrapper">
        <div class="container">

            <nav class="navbar navbar-inverse">
                <div class="container">
                    <div class="navbar-header col-sm-5">
                        <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
                            <span class="sr-only">Toggle navigation</span>
                            <span class="icon-bar"></span>
                            <span class="icon-bar"></span>
                            <span class="icon-bar"></span>
                        </button>
                        <a href="http://catux.org/">
                            <img src="http://catux.org/images/catuxlogo.png" alt="Catux" width="40%"><br>
                            <div class="visible-lg"> Associació d'usuaris de GNU/Linux de la Catalunya Central</div>
                        </a>
                    </div>
                    <div id="navbar" class="navbar-collapse collapse navbar-links">
                        <ul class="nav navbar-nav navbar-right">
                            <li><a href="http://catux.org/post_list.html">Blog</a></li>
                            <li><a href="http://catux.org/traduccio.html">Traducció</a></li>
                            <li><a href="http://catux.org/contactar.html">Contactar</a></li>
                        </ul>
                    </div>
                </div>
            </nav>
        </div>
    </div> <!-- /.navbar-wrapper -->

    <div class="container">
        
    <div class="container-fluid">

        <div class="post">
            <a href="http://catux.org/post_list.html">
                <i class="fas fa-chevron-left"></i>
                Arxius
            </a>

            <h1>
                
        El català i el programari lliure
    
            </h1>

            <h3>
                Escrit al
                
        2005-11-28 00:00:00
    
                per
                
        Pinucset
    
            </h3>

            <p>
                
        <p><span class="noticia">Sabeu qu&egrave; passa quan alg&uacute; que no fa servir programari lliure veu un ordinador en catal&agrave;? Com actuen?! Per qu&egrave;? Aix&ograve; i m&eacute;s, en aquest article.</span>&nbsp;</p><br />    <div id="article" class="article_normal">Les &uacute;ltimes dues setmanes he vist com dos coneguts veien esglaiadament com quelcom en el seu sistema operatiu estava en catal&agrave;.<br /> <br /> El primer cas diagnosticat, una noia de la universitat del meu germ&agrave; es va quedar parada veient com el Windows deia d&#39;acord en comptes de &quot;Aceptar&quot; o inici enlloc de &quot;Inicio&quot;, i el m&eacute;s impactant &eacute;s que la noia en q&uuml;esti&oacute; estava parlant en catal&agrave;.<br /> <br /> El segon cas ha ocorregut quan un company meu estava fent un programa i hem diu:<br /> - NOOOI!!! En comptes de &quot;Cortar&quot; fotrem &quot;Retallar&quot;!!!<br /> Tot seguit ho ha ficat i resulta que veure com el ordinador parla amb el seu idioma li ha impactat.<br /> <br /> Si ens ho pensem fredament, &eacute;s normal que dos catalanoparlants s&#39;impressionin quan veuen que el seu ordinador els parla en el seu idioma?<br /> <br /> Perqu&egrave; les empreses de programari privatiu ens han fet creure que els catalans hem de llegir en castell&agrave; o angl&egrave;s? Potser perqu&egrave; traduir el programa al nostre idioma no els dona suficients ingressos i la nostra cultura no els importa gens?<br /> <br /> Potser ens haur&iacute;em de plantejar quin programari hem de fer servir, si la utilitzaci&oacute; de la nostra llengua ve regida pels diners que puguin entrar a la empresa a fi de mes no?<br /> <br /> Jo, fa temps, quan utilitzava Windows ho tenia tot en castell&agrave; i no em plantejava si era normal o no. Ara, que utilitzo Kubuntu ho tinc tot en catal&agrave;, i crec que &eacute;s completament normal. &Eacute;s que no s&oacute;c catal&agrave;?<br /> <br /> Si ens hi fixem, amb el programari lliure tots fem el que bonament podem, la majoria de vegades sense &agrave;nim de lucre, per tant tenim moltes aplicacions en catal&agrave; (Firefox, Thunderbird, KDE, Kopete, Kmail, Amarok...) perqu&egrave; unes persones han dedicat el seu temps lliure a donar vida a la nostra llengua.<br /> <br /> Potser seria convenient que canvi&eacute;ssim la nostra manera de pensar i vei&eacute;ssim que no nom&eacute;s ha de ser normal, si no que hauria de ser un dret tenir programari en catal&agrave;, i com en la majoria dels casos &eacute;s lliure, doncs millor!<br /> <br /> Doncs b&eacute;, vaig a menjar botifarra amb mongetes ;-D</div>
    
            </p>

            <h3>
                Categories:
                
        Articles, Iniciació
    
            </h3>

            <hr />
            <h1>Comentaris</h1>
            <ul class="list-group">
                
        <li class="list-group-item">Sense comentaris</li>
    
            </ul>


            <a href="http://catux.org/post_list.html">
                <i class="fas fa-chevron-left"></i>
                Arxius
            </a>
        </div>

    </div>


    </div> <!-- /.container -->

    <div class="container">
        <nav class="navbar navbar-inverse catux-footer">
            <p class="navbar-text">
                Tot el contingut de Catux està subjecte sota la nova versió de la llicència de
                <a href="http://creativecommons.org/licenses/by/2.5/es/deed.ca">Creative Commons</a>
            </p>
        </nav>
    </div>



</body>
</html>
