<!DOCTYPE html>
<html>
<head lang="cat">
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="description" content="Associació d'usuaris de GNU/Linux de la Catalunya Central">
    <meta name="keywords" content="gnu/linux, linux, programari lliure, gnu, lug, associacio, manresa, sant joan de vilatorrada, catalan, català, catalunya">
    <meta name="author" content="Catux">
    <link rel="icon" href="https://catux.github.io/images/favicon.ico">

    <title>Catux</title>

    <link rel="stylesheet" type="text/css" href="https://catux.github.io/css/main.css">
    <script src="https://catux.github.io/js/main.js"></script>
</head>
<body>
    <div class="navbar-wrapper">
        <div class="container">

            <nav class="navbar navbar-inverse">
                <div class="container">
                    <div class="navbar-header col-sm-5">
                        <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
                            <span class="sr-only">Toggle navigation</span>
                            <span class="icon-bar"></span>
                            <span class="icon-bar"></span>
                            <span class="icon-bar"></span>
                        </button>
                        <a href="https://catux.github.io/">
                            <img src="https://catux.github.io/images/catuxlogo.png" alt="Catux" width="40%"><br>
                            <div class="visible-lg"> Associació d'usuaris de GNU/Linux de la Catalunya Central</div>
                        </a>
                    </div>
                    <div id="navbar" class="navbar-collapse collapse navbar-links">
                        <ul class="nav navbar-nav navbar-right">
                            <li><a href="https://catux.github.io/post_list.html">Blog</a></li>
                            <li><a href="https://catux.github.io/traduccio.html">Traducció</a></li>
                        </ul>
                    </div>
                </div>
            </nav>
        </div>
    </div> <!-- /.navbar-wrapper -->

    <div class="container">
        
    <div class="container-fluid">

        <div class="post">
            <a href="https://catux.github.io/post_list.html">
                <i class="fas fa-chevron-left"></i>
                Arxius
            </a>

            <h1>
                
        Guia per utilitzar distribucions liveCD
    
            </h1>

            <h3>
                Escrit al
                
        2005-02-15 00:00:00
    
                per
                
        EliziR
    
            </h3>

            <p>
                
        <span class="noticia">Aquest nou article est&agrave; pensat per a aquelles persones que no han tingut gaireb&eacute; cap contacte amb el m&oacute;n de GNU/Linux.<br /> <br /> Jo crec que dues de les millors maneres per fer perdre la por a la gent, una &eacute;s la de que una persona que hi entengui expliqui directament a l&#39;altre davant d&#39;un ordinador com funciona, i l&#39;altre, la utilitzaci&oacute; de distribucions liveCD.<br /> <br /> Est&agrave; explicat detalladament, i esperant que sigui complert i entenedor.</span><br />    <div id="article" class="article_normal">Aquest article, pret&eacute;n ser una petita empenta per a aquelles persones que tenen ganes d&#39;iniciar-se en el m&oacute;n de GNU/Linux, o simplement fer-hi una ullada utilitzant alguna distribuci&oacute; de tipus &quot;liveCD&quot;, fent servir un llenguatge i unes explicacions el m&eacute;s entenedores possible. L&#39;article &eacute;s una mica extens, i s&#39;ha fet per intentar solucionar tots els petits problemes que hi solen haver, per&ograve; no &eacute;s dif&iacute;cil de comprendre.<br /> <br /> Per fer-ho, consta d&#39;uns quants conceptes b&agrave;sics d&#39;utilitzaci&oacute;, d&#39;una petita llista de requeriments, d&#39;alguns exemples, i d&#39;enlla&ccedil;os on poder trobar distribucions liveCD i m&eacute;s documentaci&oacute;.<br /> <br /> <br /> <br /> <br /> <h2>1.- Conceptes b&agrave;sics d&#39;utilitzaci&oacute;</h2><br /> Una distribuci&oacute; de tipus liveCD, es diferencia principalment pel fet que est&agrave; pensada perqu&egrave; es pugui executar i es pugui fer &uacute;s del <a href="http://ca.wikipedia.org/wiki/Sistema_operatiu" target="blank">sistema operatiu</a>, sense necessitat d&#39;instal&middot;lar res al <a href="http://ca.wikipedia.org/wiki/Disc_dur" target="blank">dic dur</a> de l&#39;<a href="http://ca.wikipedia.org/wiki/Ordinador" target="blank">ordinador</a> on s&#39;executa.<br /> <br /> Per tant, significa que utilitzant una distribuci&oacute; liveCD, es pot gaudir de les seves aplicacions gaireb&eacute; sense notar que no est&agrave; instal&middot;lada al sistema.<br /> <br /> El qu&egrave; fan aquestes distribucions, &eacute;s recon&egrave;ixer el <a href="http://ca.wikipedia.org/wiki/Maquinari" target="blank">maquinari</a> (el hardware, les peces f&iacute;siques de dins l&#39;ordinador) i despr&eacute;s engegar les aplicacions per a l&#39;usuari. Per fer aix&ograve;, com que no fa servir el disc dur per a desar les dades, utilitza la <a href="http://ca.wikipedia.org/wiki/RAM_%28Inform%C3%A0tica%29" target="blank">mem&ograve;ria RAM</a> per anar emmagatzemant els processos b&agrave;sics del sistema operatiu, i tamb&eacute; les dades necess&agrave;ries per a poder executar els <a href="http://ca.wikipedia.org/wiki/Programari" target="blank">programes</a> que es troben dins del <a href="http://ca.wikipedia.org/wiki/CD-ROM" target="blank">CD</a> (o <a href="http://ca.wikipedia.org/wiki/DVD" target="blank">DVD</a>)que l&#39;usuari vol utilitzar. Per aquest fet, quan tanquem l&#39;ordinador, no es desen els canvis fets als programes, ja que no es desen enlloc, cosa que no vol dir que es puguin modificar dades del disc dur, per&ograve; d&#39;aix&ograve; ja en parlarem m&eacute;s endavant.<br /> <br /> Per aquesta ra&oacute;, &eacute;s molt aconsellable utilitzar un ordinador que contingui gran quantitat de mem&ograve;ria RAM, ja que sin&oacute;, pot ser que la utilitzaci&oacute; de la distribuci&oacute; sigui molt lenta (o que fins hi tot no acabi d&#39;arrencar), ja que si un ordinador t&eacute; poca mem&ograve;ria RAM, per executar processos nous haur&agrave; d&#39;anar traient els processos menys utilitzats, fent que els passos a fer siguin m&eacute;s i durin m&eacute;s temps a poder finalitzar.<br /> <br /> Tot i aix&ograve;, la gran majoria d&#39;aquest tipus de distribucions, ofereixen tot un seguit d&#39;opcions abans d&#39;arrencar (per defecte, ja hi ha una configuraci&oacute; que sense tocar res, que acostuma a funcionar amb la majoria d&#39;ordinadors), que permeten a l&#39;usuari escollir diferents tipus d&#39;utilitzaci&oacute; segons el maquinari i/o les necessitats d&#39;aquest. Algunes coses que habitualment es poden triar, s&oacute;n coses com l&#39;idioma, la resoluci&oacute; de la pantalla, si es vol utilitzar i quin tipus d&#39;<a href="http://ca.wikipedia.org/wiki/XWindow" target="blank">entorn d&#39;escriptori</a> prefereix (<a href="http://xfce.org/" target="blank">Xfce</a>, <a href="http://kde.org/" target="blank">KDE</a>, <a href="http://gnome.org/" target="blank">Gnome</a>, ...), etc... Per exemple, amb un ordinador que t&eacute; molta mem&ograve;ria RAM, pot utilitzar l&#39;entorn de finestres del KDE, que &eacute;s un que ocupa molts recursos (per tant, molta RAM). En canvi, un ordinador amb poca RAM, &eacute;s m&eacute;s aconsellable que utilitzi un entorn d&#39;escriptori menys &quot;pesat&quot;, com ara l&#39;Xfce.<br /> <br /> En qualsevol cas, &eacute;s recomanable tenir com a m&iacute;nim 128MB de mem&ograve;ria RAM, per&ograve; per a una &ograve;ptima utilitzaci&oacute;, es recomanen unes 256MB o m&eacute;s. Aix&ograve; no vol dir que amb menys de 128MB no es pugui fer servir, l&#39;&uacute;nic que pot passar &eacute;s que vagi bastant lent, o que si es trien unes opcions al arrencar que requereixen grans quantitats de mem&ograve;ria, pot ser que no funcioni.<br /> <br /> La metodologia general que es segueix, &eacute;s ben senzilla: es fica el CD al lector, s&#39;arrenca l&#39;ordinador, i al cap de poc, autom&agrave;ticament ja podem utilitzar la distribuci&oacute;. Per&ograve; per fer aix&ograve;, ens hem d&#39;assegurar d&#39;algunes coses, que s&#39;expliquen en l&#39;apartat de &quot;Llistat de requeriments&quot;. Per&ograve; normalment, &eacute;s aix&iacute; de f&agrave;cil.<br /> <br /> Fins hi tot, hi han distribucions liveCD que tamb&eacute; es poden instal&middot;lar al disc dur, per&ograve; d&#39;aix&ograve; no en parlarem en aquest article.<br /> <br /> <br /> <br /> <br /> <br /> <h2>2.- Llistat de requeriments</h2><br /> Per a poder fer funcionar una distribuci&oacute; liveCD, s&#39;han de verificar algunes coses, per&ograve; no &eacute;s complicat de fer.<br /> <br /> Principalment es necessitar&agrave;:<br /> <br /> 2.1.- <strong>Una distribuci&oacute; en CD del tipus liveCD</strong>, que estigui pensada per a l&#39;arquitectura del nostre ordinador. Aix&ograve; &eacute;s molt senzill: Habitualment, els ordinadors s&oacute;n del tipus <a href="http://ca.wikipedia.org/wiki/X86" target="blank">x86</a>, per&ograve; cal tenir present que hi han altres arquitectures com poden ser <a href="http://en.wikipedia.org/wiki/Sparc" target="blank">Sparc</a> o <a href="http://ca.wikipedia.org/wiki/PowerPC" target="blank">PowerPC</a>. Aix&ograve; s&#39;ha de tenir en compte a l&#39;hora d&#39;anar a buscar el CD, ja que si s&#39;escull una arquitectura diferent, gaireb&eacute; segur que no funcionar&agrave;.<br /> <br /> x86 inclou ordinadors des dels &quot;antics&quot; 286 fins als &quot;actuals&quot; 686 (286, 386, 486, AMD 5x86, Cyrix 5x86, Intel Pentium, ... ,586, 686). I s&#39;ha de diferenciar entre aquests (de <a href="http://ca.wikipedia.org/wiki/IA-32" target="blank">32 bits</a>), i els nous processadors de <a href="http://en.wikipedia.org/wiki/IA-64" target="blank">64bits</a>, com pot ser un <a href="http://en.wikipedia.org/wiki/AMD64" target="blank">AMD64</a>.<br /> <br /> En poques paraules, si no s&#39;indica el contrari, segurament tindreu un ordinador amb una arquitectura de x86, i si &eacute;s molt nou, mirar si es tracta d&#39;un ordinador amb processador de 64bits, i en funci&oacute; d&#39;aix&ograve;, demanar, descarregar-se o comprar la distribuci&oacute; adient.<br /> <br /> Una cosa que tamb&eacute; es recomanable, &eacute;s que si es t&eacute; un ordinador molt nou, es disposi d&#39;una distribuci&oacute; el m&eacute;s nova possible, ja que si amb una d&#39;antiga, potser hi hauran problemes en detectar el maquinari de l&#39;ordinador i no funciona tot.<br /> <br /> <br /> 2.2.- <strong>Un lector de CD o DVD</strong> que estigui instal&middot;lat i funcioni correctament a l&#39;ordinador. Naturalment, &eacute;s essencial per a la pr&agrave;ctica habitual de les distribucions liveCD.<br /> <br /> Si es tenen dos unitats lectores (ja siguin lectores o gravadores), s&#39;acostuma a ficar el CD a la unitat lectora normal. Aix&iacute; que si veieu que no funciona, pot ser per aquest motiu, i nom&eacute;s ho haureu de provar amb l&#39;altra unitat de CD o DVD.<br /> <br /> <br /> 2.3.- <strong>Ordinador que disposi d&#39;una placa mare amb una <a href="http://en.wikipedia.org/wiki/Bios" target="blank">BIOS</a> que es pugui triar com a primera opci&oacute;, arrencar des de CD-ROM</strong> (&eacute;s possible que ja estigui ficat, per&ograve; s&#39;ha de comprovar). No us espanteu, no &eacute;s tant complicat, i de vegades ja est&agrave; ficat correctament, per&ograve; s&#39;ha de comprovar.<br /> <br /> Aproximadament, a partir dels ordinadors 486 (principis del anys 90), les plaques mare disposen d&#39;aquesta opci&oacute;. Per accedir-hi, just quan s&#39;arrenca l&#39;ordinador, s&#39;ha d&#39;anar prement la tecla de suprimir &quot;Supr&quot; fins que surti un men&uacute; (no acostuma ha haver-hi contrasenya). De vegades no &eacute;s la tecla &quot;Supr&quot;, sin&oacute; que &eacute;s prement la tecla &quot;F1&quot; o utilitzant una altre combinaci&oacute; de tecles. Quan arrenca l&#39;ordinador, ja ho diu quines s&oacute;n les tecles, acostuma a sortir un missatge com ara &quot;Press DEL to Enter SETUP&quot;:<br /> <br /> <a href="http://www.catux.org/imatges/articles/intro_livecd/arranc.jpg"><img src="http://www.catux.org/imatges/articles/intro_livecd/arranc.jpg" alt="" width="200" /></a><br /> <br /> Hi han alguns tipus diferents de BIOS. Per&ograve; la majoria s&oacute;n semblants a aquesta:<br /> <br /> <a href="http://www.catux.org/imatges/articles/intro_livecd/menu_bios.jpg"><img src="http://www.catux.org/imatges/articles/intro_livecd/menu_bios.jpg" alt="" width="200" /></a><br /> <br /> El qu&egrave; hem de fer ara, &eacute;s anar a l&#39;apartat on hem de definir la seq&uuml;&egrave;ncia que ha de seguir l&#39;ordinador en l&#39;arrencada, &eacute;s a dir, hem de ficar primer la opci&oacute; d&#39;arrencar amb CD-ROM i despr&eacute;s la del disc dur, ja que si ho f&eacute;ssim al rev&eacute;s, no podr&iacute;em arrencar la distribuci&oacute; liveCD, i l&#39;ordinador arrancaria normalment.<br /> <br /> Les tecles a fer servir en la gran majoria dels men&uacute;s de la BIOS, s&oacute;n les fletxes normals (per tirar amunt, avall, dreta i esquerra), l&#39;enter (per entrar en un apartat del men&uacute; i tamb&eacute; per a canviar alguna opci&oacute;), i la tecla &quot;ESC&quot; (per a sortir dels men&uacute;s).<br /> <br /> En la majoria de men&uacute;s de la BIOS, el qu&egrave; hem de canviar est&agrave; dins de &quot;ADVENCED BIOS FEATURES&quot;, tot i que tamb&eacute; pot tenir el nom de &quot;BIOS FEATURES SETUP&quot; o algun de semblant. El qu&egrave; hem de buscar &eacute;s una cosa com:<br /> <br /> <a href="http://www.catux.org/imatges/articles/intro_livecd/advanced0.jpg"><img src="http://www.catux.org/imatges/articles/intro_livecd/advanced0.jpg" alt="" width="200" /></a><br /> <br /> O una altre com aquesta (per ordinadors m&eacute;s vells):<br /> <br /> <a href="http://www.catux.org/imatges/articles/intro_livecd/advanced2.png"><img src="http://www.catux.org/imatges/articles/intro_livecd/advanced2.png" alt="" width="200" /></a><br /> <br /> En el primer cas, hem de ficar:<br /> <br /> <strong>First Boot Device:</strong>	CDROM<br /> <strong>Second Boot Device:</strong>	Hard Disk<br /> <strong>Third Boot Device:</strong>	Floppy<br /> <br /> (el tercer (&quot;Third Boot Device&quot;) no importa gaire).<br /> <br /> I si el cas &eacute;s com el de la segona imatge:<br /> <br /> <strong>BOOT SEQUENCE:</strong>	D,C,SCSI<br /> <br /> Depenent on es tingui el lector, s&#39;haur&agrave; de ficar aix&ograve; o una altre cosa. Per&ograve; el qu&egrave; si que ha de passar &eacute;s que la unitat del lector de CD estigui per davant de la unitat del disc dur, que sol ser la unitat C.<br /> <br /> Ficant aix&ograve;, estem dient que quan arranqui l&#39;ordinador, primer miri a la unitat de CD a veure si hi ha algun CD que sigui &quot;bootable&quot;, que significa senzillament que es pot arrencar. Si a la unitat hi troba un CD bootable (&quot;arrencable&quot;), l&#39;executar&agrave;, i si no hi troba res per arrencar, far&agrave; com sempre, &eacute;s a dir, que s&#39;engegar&agrave; amb normalitat. Per aix&ograve;, despr&eacute;s de fer servir la distribuci&oacute; liveCD, no cal tornar a la BIOS a canviar aix&ograve;, es poden deixar aquests canvis que no passar&agrave; res.<br /> <br /> Quan haguem canviat aix&ograve;, haurem de gravar els canvis i sortir. Per fer-ho, normalment n&#39;hi haur&agrave; prou amb pr&eacute;mer la tecla &quot;ESC&quot;, anar a l&#39;apartat &quot;Save &amp; Exit Setup&quot;, i confirmar que volem desar els canvis. &Eacute;s possible que tingui un altre nom, per&ograve; &eacute;s f&agrave;cil de trobar i tindr&agrave; un nom semblant.<br /> <br /> <br /> 2.4.- <strong>Un m&iacute;nim de mem&ograve;ria RAM</strong>. Ja hem comentat abans que per anar b&eacute;, com a m&iacute;nim es necessiten 128MB de RAM. Amb menys pot ser que no funcioni correctament o que vagi molt lentament.<br /> <br /> Per comprovar la mem&ograve;ria RAM que es t&eacute;, hi han moltes maneres. Una, &eacute;s mirant l&#39;arranc:<br /> <br /> <a href="http://www.catux.org/imatges/articles/intro_livecd/ram.jpg"><img src="http://www.catux.org/imatges/articles/intro_livecd/ram.jpg" alt="" width="200" /></a><br /> <br /> Per exemple, aquest ordinador t&eacute; aproximadament 512MB de RAM (es veu on fica Memory Testing).<br /> <br /> <br /> 2.5- Altres elements que s&oacute;n essencials per a un ordinador dom&egrave;stic, com ara el <a href="http://ca.wikipedia.org/wiki/Teclat" target="blank">teclat</a>.<br /> <br /> <br /> <br /> <br /> <h2>3.- Exemples</h2><br /> L&#39;exemple que es far&agrave; ser&agrave; utilitzant una Knoppix 3.7 versi&oacute; catalana. Tot i aix&iacute;, servir&agrave; per a la gran majoria de distribucions liveCD que hi ha fins al moment. I es far&agrave; en un AMD2800 (686) amb 1000MB de RAM i una pantalla CRT de 19&quot;, per&ograve; tamb&eacute; es far&agrave; algun exemple que serviria per a ordinadors menys potents (les fotografies no s&oacute;n de gaire qualitat).<br /> <br /> Quan ja haguem complert els requisits de l&#39;apartat anterior, ja podrem comen&ccedil;ar a utilitzar la nostra distribuci&oacute;, i per fer-ho, ficarem el CD en la unitat de lector de CD o DVD, i tornarem a iniciar l&#39;ordinador.<br /> <br /> Si tot ha anat b&eacute;, quan s&#39;arrenqui, en comptes d&#39;engegar-se com ho fa normalment, ens apareixer&agrave; el seg&uuml;ent:<br /> <br /> <a href="http://www.catux.org/imatges/articles/intro_livecd/dsc01153.jpg"><img src="http://www.catux.org/imatges/articles/intro_livecd/dsc01153_p.jpg" alt="" /></a> <a href="http://www.catux.org/imatges/articles/intro_livecd/dsc01154.jpg"><img src="http://www.catux.org/imatges/articles/intro_livecd/dsc01154_p.jpg" alt="" /></a><br /> <br /> Aix&ograve; significa que l&#39;ordinador ha trobat la distribuci&oacute;, i ara ens demana si volem arrencar una configuraci&oacute; per defecte o volem ficar opcions. Normalment, si al cap d&#39;uns segons no es prem cap tecla, arranca una configuraci&oacute; per defecte. Si volem una configuraci&oacute; per defecte, n&#39;hi ha prou amb pr&eacute;mer l&#39;enter i es veur&agrave; com l&#39;ordinador va detectant el maquinari, i despr&eacute;s arrenca el mode gr&agrave;fic:<br /> <br /> <a href="http://www.catux.org/imatges/articles/intro_livecd/dsc01160.jpg"><img src="http://www.catux.org/imatges/articles/intro_livecd/dsc01160_p.jpg" alt="" /></a> <a href="http://www.catux.org/imatges/articles/intro_livecd/dsc01162.jpg"><img src="http://www.catux.org/imatges/articles/intro_livecd/dsc01162_p.jpg" alt="" /></a><br /> <br /> Un cop arrencat el sistema, el podrem utilitzar normalment. Per&ograve; si ja fa bastants minuts que aparenta que l&#39;ordinador no fa res, segurament passa que, o hi ha poca mem&ograve;ria RAM, hi han opcions que s&#39;han de canviar, o que el CD cont&eacute; errors (com ara que est&agrave; mal gravat, que est&agrave; ratllat, etc...). La majoria de vegades &eacute;s perqu&egrave; cal canviar alguna opci&oacute;. Si no ens funciona la configuraci&oacute; per defecte, haurem de tornar a iniciar l&#39;ordinador.<br /> <br /> En el cas que calgui canviar opcions o simplement es volen provar coses, arrenquem l&#39;ordinador i ens esperem fins a estar en el punt en qu&egrave; s&#39;acaba de detectar la distribuci&oacute;. En aquell moment, hi sol haver una petita ajuda prement les tecles &quot;F1&quot;, &quot;F2&quot;, etc... A aqu&iacute;, ens dir&agrave; quines opcions hi han, per a qu&egrave; serveixen i algun exemple:<br /> <br /> <a href="http://www.catux.org/imatges/articles/intro_livecd/dsc01155.jpg"><img src="http://www.catux.org/imatges/articles/intro_livecd/dsc01155_p.jpg" alt="" /></a> <a href="http://www.catux.org/imatges/articles/intro_livecd/dsc01156.jpg"><img src="http://www.catux.org/imatges/articles/intro_livecd/dsc01156_p.jpg" alt="" /></a><br /> <br /> La metodologia que es segueix al triar les opcions &eacute;s: <strong>boot: nucli opci&oacute;1 opci&oacute;2 opci&oacute;3 ...</strong><br /> <br /> Primer de tot, li hem d&#39;indicar quin &eacute;s el <a href="http://kernel.org/" target="blank">nucli</a> del sistema que volem arrencar, un de la branca 2.4 o un de la branca 2.6. La difer&egrave;ncia entre ells &eacute;s que el nucli de la branca 2.6 &eacute;s m&eacute;s actual, i per tant, si tenim un maquinari bastant recent, &eacute;s millor aix&ograve; que agafar el del nucli de la branca 2.4, ja que aquest, quan es va fer, encara havia de sortir al mercat gran quantitat del maquinari que tenim recentment (per exemple, en l&#39;ordinador que ara s&#39;estan fent les proves, arrencant amb el de la branca 2.4 no detecta la tarja de so ni la tarja de xarxa).<br /> <br /> Per&ograve; si es t&eacute; un ordinador no tant recent, &eacute;s bastant indiferent en quin arrancar ja que tant un com l&#39;altre segurament ho faran b&eacute;.<br /> <br /> El nucli de la branca 2.4 s&#39;anomena &quot;knoppix&quot;, i el de la 2.6 &quot;knoppix26&quot;.<br /> <br /> Despr&eacute;s d&#39;escollir amb quin nucli s&#39;arrenca (ara escollirem el knoppix26), podem escollir algunes opcions, les quals seran tenir un framebuffer de 1280x1024 (la resoluci&oacute; de la pantalla en mode de consola de text), amb <a href="http://ca.wikipedia.org/wiki/Basc" target="blank">llengua Euskera</a>, amb l&#39;entorn d&#39;escriptori Xfce i una resoluci&oacute; de pantalla de 1280x1024. La comanda sencera seria:<br /> <br /> <a href="http://www.catux.org/imatges/articles/intro_livecd/dsc01169.jpg"><img src="http://www.catux.org/imatges/articles/intro_livecd/dsc01169_p.jpg" alt="" /></a><br /> <br /> I al pr&eacute;mer la tecla de l&#39;enter, ens acabar&agrave; obrint:<br /> <br /> <a href="http://www.catux.org/imatges/articles/intro_livecd/dsc01171.jpg"><img src="http://www.catux.org/imatges/articles/intro_livecd/dsc01171_p.jpg" alt="" /></a><br /> <br /> Per a un ordinador amb menys recursos i amb una pantalla m&eacute;s petita, podr&iacute;em haver escollit unes opcions que necessitin menys recursos, com podria ser que tingu&eacute;s un framebuffer de 800x600, una resoluci&oacute; de pantalla de 800x600 i utilitzar un entorn d&#39;escriptori com el <a href="http://windowmaker.org/" target="blank">WindowMaker</a>:<br /> <br /> <a href="http://www.catux.org/imatges/articles/intro_livecd/dsc01172.jpg"><img src="http://www.catux.org/imatges/articles/intro_livecd/dsc01172_p.jpg" alt="" /></a> <a href="http://www.catux.org/imatges/articles/intro_livecd/dsc01174.jpg"><img src="http://www.catux.org/imatges/articles/intro_livecd/dsc01174_p.jpg" alt="" /></a><br /> <br /> Com podem comprovar, hi ha gran varietat d&#39;opcions a escollir segons les nostres necessitats i/o recursos de maquinari. Fins hi tot, podem escollir que no ens arranqui el mode gr&agrave;fic i tenir nom&eacute;s una consola, estalviant aix&iacute; molts recursos:<br /> <br /> <br /> <a href="http://www.catux.org/imatges/articles/intro_livecd/dsc01175.jpg"><img src="http://www.catux.org/imatges/articles/intro_livecd/dsc01175_p.jpg" alt="" /></a> <a href="http://www.catux.org/imatges/articles/intro_livecd/dsc01177.jpg"><img src="http://www.catux.org/imatges/articles/intro_livecd/dsc01177_p.jpg" alt="" /></a><br /> <br /> Si seguint aproximadament aquestes opcions no has aconseguit arrencar la teva distribuci&oacute; liveCD, o tens problemes amb la detecci&oacute; del teu maquinari, jo t&#39;animo a que segueixis provant, ja que si tens un CD ben gravat, no est&agrave; ratllat, i tens un maquinari bastant com&uacute; (hauria de ser un maquinari molt especific o molt recent perqu&egrave; no ho detect&eacute;s), gaireb&eacute; segur que es podr&agrave; fer funcionar triant les opcions correctes.<br /> <br /> Despr&eacute;s que hagi pogut arrencar, podem anar utilitzant els programes de la distribuci&oacute;, com ara tenir obert el processador de text de l&#39;<a href="http://www.softcatala.org/projectes/openoffice" target="blank">OpenOffice</a> i escoltar m&uacute;sica amb el <a href="http://xmms.org/" target="blank">Xmms</a>:<br /> <br /> <a href="http://www.catux.org/imatges/articles/intro_livecd/dsc01179.jpg"><img src="http://www.catux.org/imatges/articles/intro_livecd/dsc01179_p.jpg" alt="" /></a><br /> <br /> I tot aix&ograve;, sense haver d&#39;instal&middot;lar res al disc dur i en molt poc temps. Per&ograve; aix&ograve; si, hem de tenir una mica de cura amb el qu&egrave; es fa, ja que per exemple, si que podem explorar i modificar dades que hi han al nostre disc dur. La distribuci&oacute; liveCD, quan fa la detecci&oacute; de maquinari al arrencar, tamb&eacute; fa una exploraci&oacute; del disc dur, i com fa la Knoppix i d&#39;altres distribucions semblants, fiquen a l&#39;escriptori unes icones amb un text a l&#39;interior semblant a &quot;hda2&quot; (referint-se a la segons partici&oacute; del primer disc dur). Si es fa clic, es pot explorar en el seu interior, i segons el <a href="http://en.wikipedia.org/wiki/File_system" target="blank">sistema de fitxers</a> que tingui (<a href="http://en.wikipedia.org/wiki/File_Allocation_Table" target="blank">VFAT</a>, <a href="http://en.wikipedia.org/wiki/NTFS" target="blank">NTFS</a>, <a href="http://en.wikipedia.org/wiki/Xfs" target="blank">XFS</a>, etc...), es poden modificar o no. Per exemple, si tenim una partici&oacute; amb el sistema de fitxers VFAT, les seves dades es podran modificar, esborrar, etc... En canvi, una amb NTFS, nom&eacute;s es podran llegir per&ograve; no modificar.<br /> <br /> Per tant, s&#39;ha d&#39;anar en compte amb el que es fa en aquests llocs, ja que modificant alguna cosa que no s&#39;ha de tocar, pot fer que el sistema operatiu que hi ha instal&middot;lat al nostre ordinador no arrenqui. Amb aix&ograve; no us vull espantar, per&ograve; si que us vull deixar clar que utilitzant d&#39;una manera normal una distribuci&oacute; liveCD, no hi han gaireb&eacute; riscs (si pass&eacute;s alguna cosa seria per culpa de l&#39;usuari, no de la distribuci&oacute; del CD). Per tant, sense por per&ograve; anant una mica alerta amb aquests llocs.<br /> <br /> Aix&ograve;, t&eacute; avantatges i inconvenients. Els desavantatges ja els hem comentat, per&ograve; un dels possibles avantatges &eacute;s el de recuperar informaci&oacute; quan el sistema operatiu del nostre ordinador s&#39;ha &quot;espatllat&quot;, i volem recuperar les dades que hi havien, ja sigui per moure-les a una altre <a href="http://en.wikipedia.org/wiki/Partition_%28computing%29" target="blank">partici&oacute;</a>, un altre disc dur, un <a href="http://en.wikipedia.org/wiki/Keydrive" target="blank">dispositiu de mem&ograve;ria USB</a>, o fins hi tot fer un CD o DVD amb el programa per cremar CD i DVD (gravar) que solen portar les distribucions de GNU/Linux, que &eacute;s el fant&agrave;stic <a href="http://k3b.org/" target="blank">K3b</a>.<br /> <br /> Per exemple, en la seg&uuml;ent imatge es veuen tres particions que tinc al meu disc dur (tres distribucions diferents de GNU/Linux):<br />  <br /> <a href="http://www.catux.org/imatges/articles/intro_livecd/dsc01180.jpg"><img src="http://www.catux.org/imatges/articles/intro_livecd/dsc01180_p.jpg" alt="" /></a><br /> <br /> A les carpetes que hi ha una esp&egrave;cie de cadenat, significa que un usuari normal no t&eacute; permisos, per&ograve; si ens f&oacute;ssim administrador (nom&eacute;s cal obrir una consola i executar la comanda &quot;su&quot;), si que hi podr&iacute;em entrar i modificar.<br /> <br /> Un dels problemes que hi sol haver, &eacute;s la connexi&oacute; a <a href="http://ca.wikipedia.org/wiki/Internet" target="blank">Internet</a> (que no s&#39;acostuma gaire a fer servir amb les distribucions liveCD), encara que no sol ser un gran problema (si que ho sol ser si es disposa d&#39;un <a href="http://en.wikipedia.org/wiki/Modem" target="blank">m&ograve;dem</a> intern o d&#39;un <a href="http://en.wikipedia.org/wiki/Router" target="blank">encaminador</a> USB). Si no us interessa aix&ograve;, us podeu saltar aquestes l&iacute;nies fins a l&#39;apartat de &quot;Conclusions&quot;.<br /> <br /> Per exemple, si disposem d&#39;un encaminador <a href="http://en.wikipedia.org/wiki/ADSL" target="blank">ADSL</a> en qu&egrave; es comunica amb l&#39;ordinador amb un cabla de xarxa, i aquest t&eacute; el servei de <a href="http://en.wikipedia.org/wiki/DHCP" target="blank">DHCP</a> activat, segurament ja es tindr&agrave; Internet sense haver de fer res. Si hi ha activat el servei de DHCP per&ograve; no es disposa d&#39;Internet, en principi n&#39;hi haur&agrave; prou amb obrir una consola (la sisena icona que apareix a la barra de la fotografia o buscant-la per men&uacute;), executar la comanda &quot;su&quot;, i despr&eacute;s executar &quot;dhclient&quot;.<br /> <br /> En canvi, si es t&eacute; un encaminador ADSL en &quot;multipuesto&quot; sense tenir DHCP o tenir-lo desactivat (com ara jo), n&#39;hi ha prou amb seguir les seg&uuml;ents instruccions que hi han a la imatge:<br /> <br /> <a href="http://www.catux.org/imatges/articles/intro_livecd/dsc01167.jpg"><img src="http://www.catux.org/imatges/articles/intro_livecd/dsc01167_p.jpg" alt="" /></a><br /> <br /> La comanda &quot;ping&quot;, significa m&eacute;s o menys que es t&eacute; acc&eacute;s a aquella p&agrave;gina web. La imatge mostra que el primer cop no es t&eacute; acc&eacute;s, per&ograve; despr&eacute;s de fer les modificacions si.<br /> <br /> La de &quot;su&quot; &eacute;s per fer-se administrador, ja que un usuari normal no pot modificar segons quines coses.<br /> <br /> En la comanda &quot;ifconfig eth0 192.168.1.200&quot;, s&#39;est&agrave; dient quina &eacute;s la <a href="http://en.wikipedia.org/wiki/Internet_Protocol" target="blank">IP</a> del nostre ordinador i a quina targeta de xarxa (solen ser eth0 o eth1).<br /> <br /> La de &quot;route add default gw 192.168.1.1&quot; &eacute;s per dir-li quina IP t&eacute; l&#39;encaminador.<br /> <br /> Totes aquestes dades (sobretot les IP), depenen de la vostra configuraci&oacute;, per&ograve; aquestes s&oacute;n de les m&eacute;s normals. Per saber quines es tenen, nom&eacute;s cal mirar-les al vostre sistema operatiu i apuntar-les, per despr&eacute;s ficar-les aqu&iacute;.<br /> <br /> La connexi&oacute; a Internet, sol ser un dels grans problemes per als usuaris &quot;novells&quot;, per&ograve; amb insistir una mica n&#39;hi sol haver prou.<br /> <br /> <br /> <br /> <br /> <h2>4.- Conclusions</h2><br /> Arribats a aquest punt, si les proves han seguit el seu curs normal, haureu pogut veure una mica com funciona una distribuci&oacute; liveCD. Jo crec que segurament us haur&agrave; pogut sorprendre com en un sol CD, hi pot haver un sistema operatiu amb tants programes i que es pugui executar gaireb&eacute; com si estigu&eacute;s instal&middot;lat al disc dur. Per&ograve; ja us dic ara que en el m&oacute;n de GNU/Linux, hi han molt&iacute;ssimes altres coses sorprenents, i segurament millors de les que esteu acostumats. GNU/Linux est&agrave; cada dia m&eacute;s present a la nostra societat, cosa que comporta que hi hagi m&eacute;s gent que l&#39;utilitza i per tant, hi ha m&eacute;s gent que hi col&middot;labora (com ara nosaltres, ja sigui amb documentaci&oacute;, suport a les persones, o amb programari). Espero que vosaltres sigueu uns futurs usuaris d&#39;aquest sistema operatiu, i si no &eacute;s de GNU/Linux, almenys que sigui d&#39;algun altre que no sigui amb programari propietari :)<br /> <br /> En canvi, si teniu problemes, heu anat provant diferents opcions i no us funciona, podeu ficar comentaris en aquest article i segurament jo, o alguns companys de l&#39;associaci&oacute; com altre gent, us intentarem ajudar. Tamb&eacute; us podeu dirigir a la llista de distribuci&oacute; anomenada &quot;<a href="http://catux.org/cgi-bin/mailman/listinfo/llista" target="blank">Llista</a>&quot; que es disposa en aquest lloc, ja sigui per aquest tema o per algun altre.<br /> <br /> Espero que la vostra experi&egrave;ncia hagi sigut satisfact&ograve;ria, i que si us ha agradat, us animo a que proveu alguna distribuci&oacute; per instalar-la al disc dur, que &eacute;s una cosa que pot espantar per&ograve; que no &eacute;s complicada. Em sembla que gaireb&eacute; no conec ning&uacute; que despr&eacute;s de tenir una distribuci&oacute; instal&middot;lada al disc dur, l&#39;hagi tret. Aix&ograve; significa clarament una cosa, que quan es prova, un se n&#39;adona de la de temps que ha perdut amb algun altre sistema operatiu i deixa de fer-lo servir (tot i que tamb&eacute; es poden tenir diferents sistemes operatius instal&middot;lats al disc duc alhora), cosa que fa que cada dia hi hagi centenars (o milers) de persones que s&#39;inicien en aquesta gran comunitat que &eacute;s la de GNU/Linux :)<br /> <br /> (Agrairia que si alg&uacute; no ent&eacute;n alguna cosa o troba a faltar quelcom, ho comenti)<br /> <br /> <br /> <br /> <br /> <h2>5.- Enlla&ccedil;os</h2><br /> Distribucions m&eacute;s populars:<br /> - Knoppix: <a href="http://www.knoppix.org/" target="blank">P&agrave;gina oficial</a>, <a href="ftp://ftp.caliu.info/pub/distribucions/knoppix-ca" target="blank"> desc&agrave;rrgues de versions en catal&agrave;</a><br /> - Ubuntu (hi ha la versi&oacute; per instal&middot;lar i la liveCD): <a href="http://www.ubuntulinux.org/" target="blank">P&agrave;gina oficial</a>, <a href="http://www.ubuntulinux.org/download" target="blank">desc&agrave;rregues</a><br /> <br /> <br /> Llistats de distribucions liveCD:<br /> <a href="http://distrowatch.com/dwres.php?resource=cd" target="blank">http://distrowatch.com/dwres.php?resource=cd</a><br /> <a href="http://www.frozentech.com/content/livecd.php" target="blank">http://www.frozentech.com/content/livecd.php</a><br /> <a href="http://en.wikipedia.org/wiki/List_of_LiveCDs" target="blank">http://en.wikipedia.org/wiki/List_of_LiveCDs</a><br /> </div>
    
            </p>

            <h3>
                Categories:
                
        Articles, Iniciació
    
            </h3>

            <hr />
            <h1>Comentaris</h1>
            <ul class="list-group">
                
        <li class="list-group-item comment">Re: Guia per utilitzar distrib Un article molt interessant, que servira per a guiar sobre quines son les distribucions live que existeixin i com fer que funcionin sense crear un trauma als usuaris menys avançats.

Et felicito!!<p class="comment-author">Escrit al 2006-12-29 00:14:12 per pachu</p></li>
    
            </ul>


            <a href="https://catux.github.io/post_list.html">
                <i class="fas fa-chevron-left"></i>
                Arxius
            </a>
        </div>

    </div>


    </div> <!-- /.container -->

    <div class="container">
        <nav class="navbar navbar-inverse catux-footer">
            <p class="navbar-text">
                Tot el contingut de Catux està subjecte sota la nova versió de la llicència de
                <a href="http://creativecommons.org/licenses/by/2.5/es/deed.ca">Creative Commons</a>
            </p>
        </nav>
    </div>



</body>
</html>
