<!DOCTYPE html>
<html>
<head lang="cat">
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="description" content="Associació d'usuaris de GNU/Linux de la Catalunya Central">
    <meta name="keywords" content="gnu/linux, linux, programari lliure, gnu, lug, associacio, manresa, sant joan de vilatorrada, catalan, català, catalunya">
    <meta name="author" content="Catux">
    <link rel="icon" href="http://catux.org/images/favicon.ico">

    <title>Catux</title>

    <link rel="stylesheet" type="text/css" href="http://catux.org/css/main.css">
    <script src="http://catux.org/js/main.js"></script>
</head>
<body>
    <div class="navbar-wrapper">
        <div class="container">

            <nav class="navbar navbar-inverse">
                <div class="container">
                    <div class="navbar-header col-sm-5">
                        <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
                            <span class="sr-only">Toggle navigation</span>
                            <span class="icon-bar"></span>
                            <span class="icon-bar"></span>
                            <span class="icon-bar"></span>
                        </button>
                        <a href="http://catux.org/">
                            <img src="http://catux.org/images/catuxlogo.png" alt="Catux" width="40%"><br>
                            <div class="visible-lg"> Associació d'usuaris de GNU/Linux de la Catalunya Central</div>
                        </a>
                    </div>
                    <div id="navbar" class="navbar-collapse collapse navbar-links">
                        <ul class="nav navbar-nav navbar-right">
                            <li><a href="http://catux.org/post_list.html">Blog</a></li>
                            <li><a href="http://catux.org/traduccio.html">Traducció</a></li>
                        </ul>
                    </div>
                </div>
            </nav>
        </div>
    </div> <!-- /.navbar-wrapper -->

    <div class="container">
        
    <div class="container-fluid">

        <div class="post">
            <a href="http://catux.org/post_list.html">
                <i class="fas fa-chevron-left"></i>
                Arxius
            </a>

            <h1>
                
        I jo, que puc ajudar?
    
            </h1>

            <h3>
                Escrit al
                
        2005-12-06 00:00:00
    
                per
                
        Pinucset
    
            </h3>

            <p>
                
        <p><span class="noticia">B&eacute;, primer de tot dir&eacute; que s&iacute;, pots ajudar i molt al programari lliure. En aquest article veurem com ho pots fer! El m&eacute;s important &eacute;s que s&agrave;pigues que per ajudar-nos no cal que s&agrave;pigues inform&agrave;tica i ni molt menys que siguis programador.<br /> <br /> Cal recordar que el programari lliure el fem amb les aportacions de tots, si jo puc traduir i no programar doncs tradueixo, potser un altre podr&agrave; programar!<br /> <br /> Per ajudar al programari lliure podem dur a terme m&uacute;ltiples accions que es veuen en aquest article.</span><br />&nbsp;</p><br />    <div id="article" class="article_normal">Anem a mirar com ens pots ajudar!:<br /> <br /> <br /> <li><strong>Porta el programari lliure als que no el coneixen:</strong> La majoria de vegades la gent no coneix cap alternativa al sistema operatiu que els ha vingut de f&agrave;brica. Per aix&ograve;, el m&eacute;s important es fer con&egrave;ixer GNU/Linux i el programari lliure a tothom, si la gent nom&eacute;s mir&eacute;s la qualitat del programari que utilitza el m&eacute;s segur &eacute;s que Microsoft no tingu&eacute;s el monopoli. Per aquest motiu diuen aix&ograve; de &quot;Microsoft es una gran empresa con un gran departamento de marketing y un peque&ntilde;o departamento de desarrollo de software&quot;<br /> <br /> Per a fer el programari lliure conegut pots venir amb nosaltres, <a href="http://www.catux.org/">. Som una associaci&oacute;</a> que quedem cada diumenge per parlar sobre qu&egrave; fer, quins projectes portar a terme, com ajudar els usuaris novells...<br /> Si no tens cap grup d&#39;usuaris a prop de casa teva pots provar de fer-ne un, reuneix un grup d&#39;amics que estigueu entusiasmats pel programari lliure i porteu-lo al m&oacute;n!<br /> Pots demanar <a href="http://shipit.ubuntu.com/">CDs d&#39;Ubuntu Gratis</a> i distribuir-los per la teva ciutat, amics, biblioteca, cibercaf&egrave;s... no siguis pessimista, potser la gent no s&#39;instal&middot;lar&agrave; GNU/Linux, per&ograve; el que &eacute;s segur &eacute;s que els comen&ccedil;ar&agrave; a sonar i no ho veuran estrany!<br /> </li><li><strong>Ajuda a la gent que estigui fent els seus primers passos amb programari lliure:</strong> Per exemple podeu entrar als canals de Linux del Freenode i ajudar als que estiguin comen&ccedil;ant, si un amic o conegut teu est&agrave; comen&ccedil;ant a utilitzar programari lliure ajuda&#39;l, si tens un grup d&#39;usuaris de GNU/Linux a prop de casa ves a veure si necessiten un cop de m&agrave;, etc.<br /> </li><li><strong>Dona idees o reporta errors:</strong> Pensa que en el programari lliure els usuaris s&oacute;n els que decideixen cap a on tirar&agrave; l&#39;aplicaci&oacute;, a difer&egrave;ncia del privatiu, que ve regit pel marketing. Per aix&ograve; s&oacute;n molt importants les llistes on es discuteix d&#39;alguna aplicaci&oacute;, chats.... Si t&#39;agrada molt algun programa apunta&#39;t a la llista i digues el que creguis, que podrien fer etc.<br /> Tamb&eacute; &eacute;s molt important reportar errors a trav&eacute;s dels Bug Trackers dels programes, si mai trobes un error no pensis que no t&eacute; import&agrave;ncia o que ja ha estat reportat. Si us plau, mira si ha estat reportat i si no &eacute;s aix&iacute; reporta&#39;l! Imagina&#39;t si un usuari novell de GNU/Linux se li penja, potser no tornar&agrave; i ser&agrave; culpa teva per no haver reportat l&#39;error! Aix&iacute; que despr&eacute;s no et queixis!<br /> </li><li><strong>Programant:</strong> No tothom en sap, per&ograve; si en saps i tens temps lliure pots ajudar molt&iacute;ssim programant per la teva aplicaci&oacute; preferida!<br /> </li><li><strong>Aportacions econ&ograve;miques:</strong> Tot i que la majoria de vegades el programari lliure &eacute;s gratu&iuml;t (cosa que no significa que lliure signifiqui gratu&iuml;t), els projectes solen necessitar ajudes econ&ograve;miques per a finan&ccedil;ar-se: pagar l&#39;allotjament dels webs, fer quedades per a parlar cap a on tirar&agrave; el projecte... a vegades els fundadors d&#39;alguna aplicaci&oacute; demanen una ajuda econ&ograve;mica. Pensa que si els hi dones 5&euro; ja els haur&agrave;s ajudat molt!<br /> Recorda el que et costaria un ordinador sense programari lliure! 268&euro; Windows, 193&euro;Office,5&euro; Photoshop... i anem sumant! Per tant, si ens costaria tant tenir un ordinador amb programari privatiu donar una mica de diners al programari lliure &eacute;s bona idea!<br /> Podeu ajudar econ&ograve;micament:<br /> <br /> </li><li><strong><a href="http://fsf.org/">A la Free Software Foundation</a>:</strong> &eacute;s una associaci&oacute; que vetlla pel programari lliure, treballa en diversos projectes, entre ells el compilador GCC... Fer-se membre costa uns 50&euro; i et donaran un llibre, una distribuci&oacute; un pel peculiar, una carta firmada a puny per ells... Tot i aix&ograve; si no vols donar 50&euro; l&ograve;gicament accepten qualsevol tipus de donaci&oacute;.<br /> Ajudant a la Free Software Foundation ells repartiran els diners si algun projecte els necessita, per&ograve; si vols donar diners a algun projecte que t&#39;interessi tamb&eacute; ho pots fer ajudant el KDE, l&#39;Amarok, el Gnome...<br /> Qualsevol ajuda ser&agrave; benvinguda!<br /> <br /> <br /> </li><li><strong>Traduint:</strong> Cal recordar que tenim moltes aplicacions en catal&agrave; perqu&egrave; nosaltres amb bona fe les hem ajudat a traduir, tot i aix&ograve; hi ha moltes aplicacions i grups de traductors que necessiten ajuda per a traduir. Per exemple: <br />                                                                                                                            <br /> </li><li> Nosaltres, <a href="http://www.catux.org/">Catux</a>: Estem traduint el Gallery al catal&agrave; ja que encara no hi ha cap projecte que ho faci.<br /> Si ens vols ajudar <a href="http://www.catux.org/index.php?num=366&amp;PHPSESSID=0c9187325cbac86e2824bf477f0b3ca4">llegeix aquesta noticia</a><br /> </li><li> El projecte <a href="http://www.ubuntulinux.org/">Ubuntu</a> tamb&eacute; necessita un cop de m&agrave; <a href="https://launchpad.net/rosetta">en la seva traducci&oacute;</a><br /> </li><li> Tot i aix&ograve; hi han molts altres projectes que estan traduint, si sou molt aficionats a alguna aplicaci&oacute; podr&iacute;eu ajudar traduint i/o documentant!<br /> <br /> </li><li><strong>La Free Software Foundation ens demana ajuda <a href="http://www.fsf.org/campaigns/priority.html">amb aquests projectes d&#39;alta prioritat</a></strong><br /> <br /> <br /> Ja has vist de quantes maneres ens pots ajudar, si mai tens temps lliure o vols ajudar doncs ja ho saps! Tria quina &eacute;s la teva aplicaci&oacute; preferida i mira com ajudar-la!<br /> <br /> Si no saps a qui ajudar si us plau, ajuda <a href="http://www.fsf.org/campaigns/priority.html">en aquests projectes</a>, ja que la FSF ens demana ajuda, s&oacute;n uns punts que tenim fluixos i que fan que algunes persones encara utilitzin programari privatiu. Ajuda a aquests projectes i la FSF t&#39;ho agrair&agrave;!<br /> <br /> I recorda, si <a href="http://en.wikipedia.org/wiki/Linus_Torvalds">Linus Torvals</a> i  <a href="http://en.wikipedia.org/wiki/Stallman">Richard Stallman</a> van aconseguir pujar tot el moviment del programari lliure ara que som tants podem fer molt i cada vegada m&eacute;s r&agrave;pid!<br /> <br /> Moltes gr&agrave;cies!</li></div>
    
            </p>

            <h3>
                Categories:
                
        Articles, Iniciació
    
            </h3>

            <hr />
            <h1>Comentaris</h1>
            <ul class="list-group">
                
        <li class="list-group-item">Sense comentaris</li>
    
            </ul>


            <a href="http://catux.org/post_list.html">
                <i class="fas fa-chevron-left"></i>
                Arxius
            </a>
        </div>

    </div>


    </div> <!-- /.container -->

    <div class="container">
        <nav class="navbar navbar-inverse catux-footer">
            <p class="navbar-text">
                Tot el contingut de Catux està subjecte sota la nova versió de la llicència de
                <a href="http://creativecommons.org/licenses/by/2.5/es/deed.ca">Creative Commons</a>
            </p>
        </nav>
    </div>



</body>
</html>
