<!DOCTYPE html>
<html>
<head lang="cat">
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="description" content="Associació d'usuaris de GNU/Linux de la Catalunya Central">
    <meta name="keywords" content="gnu/linux, linux, programari lliure, gnu, lug, associacio, manresa, sant joan de vilatorrada, catalan, català, catalunya">
    <meta name="author" content="Catux">
    <link rel="icon" href="http://catux.org/images/favicon.ico">

    <title>Catux</title>

    <link rel="stylesheet" type="text/css" href="http://catux.org/css/main.css">
    <script src="http://catux.org/js/main.js"></script>
</head>
<body>
    <div class="navbar-wrapper">
        <div class="container">

            <nav class="navbar navbar-inverse">
                <div class="container">
                    <div class="navbar-header col-sm-5">
                        <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
                            <span class="sr-only">Toggle navigation</span>
                            <span class="icon-bar"></span>
                            <span class="icon-bar"></span>
                            <span class="icon-bar"></span>
                        </button>
                        <a href="http://catux.org/">
                            <img src="http://catux.org/images/catuxlogo.png" alt="Catux" width="40%"><br>
                            <div class="visible-lg"> Associació d'usuaris de GNU/Linux de la Catalunya Central</div>
                        </a>
                    </div>
                    <div id="navbar" class="navbar-collapse collapse navbar-links">
                        <ul class="nav navbar-nav navbar-right">
                            <li><a href="http://catux.org/post_list.html">Blog</a></li>
                            <li><a href="http://catux.org/traduccio.html">Traducció</a></li>
                            <li><a href="http://catux.org/contactar.html">Contactar</a></li>
                        </ul>
                    </div>
                </div>
            </nav>
        </div>
    </div> <!-- /.navbar-wrapper -->

    <div class="container">
        
    <div class="container-fluid">

        <div class="post">
            <a href="http://catux.org/post_list.html">
                <i class="fas fa-chevron-left"></i>
                Arxius
            </a>

            <h1>
                
        ¿Carne o Pescado? La metáfora del Software Libre
    
            </h1>

            <h3>
                Escrit al
                
        2004-09-07 00:00:00
    
                per
                
        Sachiel
    
            </h3>

            <p>
                
        <span class="noticia">Un text que recomano llegir, que ens pot servir per explicar a la gent &quot;no entesa&quot; quins s&oacute;n els beneficis d&#39;utilitzar programari lliure.</span> <br /> <br /> El programari lliure ha estat descrit mitjan&ccedil;ant moltes met&agrave;fores diferents, com ara la de les receptes de cuina de Stallman.<br /> <br /> Fent servir aquesta suposici&oacute; com a base, he mirat d&rsquo;anar una mica m&eacute;s enll&agrave; i fer tot el que he pogut per tal de conv&egrave;ncer a la gent que faci servir - o si m&eacute;s no, provi - el programari lliure. Aqu&iacute; ho teniu.<br /> <br /> Imaginat que entres a un restaurant per dinar. El cambrer, sense ensenyar-te la carta, et serveix un plat d&rsquo;estofat. El plat te bon aspecte; mires al teu voltant i veus que tothom est&agrave; menjant estofat.<br /> <br /> Quan el proves, trobes que &eacute;s fastig&oacute;s. No sembla que sigui vedella ni porc. Per&ograve; tothom continua menjant estofat, aix&iacute; que suposes que te l&rsquo;haur&agrave;s de menjar tu tamb&eacute;.<br /> <br /> Quan ja te n&rsquo;has menjat la meitat del plat, entra una altra persona i s&rsquo;asseu a la taula del costat. Li porten l&rsquo;estofat, per&ograve; el rebutja. Demana un llenguado en salsa.<br /> <br /> Sorpr&egrave;s, et demanes si el peix deu ser tant dolent com l&#39;estofat. Veus que el tipus triga ben b&eacute; un quart d&#39;hora a treure les espines i netejar el peix, per&ograve; sembla que el peix li agradi. Un senyor assegut al teu costat s&#39;adona que mires al noi del peix i et comenta &ldquo;No entenc com pot menjar peix. Perd m&eacute;s d&#39;un quart d&#39;hora per netejar-lo!&rdquo;. El noi sent la conversa i contesta &ldquo;T&#39;asseguro que val la pena dedicar-hi aquest temps<br /> i molt m&eacute;s&rdquo;.<br /> <br /> A m&eacute;s, sents a dir que algunes persones que van menjar carn ahir han agafat gastroenteritis, possiblement per menjar carn en mal estat. Mentrestant, la persona del peix ha acabat i fa avisar al cuiner per dir-li que el plat era bon&iacute;ssim per&ograve; que provi de posar-hi una mica de suc de llimona &ldquo;Ser&agrave; encara m&eacute;s sabor&oacute;s&rdquo;. Decideixes fer venir al cuiner per dir-li que l&#39;estofat era immenjable, per&ograve; et contesta que els que<br /> mengen estofat tenen prohibit preguntar d&#39;on ha sortit la carn, i que,si no t&#39;agraden les patates, no pots canviar-les per bolets, per exemple. &ldquo; Com pot ser que no pugui saber quin tipus d&#39;animal estic menjant?&rdquo;, li dius. Sembla ser que l&#39;empresa de distribueix la carn en guarda en secret la proced&egrave;ncia, per&ograve; garanteix que &eacute;s de primera<br /> qualitat i, &eacute;s clar, apta per al consum.<br /> <br /> L&#39;individu del peix surt del restaurant... sense pagar el compte! Li demanes al cambrer, i et diu que el peix &eacute;s gratu&iuml;t, per&ograve; que l&#39;estofat cal pagar-lo. El senyor del teu costat diu: &ldquo;Gratu&iuml;t? Jo no me&#39;n fio ni un pel&rdquo;. Tot i aix&ograve;, penses si &eacute;s possible que hi hagi alguna cosa pitjor que la carn de l&#39;estofat. Pagues un dineral per un estofat<br /> dolent&iacute;ssim i te&#39;n vas del restaurant. Pel cam&iacute; cap a casa, trobes un altre restaurant un fan pagar pel peix, tot i que &eacute;s m&eacute;s econ&ograve;mic que no pas la carn. El cambrer et confirma que &eacute;s el mateix tipus de peix, per&ograve; porta extra de guarnici&oacute;. Si no vols la guarnici&oacute;, tamb&eacute; &eacute;s gratu&iuml;t.<br /> <br /> Passada una setmana tornes a anar al mateix restaurant. No tens clar si triar peix o continuar amb la carn. Veus que tothom est&agrave; menjant estofat. Trobes en una taula el xicot de la setmana passada, per&ograve; en comptes del llenguado ha demanat llu&ccedil; amb alls. Et demana si vols seure al seu costat.<br /> <br /> T&#39;hi asseus i el cabrer et porta l&#39;estofat. Quin fastig. Una altra persona et xiuxiueja &ldquo;Pensa que si demanes peix no et porten vi rosat&rdquo;. El noi del teu costat est&agrave; prenent vi blanc. Tampoc hi ha tanta difer&egrave;ncia. Et diu &ldquo;Vols peix? Si no saps treure les espines, et puc donar un cop de m&agrave;. &Eacute;s bon&iacute;ssim. Tasta&#39;l, si no t&#39;agrada no passa res. Sempre pots tornar a demanar estofat&rdquo;. Fa una riallada. &ldquo;De veritat<br /> t&#39;agrada? &Eacute;s dolent&iacute;ssim&rdquo;.<br /> <br /> T&#39;envaeixen els dubtes i recordes els comentaris de la setmana passada. Demanes la proced&egrave;ncia del peix. Podria ser que fos dolent. Et respon que &eacute;s peix del dia, que pots anar a la llotja i veure com l&#39;amo del restaurant el compra cada dia. Et comenta que els m&eacute;s grans &ldquo;gourmets&rdquo; sempre demanen peix per dinar. Necessiten una certa garantia de qualitat degut al seu estatus social i paguen a un notari que comprova cada dia<br /> que el peix sigui fresc. La resta de compradors se n&#39;aprofiten, ja que el notari no nom&eacute;s garanteix el peix dels m&eacute;s exigents, si no tots els palets de la llotja.<br /> <br /> Afegeix &ldquo;&Eacute;s que pots comprovar la proced&egrave;ncia de la carn? Mira, qualsevol persona pot pescar el seu propi peix i cuinar-lo com m&eacute;s li agradi. L&#39;empresa que controla la carn nom&eacute;s permet cuinar-lo a la seva manera. Ni tant sols saps quin animal t&#39;est&agrave;s menjant. Creus que &eacute;s normal? Si &eacute;s una carn tant bona, que &eacute;s el que amaguen?&rdquo;<br /> <br /> &ldquo;Un cop has agafat pr&agrave;ctica amb les espines, encara que triguis una mica m&eacute;s a dinar, quedes m&eacute;s satisfet. De deb&ograve;, et dono un cop de m&agrave; fins que li agafis el truc. No puc entendre com pot haver gent que pagui per aquesta... carn?&rdquo; Li recordes que hi ha molta gent que s&#39;escapa sense pagar. &ldquo; Si, &eacute;s clar que pots escapar-te sense pagar. Per&ograve; podent<br /> menjar-me un bon peix, no em menjaria aquesta carn ni que me&#39;l regalessin. Si el tastes em donar&agrave;s la ra&oacute;&rdquo;<br /> <br /> Tu que triaries per dinar?<br /> <br /> Extret de <a href="http://www.espaciolinux.com/noticia267.html">http://www.espaciolinux.com/noticia267.html</a>
    
            </p>

            <h3>
                Categories:
                
        Articles, Humor
    
            </h3>

            <hr />
            <h1>Comentaris</h1>
            <ul class="list-group">
                
        <li class="list-group-item comment">web original web original
Comentari de : laura el dia : 07-09-2004 16:03:10


L'article original està a aquesta web: http://revistes.upc.es/~topopardo/weblog/archives/000036.html ... per rotllos de llicència i tal. ;-))<p class="comment-author">Escrit al 2006-12-28 14:57:30 per laura</p></li><li class="list-group-item comment">web original web original
Comentari de : Sachiel el dia : 08-09-2004 12:37:13

Gràcies per l'apunt, tens raó que a la web que jo anuncio diuen que l'enllaç original és aquest que dius.

Anava a canviar-lo, però al clicar sobre l'enllaç només se m'obre una pàgina en blanc :\. No se si es problema meu o d'ells, així que per si de cas mantenim les dues referències i no toco res.<p class="comment-author">Escrit al 2006-12-28 14:58:11 per Sachiel</p></li>
    
            </ul>


            <a href="http://catux.org/post_list.html">
                <i class="fas fa-chevron-left"></i>
                Arxius
            </a>
        </div>

    </div>


    </div> <!-- /.container -->

    <div class="container">
        <nav class="navbar navbar-inverse catux-footer">
            <p class="navbar-text">
                Tot el contingut de Catux està subjecte sota la nova versió de la llicència de
                <a href="http://creativecommons.org/licenses/by/2.5/es/deed.ca">Creative Commons</a>
            </p>
        </nav>
    </div>



</body>
</html>
