<!DOCTYPE html>
<html lang="ca">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="description" content="Associació d'usuaris de GNU/Linux de la Catalunya Central">
    <meta name="keywords" content="gnu/linux, linux, programari lliure, gnu, lug, associacio, manresa, sant joan de vilatorrada, catalan, català, catalunya">
    <meta name="author" content="Catux">
    <link rel="icon" href="https://catux.org/images/favicon.ico">

    <title>Catux - Associació d'usuaris de GNU/Linux de la Catalunya Central</title>

    <!-- Bootstrap 5 CSS is included in main.css -->
    <link rel="stylesheet" type="text/css" href="https://catux.org/css/main.css">
    <!-- Bootstrap 5 JS and dependencies are included in main.js -->
    <script src="https://catux.org/js/main.js" defer></script>
</head>
<body>
    <header class="sticky-top">
        <nav class="navbar navbar-expand-lg navbar-dark bg-dark py-3">
            <div class="container-fluid">
                <a class="navbar-brand" href="https://catux.org/">
                    <img src="https://catux.org/images/catuxlogo.png" alt="Catux" height="50" class="me-3">
                    <div class="d-none d-lg-block">Associació d'usuaris de GNU/Linux de la Catalunya Central</div>
                </a>
                <button class="navbar-toggler" type="button" data-bs-toggle="collapse" data-bs-target="#navbarMain" aria-controls="navbarMain" aria-expanded="false" aria-label="Toggle navigation">
                    <span class="navbar-toggler-icon"></span>
                </button>
                <div id="navbarMain" class="collapse navbar-collapse">
                    <ul class="navbar-nav ms-auto mb-2 mb-lg-0">
                        <li class="nav-item"><a class="nav-link px-3" href="https://catux.org/post_list.html">Blog</a></li>
                        <li class="nav-item"><a class="nav-link px-3" href="https://catux.org/traduccio.html">Traducció</a></li>
                        <li class="nav-item"><a class="nav-link px-3" href="https://catux.org/contactar.html">Contactar</a></li>
                    </ul>
                </div>
            </div>
        </nav>
    </header>

    <div class="container main-container">
        
    <div class="container-fluid">

        <div class="post">
            <a href="https://catux.org/post_list.html">
                <i class="fas fa-chevron-left"></i>
                Arxius
            </a>

            <h1>
                
        Kde, les seves aplicacions i com integrar-les
    
            </h1>

            <h3>
                Escrit al
                
        2005-11-26 00:00:00
    
                per
                
        Pinucset
    
            </h3>

            <p>
                
        <span class="noticia">Kde o &ldquo;K Desktop Environment&rdquo; &eacute;s un escriptori, &eacute;s a dir, un gestor de finestres amb un conjunt d&#39;aplicacions amb un aspecte visual homogeni.<br /> <br /> KDE es basa en la personalitzaci&oacute;, tots els components del KDE poden ser configurats en major o menor grau per l&#39;usuari i estan perfectament integrats (Kontact, Kmail, Konqueror...).<br /> <br /> En aquest article veurem de quines aplicacions disposem i com integrar-les entre si...<br /> <br /> Nota: corregit l&#39;enlla&ccedil; a l&#39;article, era incorrecte.</span> <br />    <div id="article" class="article_normal"><h2>Kde, qu&egrave; &eacute;s?</h2><br /> Kde o &ldquo;K Desktop Environment&rdquo; &eacute;s un escriptori, &eacute;s a dir, un gestor de finestres amb un conjunt d&#39;aplicacions amb un aspecte visual homogeni.<br /> <br /> KDE es basa en la personalitzaci&oacute;, tots els components del KDE poden ser configurats en major o menor grau per l&#39;usuari i tots estan perfectament integrats (Kontact, Kmail, Konqueror...).<br /> <br /> <h2>KDE, quines aplicacions t&eacute;?</h2><br /> Primer de tot comentarem les diferents aplicacions que t&eacute; el KDE per aix&iacute; con&egrave;ixer el que tenim. Entre d&#39;altres aplicacions disposem de:<br /> <br /> <li><strong>Amarok</strong><br /> &Eacute;s un reproductor de multim&egrave;dia de gran qualitat, una important aplicaci&oacute; del programari lliure.<br /> Permet crear col&middot;leccions, veure la lletra de la can&ccedil;&oacute; que s&#39;est&agrave; escoltant al igual que la biografia de l&#39;artista...<br /> <img src="http://catux.org/imatges/articles/kdeintegracio/amarok.png" alt="" /><br /> </li><li><strong>JUK</strong><br /> Reproductor i organitzador d&#39;&agrave;udio.<br /> M&eacute;s senzill que l&#39; Amarok per&ograve; compleix la seva funci&oacute; perfectament.<br /> <img src="http://catux.org/imatges/articles/kdeintegracio/juk.png" alt="" /><br /> </li><li><strong>K3B</strong><br /> Aplicaci&oacute; de gravaci&oacute; de CDS, DVDs.<br /> <img src="http://catux.org/imatges/articles/kdeintegracio/k3b.png" alt="" /><br /> </li><li><strong>Kate</strong><br /> Eficient editor de text, estil bloc de notes per&ograve; amb molta m&eacute;s funcionalitat.<br /> <img src="http://catux.org/imatges/articles/kdeintegracio/kate.png" alt="" /><br /> </li><li><strong>Kaffeine</strong><br /> Reproductor de v&iacute;deos.<br /> <img src="http://catux.org/imatges/articles/kdeintegracio/kaffeine.png" alt="" /><br /> </li><li><strong>Kdevelop</strong><br /> Entorn integrat de desenvolupament.<br /> <br /> </li><li><strong>Kmail</strong><br /> Client de correu electr&ograve;nic.<br /> <img src="http://catux.org/imatges/articles/kdeintegracio/kmail.png" alt="" /><br /> </li><li><strong>Koffice</strong><br /> Paquet ofim&agrave;tic for&ccedil;a complert.<br /> <br /> </li><li><strong>Konqueror</strong><br /> Gestor d&#39;arxius i navegador web.<br /> <img src="http://catux.org/imatges/articles/kdeintegracio/konqueror.png" alt="" /><br /> </li><li><strong>Konsole</strong><br /> Terminal<br /> <img src="http://catux.org/imatges/articles/kdeintegracio/konsole.png" alt="" /><br /> </li><li><strong>Kontact</strong><br /> paquet de comunicaci&oacute;.<br /> <img src="http://catux.org/imatges/articles/kdeintegracio/kontact.png" alt="" /><br /> </li><li><strong>Kopete</strong><br /> Missatgeria instant&agrave;nia.<br /> <img src="http://catux.org/imatges/articles/kdeintegracio/kopete.png" alt="" /><br /> </li><li><strong>Quanta</strong><br /> Aplicaci&oacute; de desenvolupament web.<br /> <img src="http://catux.org/imatges/articles/kdeintegracio/quanta.png" alt="" /><br /> </li><li><strong>Noatun</strong><br /> Reproductor multim&egrave;dia.<br /> <img src="http://catux.org/imatges/articles/kdeintegracio/noatun.png" alt="" /><br /> </li><li><strong>SuperKaramba</strong><br /> Gestor de miniaplicacions.<br /> <br /> </li><li><strong>Akregator</strong><br /> Lector de RSS.<br /> <img src="http://catux.org/imatges/articles/kdeintegracio/akregator.png" alt="" /><br /> </li><li><strong>Kpdf</strong><br /> Lector de PDFs de KDE, molt complet.<br /> <img src="http://catux.org/imatges/articles/kdeintegracio/kpdf.png" alt="" /><br /> <br /> <br /> Passem a mirar les aplicacions KDE principals i aix&iacute; anar veient com es poden integrar entre si per a tenir un c&ograve;mode entorn.<br /> <br /> <br /> </li><li><strong>Kontact</strong><br /> <br /> </li><li>&Eacute;s un interessant programa que ens permet organitzar la nostra informaci&oacute; (contactes, cites...)<br /> A l&#39;esquerra veiem tot d&#39;apartats: Resum, Correu, Contactes, Calendari, Pendents, Diari...<br /> Hi han moltes possibilitats, per&ograve; com que no tothom les necessita totes podem anar a &ldquo;Arranjament - Selecciona els components&rdquo; i escollir els que necessitem, jo recomano el Resum, Correu, Contactes, Calendari, Pendents i Diari, tot i que us en poden interessar d&#39;altres tamb&eacute;!<br /> Com que aix&ograve; no pret&eacute;n ser una guia de tot el que pot fer el Kontact anirem al gra.<br /> <br /> </li><li>Anem a Contactes, premem bot&oacute; dret a dins del espai en blanc i fem clic a Nou Contacte, des d&#39;aqu&iacute; podem afegir tots els nostres amics, coneguts, etc. Aix&iacute; tenir tota la informaci&oacute; junta!<br /> <img src="http://catux.org/imatges/articles/kdeintegracio/kontact%20contactes.png" alt="" /><br /> </li><li>Anem a Correu, a traves del Kontact o engegant el Kmail independentment, se&#39;ns obrir&agrave; l&#39;aplicaci&oacute; de correu electr&ograve;nic del KDE, ens la configurem pel nostre compte i ja tindrem el correu configurat.<br /> Si des del Kmail fem un clic a &#39;nou correu&#39; (a sota de fitxer) ens sortir&agrave; una pantalla per a fer el coreu. Si anem a &#39;Selecciona&#39; ens sortiran els contactes que hem afegit anteriorment! Genial no? <br /> De igual manera si a traves del Kontact anem als Contactes i fem bot&oacute; dret sobre algun d&#39;ells veiem per exemple &ldquo;Envia Correu-e al contacte&rdquo;. De moment ja tenim el Kmail integrat for&ccedil;a b&eacute; amb el Kontact.<br /> Com a curiositat mencionar que si als nostres contactes els hi posem la foto quan els hi enviem un mail veurem la seva foto.<br /> <br /> </li><li>Des del Kontact accedim a la pestanya Calendari, des de la qual podem afegir quines feines, compromisos tenim pendents, anem al dia i fent bot&oacute; dret a la casella inferior dreta podem afegir esdeveniments nous.<br /> Hem de tenir en compte que el que tinguem aqu&iacute; ens avisar&agrave; a la vista Resum del Kontact, per a no deixar-se res. Per exemple, ens avisar&agrave; de que tenim una cita d&#39;aqu&iacute; a poc, que d&#39;aqu&iacute; uns dies es l&#39;aniversari d&#39;alguna persona que tinguem afegida als contactes...<br /> <img src="http://catux.org/imatges/articles/kdeintegracio/kontact%20calendari.png" alt="" /><br /> <br /> </li><li>Tamb&eacute; podem afegir feines a la pestanya &#39;Pendents&#39;, d&#39;aquesta manera sabrem el que hem de fer, el l&iacute;mit de temps per a fer-ho i que ens vagi avisant, de manera que ja no tinguem excusa per a dir que no hi hav&iacute;em pensat.<br /> <img src="http://catux.org/imatges/articles/kdeintegracio/kontact%20pendents.png" alt="" /><br /> <br /> <br /> Les dem&eacute;s caracter&iacute;stiques del Kontact us les deixo per experimentar a vosaltres mateixos! Per exemple, li podem dir al Kontact que ens informi del temps (utilitzant el Ktemps), que ens informi de noticies, notes que apuntem, configurar el Kpilot, sincronitzar...<br /> <br /> </li><li><strong>Kopete</strong><br /> El Kopete &eacute;s el client de missatgeria instant&agrave;nia de KDE, des d&#39;ell podem afegir contactes de diversos protocols (Jabber, Messenger, Yahoo Messenger...).<br /> <br /> </li><li><strong>Konqueror</strong><br /> El Konqueror tant pot ser el gestor de fitxers com el navegador web del nostre escriptori.<br /> Est&agrave; perfectament integrat amb el Akregator per a llegir els RSS i el Kaffeine, aix&iacute; podem veure v&iacute;deos a traves de web usant el Kaffeine.<br /> Com tots els navegadors t&eacute; pestanyes (menys Internet Explorer), punts (preferits)...<br /> <br /> </li><li><strong>Akregator</strong><br /> El Akregator &eacute;s el lector de RSS de KDE, un lector de RSS &eacute;s una aplicaci&oacute; que permet llegir una web o un blog de noticies sense haver d&#39;anar a la web, de manera que podem saber que ha passat a totes les webs que tenim a l&#39;Akregator nom&eacute;s fent una ullada, sense la necessitat d&#39;anar web per web.<br /> La podem tenir integrada amb el Kontact, afegint com a Component-Enlla&ccedil;os.<br /> <br /> </li><li><strong>Amarok</strong><br /> L&#39;Amarok, com he comentat &eacute;s una aplicaci&oacute; per escoltar m&uacute;sica, ordenar col&middot;leccions de m&uacute;sica, seguir la lletra, veure la biografia de l&#39;autor...<br /> T&eacute; una bona integraci&oacute; permetent gravar tot el que tens en una col&middot;lecci&oacute; o el que est&agrave;s escoltant en un cd mitjan&ccedil;ant el K3b.<br /> Si anem a la nostra col&middot;lecci&oacute; del Amarok podem fer clic sobre un directori i escollir &ldquo;Grava totes les peces d&#39;aquest artista&rdquo;, esculls cd-audio i ja tindr&agrave;s el teu cd de m&uacute;sica .<br /> <img src="http://catux.org/imatges/articles/kdeintegracio/amarokgrabar.png" alt="" /><br /> </li><li><strong>Konsole</strong><br /> La Konsole &eacute;s el terminal de KDE, a part de tot el que es pot fer amb ella t&eacute; una interessant integraci&oacute; amb el navegador web Konqueror, sin&oacute; proveu d&#39;arrossegar un enlla&ccedil; des del Konqueror fins al Konsole: es pot copiar, enganxar, moure... Molt interessant.<br /> <img src="http://catux.org/imatges/articles/kdeintegracio/konsolaikonqueror" alt="" /><br /> </li><li><strong>Kpdf</strong><br /> El Kpdf &eacute;s el lector de PDFs de KDE, s&#39;integra b&eacute; amb el Konqueror, aix&iacute; podem veure PDFs sense sortir del navegador.<br /> <br /> <br /> <br /> Amb aquest petit article us vull animar a provar KDE utilitzant les seves aplicacions, ja que com es diu entre totes ho fan tot, utilitzant totes les aplicacions KDE tindrem tindrem un entorn molt personalitzable i perfectament integrat.<br /> <br /> Tamb&eacute; &eacute;s interessant que us mireu el Kcontrol del KDE per a tal de configurar-vos encara millor el vostre entorn.</li></div>
    
            </p>

            <h3>
                Categories:
                
        Articles, Trucs
    
            </h3>

            <hr />
            <h1>Comentaris</h1>
            <ul class="list-group">
                
        <li class="list-group-item">Sense comentaris</li>
    
            </ul>


            <a href="https://catux.org/post_list.html">
                <i class="fas fa-chevron-left"></i>
                Arxius
            </a>
        </div>

    </div>


    </div> <!-- /.container -->

    <footer class="bg-dark text-light py-4 mt-5 fixed-bottom">
        <div class="container">
            <div class="row">
                <div class="col-md-8">
                    <p class="mb-0">
                        <small><small>Tot el contingut de Catux està subjecte sota la nova versió de la llicència de
                        <a href="http://creativecommons.org/licenses/by/2.5/es/deed.ca" class="text-light">Creative Commons</a></small></small>
                    </p>
                </div>
                <div class="col-md-4 text-md-end">
                    <p class="mb-0">
                        <a href="https://github.com/catux" class="text-light me-3"><i class="fab fa-github"></i></a>
                        <a href="https://t.me/+UaRevB06YidmYTY0" class="text-light"><i class="fab fa-telegram"></i></a>
                    </p>
                </div>
            </div>
        </div>
    </footer>



</body>
</html>
