<!DOCTYPE html>
<html>
<head lang="cat">
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="description" content="Associació d'usuaris de GNU/Linux de la Catalunya Central">
    <meta name="keywords" content="gnu/linux, linux, programari lliure, gnu, lug, associacio, manresa, sant joan de vilatorrada, catalan, català, catalunya">
    <meta name="author" content="Catux">
    <link rel="icon" href="http://localhost:9000/images/favicon.ico">

    <title>Catux</title>

    <link rel="stylesheet" type="text/css" href="http://localhost:9000/css/main.css">
    <script src="http://localhost:9000/js/main.js"></script>
</head>
<body>
    <div class="navbar-wrapper">
        <div class="container">

            <nav class="navbar navbar-inverse">
                <div class="container">
                    <div class="navbar-header col-sm-5">
                        <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
                            <span class="sr-only">Toggle navigation</span>
                            <span class="icon-bar"></span>
                            <span class="icon-bar"></span>
                            <span class="icon-bar"></span>
                        </button>
                        <a href="http://localhost:9000/">
                            <img src="http://localhost:9000/images/catuxlogo.png" alt="Catux" width="40%"><br>
                            <div class="visible-lg"> Associació d'usuaris de GNU/Linux de la Catalunya Central</div>
                        </a>
                    </div>
                    <div id="navbar" class="navbar-collapse collapse navbar-links">
                        <ul class="nav navbar-nav navbar-right">
                            <li><a href="http://localhost:9000/post_list.html">Blog</a></li>
                            <li><a href="http://localhost:9000/traduccio.html">Traducció</a></li>
                        </ul>
                    </div>
                </div>
            </nav>
        </div>
    </div> <!-- /.navbar-wrapper -->

    <div class="container">
        
    <div class="container-fluid">

        <div class="post">
            <a href="http://localhost:9000/post_list.html">
                <i class="fas fa-chevron-left"></i>
                Arxius
            </a>

            <h1>
                
        La teoria del Pin
    
            </h1>

            <h3>
                Escrit al
                
        2004-10-20 00:00:00
    
                per
                
        franhp
    
            </h3>

            <p>
                
        <span class="noticia">En aquest petit fragment intentar&eacute; explicar la situaci&oacute; viscuda a la reuni&oacute; del dia 17 d&rsquo;octubre, en la que el nostre nou &ldquo;rappel&rdquo; o &quot;merlin&quot; va descobrir el que cap ment normal hagu&eacute;s sigut capa&ccedil; de descobrir.</span> <br />    Aquell dia va arribar en whats_up a la reuni&oacute;, com sempre (espero), exposant el seu greu problema, aparentment res, ja que es tractava d&rsquo;un simple n&uacute;mero que adquiria un altre valor sense cap ra&oacute;. Aquest problema va fer que tota l&rsquo;associaci&oacute; es pos&eacute;s a admirar el port&agrave;til nou d&rsquo;en what&rsquo;s, ostres .... vull dir el problema.<br /> Ell havia provat molts i molts kernels, havia modificat el driver, havia provat la targeta en diferents ordinadors i funcionava, per&ograve; la q&uuml;esti&oacute; &eacute;s que la targeta no li funcionava al seu ordinador i ell nom&eacute;s trobava el problema amb el n&uacute;mero, que no li detectava la marca.<br /> Fins que va arribar en Pinux, tot poder&oacute;s, va observar durant uns moments, la manera en com aquell senyor treia targetes de xarxa d&rsquo;un estoig a raig. Va quedar pensant (no s&eacute; si en comprar targetes de xarxa per fer-ne col&bull;lecci&oacute;, o b&eacute; en solucionar el problema) mentre restava observant la pantalla...<br /> Tots est&agrave;vem desesperats i ell va articular les seves paraules m&agrave;giques ... per el poder que m&rsquo;ha sigut concedit, en nom de Merlin, far&eacute; que aquesta targeta torni a funcionar....(evidentment no va funcionar) aix&iacute; que va utilitzar-ne un altre.<br /> Segons sembla totes les targetes que hem provat tenien un valor senar... menys la targeta en q&uuml;esti&oacute; que tenia un valor senar, &eacute;s a dir parell, ja m&rsquo;heu ent&egrave;s... podria ser que fos un pin que no hi toca i per aix&ograve; aquesta no funcionava correctament.<br /> Tot el m&oacute;n se&rsquo;l va quedar mirant, perplexos, impassibles, doncs deia tonteries... <br /> Vam tornar a comprovar tots els nombres, la seva teoria comen&ccedil;ava a ser certa, tot el m&oacute;n va comen&ccedil;ar a apartar-se d&rsquo;en Pinux (pot ser la cosa aquesta que tenia s&rsquo;enganxava) i tot d&rsquo;una en what&rsquo;s va agafar el m&ograve;bil a mode llanterna i va comen&ccedil;ar a mirar al slot i ............. era cert!!!!!!!!, hi havia un pin tor&ccedil;at!!!!! En Pinux &eacute;s deixeble d&rsquo;en Rappel!!!<br /> La cosa va acabar b&eacute;, el pin va poder ser arreglat i a partir d&rsquo;aquell dia la targeta va funcionar.<br /> <br /> Whats_up : va seguir amb la seva carrera d&rsquo;inform&agrave;tic amb el seu nou i flamant port&agrave;til amb capacitat de targetes pcmcia.<br /> <br /> Port&agrave;til d&rsquo;en whats_up: se li va desenganxar l&rsquo;enganxina aquella rosa i per fi va aconseguir destapar el seu gran NOTEBOOK, ara &eacute;s m&eacute;s atractiu per a la resta de port&agrave;tils de Catux.<br />  <br /> El pin del port&agrave;til d&rsquo;en whats_up: va mantenir-se en bona posici&oacute; fins a la fi dels seus dies, va ser demostrada una agressi&oacute; per part dels altres pins, ja que era l&rsquo;&uacute;ltim!<br /> <br /> Pinux: va abandonar la inform&agrave;tica i ara llegeix mans a la rambla, mitjan&ccedil;ant un nou m&egrave;tode, el qual consisteix a veure si te els dits parell o senars i d&rsquo;aquesta manera poder diagnosticar si els pins del cap els hi toquen.<br /> <br /> Merlin: va deixar l&rsquo;ofici d&rsquo;endev&iacute;, ja que el seu deixeble (Pinux) el va superar!<br /> <br /> Gr&agrave;cies per llegir!!!<br />
    
            </p>

            <h3>
                Categories:
                
        Articles, Resums setmanals
    
            </h3>

            <hr />
            <h1>Comentaris</h1>
            <ul class="list-group">
                
        <li class="list-group-item comment">Re: La teoria del Pin 
Que consti q a Catux tb hi ha gent normal :P

Tot i modificar una mica la realitat, el resultat és q ara va de COÑA i per sort no vaig haber d'enviar-lo :)<p class="comment-author">Escrit al 2006-12-28 15:58:57 per whats_up</p></li><li class="list-group-item comment">Disculpes 
Tot s'ha de dir que no estava gaire atent, també s'ha de dir que la real no fa tanta gracia XP<p class="comment-author">Escrit al 2006-12-28 16:00:22 per grap</p></li><li class="list-group-item comment">Fantàstic! Un relat fantàstic!

Quan pugui escriuré alguna cosa com a comentari també com a partir implicada :-)<p class="comment-author">Escrit al 2006-12-28 16:01:08 per cpina</p></li>
    
            </ul>


            <a href="http://localhost:9000/post_list.html">
                <i class="fas fa-chevron-left"></i>
                Arxius
            </a>
        </div>

    </div>


    </div> <!-- /.container -->

    <div class="container">
        <nav class="navbar navbar-inverse catux-footer">
            <p class="navbar-text">
                Tot el contingut de Catux està subjecte sota la nova versió de la llicència de
                <a href="http://creativecommons.org/licenses/by/2.5/es/deed.ca">Creative Commons</a>
            </p>
        </nav>
    </div>



</body>
</html>
