<!DOCTYPE html>
<html>
<head lang="cat">
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="description" content="Associació d'usuaris de GNU/Linux de la Catalunya Central">
    <meta name="keywords" content="gnu/linux, linux, programari lliure, gnu, lug, associacio, manresa, sant joan de vilatorrada, catalan, català, catalunya">
    <meta name="author" content="Catux">
    <link rel="icon" href="http://catux.org/images/favicon.ico">

    <title>Catux</title>

    <link rel="stylesheet" type="text/css" href="http://catux.org/css/main.css">
    <script src="http://catux.org/js/main.js"></script>
</head>
<body>
    <div class="navbar-wrapper">
        <div class="container">

            <nav class="navbar navbar-inverse">
                <div class="container">
                    <div class="navbar-header col-sm-5">
                        <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
                            <span class="sr-only">Toggle navigation</span>
                            <span class="icon-bar"></span>
                            <span class="icon-bar"></span>
                            <span class="icon-bar"></span>
                        </button>
                        <a href="http://catux.org/">
                            <img src="http://catux.org/images/catuxlogo.png" alt="Catux" width="40%"><br>
                            <div class="visible-lg"> Associació d'usuaris de GNU/Linux de la Catalunya Central</div>
                        </a>
                    </div>
                    <div id="navbar" class="navbar-collapse collapse navbar-links">
                        <ul class="nav navbar-nav navbar-right">
                            <li><a href="http://catux.org/post_list.html">Blog</a></li>
                            <li><a href="http://catux.org/traduccio.html">Traducció</a></li>
                        </ul>
                    </div>
                </div>
            </nav>
        </div>
    </div> <!-- /.navbar-wrapper -->

    <div class="container">
        
    <div class="container-fluid">

        <div class="post">
            <a href="http://catux.org/post_list.html">
                <i class="fas fa-chevron-left"></i>
                Arxius
            </a>

            <h1>
                
        Linux, el desconegut (treball de recerca)
    
            </h1>

            <h3>
                Escrit al
                
        2005-05-24 00:00:00
    
                per
                
        franhp
    
            </h3>

            <p>
                
        <span class="noticia">Aquest treball de recerca prova d&#39;introduir-nos al m&oacute;n de Linux, tractant tota mena de temes: hist&ograve;ria, distribucions, ...<br /> Est&agrave; indicat per aquelles persones que no tenen coneixements sobre aquest sistema operatiu.</span><br />    <div id="article" class="article_normal">Introducci&oacute;<br /> Aquest treball de recerca consisteix en presentar un sistema operatiu totalment desconegut per a la majoria de la gent.<br /> Es tracta d&rsquo;un sistema gratu&iuml;t que ha viscut sota l&rsquo;ombra de l&rsquo;hegemonia de Windows, el sistema operatiu m&eacute;s utilitzat per tothom.<br /> M&rsquo;agradaria demostrar que tots els mites que ha creat la companyia Microsoft sobre la inseguretat del sistema i el seu dif&iacute;cil funcionament s&oacute;n del tot falsos, doncs es produeix m&eacute;s sovint en el seu propi sistema.<br /> Linux &eacute;s, per tant, una de les milers d&rsquo;alternatives disponibles al sistema dominant, Windows. Existeixen diferents tipus de sistemes operatius que tenen diferents finalitats, des de servir p&agrave;gines Web fins a funcionar com a simple escriptori d&rsquo;un usuari.<br /> La migraci&oacute; de aplicacions d&rsquo;un sistema a l&rsquo;altre no &eacute;s dif&iacute;cil avui dia, ja que molts programes s&oacute;n bastant iguals tan en un sistema com en l&rsquo;altre. A m&eacute;s a m&eacute;s hi ha moltes aplicacions que son capaces de ser executades en les diferents plataformes, ja que el codi &eacute;s molt similar en elles, implicant m&eacute;s facilitat. <br /> Per aix&ograve; utilitzarem una distribuci&oacute; molt actual i f&agrave;cil d&rsquo;utilitzar, com &eacute;s Ubuntu. Aquesta disposa de una gran col&middot;lecci&oacute; de programari actualitzat i totalment tradu&iuml;ts al catal&agrave;.<br /> <br /> <br /> Introducci&oacute; a Linux<br /> Un sistema operatiu &eacute;s un programa amb capacitat d&rsquo;administrar el maquinari i el programari d&rsquo;un ordinador. Abans estaven dissenyats per a complir funcions limitades al maquinari, com s&oacute;n administrar fitxers, operacions amb programes, ... utilitzant una l&iacute;nia de comandes. Era necess&agrave;ria una interf&iacute;cie d&rsquo;usuari, en la que nosaltres pod&iacute;em fer que el sistema operatiu reb&eacute;s les nostres ordres, amb la introducci&oacute; de comandes o seleccionant icones en un escriptori.<br /> Avui dia, un sistema operatiu es capa&ccedil; d&rsquo;administrar tot tipus d&rsquo;aplicacions, carregant-les a la mem&ograve;ria per a que l&rsquo;ordinador el pugui executar d&rsquo;una manera m&eacute;s r&agrave;pida.<br /> <br /> Els sistemes operatius basats en Unix tenen dos caracter&iacute;stiques especials que els fan destacar: multitasca i multiusuari. Multitasca significa que pot fer m&eacute;s d&rsquo;una tasca alhora, pots utilitzar un editor de text mentre que escoltes m&uacute;sica. Multiusuari significa que m&eacute;s d&rsquo;un usuari el pot utilitzar al mateix temps, mitjan&ccedil;at terminals diferents.<br /> Com que els sistemes operatius d&rsquo;abans estaven dissenyats especialment en funci&oacute; del maquinari, l&rsquo;usuari s&rsquo;havia d&rsquo;adaptar a aquests sistemes operatius tan complexes. Unix, per contra, era un sistema totalment flexiu, gr&agrave;cies a que estava fet en C, un llenguatge que utilitza el maquinari i per tant s&rsquo;adaptava a tot.<br /> Unix era una versi&oacute; per a mainframes, minicomputadores, ... aix&iacute; doncs es va crear Linux, la versi&oacute; per a PC. Un sistema operatiu compatible amb tot tipus de protocols, fins i tot els d&rsquo;altres tipus de sistemes que han sigut adaptats pels programadors.<br /> <br /> Linux &eacute;s un sistema operatiu gratu&iuml;t (sota la llicencia GNU Public License), de codi obert, desenvolupat mitjan&ccedil;ant la cooperaci&oacute; de molta gent, semblant a Unix i disponible per a casi totes les plataformes de maquinari. Ofereix un ampli suport a xarxes, moltes caracter&iacute;stiques d&#39;operaci&oacute; amb altres sistemes i un gran nombre d&rsquo;aplicacions nadiues i importades.<br /> Linux esta format pel Nucli del Sistema, el que tothom coneix pel nom de Kernel, m&eacute;s un gran nombre de programes, aplicacions i llibreries que fan possible la seva utilitzaci&oacute; i contribueixen al seu bon funcionament.<br /> Aquest Kernel est&agrave; en continu desenvolupament per Linus Torvalds i diversos companys, que reben suggeriments a trav&eacute;s de llistes de correu, per implementar les noves tecnologies.<br /> Aquest sistema va ser dissenyat durant la &egrave;poca d&rsquo;expansi&oacute; d&rsquo;Internet. Linus va cridar a tothom qui estigu&eacute;s disposat a ajudar-lo a trav&eacute;s de la xarxa. Gr&agrave;cies al gran nombre de gent que hi participa, cada dia apareixen noves aplicacions, que per suposat estan a disposici&oacute; de tot el m&oacute;n (doncs s&oacute;n GPL).<br /> Moltes companyies han comen&ccedil;at a crear aplicacions per a aquest sistema operatiu i altres s&rsquo;han dedicat a distribuir-lo gr&agrave;cies a la seva excepcional relaci&oacute; qualitat - preu.<br /> Si es vol comprar una llic&egrave;ncia Windows per a la teva empresa, ens costar&agrave; uns 150 &euro; per cada ordinador, que suposaria uns 2250 &euro; per una empresa petita d&rsquo;uns 15 ordinadors, en canvi, si vols comprar una llic&egrave;ncia de Red Hat (una empresa que ofereix suport t&egrave;cnic amb la seva pr&ograve;pia distribuci&oacute;), et podr&agrave; costar com a molt uns 50&euro; i no n&rsquo;haur&agrave;s de comprar m&eacute;s, ja que &eacute;s lliure i es pot utilitzar quantes vegades es vulgui. Cal mencionar que existeixen Distribucions totalment gratu&iuml;tes.<br /> Les plataformes en les que en un principi es pot utilitzar Linux s&oacute;n 386-, 486-, Pentium, Pentium Pro, Pentium II/III/IV, Amiga i Atari, tamb&eacute; existeixen versions per a utilitzar-lo en altres plataformes, com Alpha, ARM, MIPS, PowerPC i SPARC<br /> <br /> Hist&ograve;ria de Unix i Minix<br /> En 1968, un grup d&rsquo;investigadors de General Electric Company, AT&amp;T Bell Laboratories i el Massachussets Institute of Technology (MIT) van crear un projecte anomenat MULTICS (MULTIplexed Information Computin System) per crear un sistema operatiu de temps compartit que permet&eacute;s a un grup nombr&oacute;s d&#39;usuaris tenir una gran capacitat de computaci&oacute; i emmagatzemar grans quantitats de dades.<br /> Aquestes idees les va aprofitar Ken Thompson dels Laboratoris Bell per tal de desenvolupar un entorn de treball agradable per una de les grans m&agrave;quines de l&#39;&egrave;poca, el DEC PDP-7. A aquest projecte se li va unir una mica m&eacute;s tard Denis Ritchie i junts van crear la primera versi&oacute; de UNIX.<br /> Aquest sistema operatiu va gaudir d&#39;una gran acceptaci&oacute; sobretot a partir del 1973 quan es va reescriure en C, inventat aquell any pel mateix Ritchie i que s&#39;acabaria convertint en el llenguatge de programaci&oacute; per excel&middot;l&egrave;ncia. Aix&ograve; va permetre que UNIX pug&eacute;s funcionar en qualsevol ordinador amb canvis m&iacute;nims, fins llavors s&#39;havia de tornar a escriure per a cada nova m&agrave;quina.<br /> A partir de l&#39;any 1978 va deixar de ser una eina d&#39;investigaci&oacute; i desenvolupament interna dels Laboratoris Bell i moltes universitats i institucions el van adoptar i es van posar a treballar sobre ell. La variant m&eacute;s important va ser la de la Universitat de Berkeley a Calif&ograve;rnia que, finan&ccedil;ada pel govern dels Estats Units, va ser desenvolupada per experts en xarxes de comunicacions per tal d&#39;implementar-hi els protocols de la xarxa DARPA, precursora de l&#39;actual Internet.<br /> Fins aquell moment qualsevol podia disposar amb m&eacute;s o menys facilitat del codi font de UNIX, com de la majoria de programes, per tal de mirar com era o b&eacute; modificar-lo al seu gust si tenia prou coneixements inform&agrave;tics. Per&ograve; a partir de principis dels 80 els programes inform&agrave;tics van entrar en la din&agrave;mica comercial i els codis font dels programes es van convertir en secrets empresarials. Es podia comprar un sistema operatiu per una m&agrave;quina determinada per&ograve; no el podies modificar o adaptar-lo a les teves necessitats, ni tan sols podies mirar com estava fet. UNIX va passar a ser una marca comercial registrada.<br /> A l&#39;any 1987 el professor Andrew S. Tanenbaum va escriure un llibre sobre disseny de sistemes operatius. Com que no podia, per motius de copyright, utilitzar exemples de codi existent, va fer una versi&oacute; redu&iuml;da de UNIX que pug&eacute;s funcionar sobre els ordinadors personals de l&#39;&egrave;poca (8088 sense disc dur) perqu&egrave; els seus estudiants hi poguessin treballar. Tanenbaum va publicar el codi font complet a l&#39;ap&egrave;ndix del seu llibre i aquest sistema operatiu anomenat MINIX va tenir un &egrave;xit important en el camp de l&#39;ensenyament universitari.<br /> <br /> Hist&ograve;ria de Linus (creador de Linux)<br /> <br /> A l&#39;any 1991 Linus Torvalds va decidir escriure un nou MINIX que aprofit&eacute;s les caracter&iacute;stiques avan&ccedil;ades dels nous processadors 80386. L&rsquo;agost del mateix any, el jove estudiant va enviar el seg&uuml;ent correu electr&ograve;nic al grup de not&iacute;cies comp.os.minix<br /> <br /> <br />  From:torvalds@klaava.Helsinki.FI (Linus Benedict Torvalds)<br />   Newsgroup: comp.os.minix<br />   Subject: GCC-1.40 and a posix question<br />   Message-ID: 1991Jul13, 100050.9886@klaava.Helsinki.FI<br />   Date: 3 Jul 91 10:00:50 GMT<br /> <br />   Hello netlanders,<br />   Due a project I&#39;m working on (in minix), I&#39;m interested <br />   in the posix standard definition. Could somebody please <br />   point me to a (preferably) machine-readable format of the <br />   latest posix rules? Ftp-sites would be nice.<br /> <br /> Hola navegadors,<br /> A causa d&rsquo;un projecte en el que estic treballant (minix), Estic interessat en la definici&oacute; est&agrave;ndard del POSIX. Podria alg&uacute; senyalar-me un lloc llegible on hi haguessin les ultimes regles POSIX? Llocs FTP estarien millor.<br /> <br /> Poc despr&eacute;s va enviar un altre dient que estava treballant com a hobby en la creaci&oacute; d&rsquo;un sistema operatiu:<br /> <br /> From: torvalds@klaava.Helsinki.FI (Linus Benedict Torvalds)<br /> Newsgroups: comp.os.minix<br /> Subject: What would you like to see most in minix?<br /> Summary: small poll for my new operating system<br /> Message-ID: <br /> Date: 25 Aug 91 20:57:08 GMT<br /> Organization: University of Helsinki<br /> Hello everybody out there using minix -<br /> I&#39;m doing a (free) operating system (just a hobby, won&#39;t be big and<br /> professional like gnu) for 386(486) AT clones. This has been brewing<br /> since april, and is starting to get ready. I&#39;d like any feedback on<br /> things people like/dislike in minix, as my OS resembles it somewhat<br /> (same physical layout of the file-system (due to practical reasons)<br /> among other things).<br /> I&#39;ve currently ported bash(1.08) and gcc(1.40), and things seem to work.<br /> This implies that I&#39;ll get something practical within a few months, and<br /> I&#39;d like to know what features most people would want. Any suggestions<br /> are welcome, but I won&#39;t promise I&#39;ll implement them :-)<br /> Linus (torvalds@kruuna.helsinki.fi)<br /> PS. Yes - it&#39;s free of any minix code, and it has a multi-threaded fs.<br /> It is NOT protable (uses 386 task switching etc), and it probably never<br /> will support anything other than AT-harddisks, as that&#39;s all I have :-(.<br /> <br /> Hola a tota persona que utilitzi minix &ndash;<br /> Estic treballant en un sistema operatiu (gratu&iuml;t)(com a hobby, no ser&agrave; tan gran ni professional com GNU) per a clons de AT en 386 (486). Hi he estat treballant des de l&rsquo;abril i sembla que ja est&agrave; apunt. M&rsquo;agradaria saber les coses que li agraden/desagraden a la gent de minix, ja que s&rsquo;assemblen (la mateixa disposici&oacute; de fitxers-sistema, per raons de comoditat)<br /> He importat Bash (1.08) i gcc (1.40) i les coses sembla que funcionen. Aix&ograve; implica que tindr&eacute; alguna cosa pr&agrave;ctica en pocs mesos, i m&rsquo;agradaria saber quines caracter&iacute;stiques li agraden a la gent. Totes les propostes s&oacute;n benvingudes, per&ograve; no prometo que les implementi :-)<br /> PS. Si &ndash; &eacute;s lliure per&ograve; no &eacute;s portable i possiblement mai ho sigui ja que nom&eacute;s tinc discs durs AT :-(<br /> <br /> Linus mai hagu&eacute;s cregut que canviaria el m&oacute;n de l&rsquo;ordinador per sempre. Linux versi&oacute; 0.01 va sortir a mitjan setembre del 1991 i va ser col&middot;locat a Internet. <br /> Gr&agrave;cies a la col&middot;laboraci&oacute; de milers de programadors d&#39;arreu del m&oacute;n connectats a trav&eacute;s de Internet que hi van treballar de manera desinteressada durant el seu temps lliure, van enviar els seus codis modificats a Linus, el qual va treure la versi&oacute; 0.02 a principi d&rsquo;octubre amb aquesta famosa declaraci&oacute;.<br /> <br /> From: torvalds@klaava.Helsinki.FI (Linus Benedict Torvalds)<br /> Newsgroups: comp.os.minix<br /> Subject: Free minix-like kernel sources for 386-AT<br /> Message-ID: <br /> Date: 5 Oct 91 05:41:06 GMT<br /> Organization: University of Helsinki<br /> Do you pine for the nice days of minix-1.1, when men were men and wrote their own device drivers? Are you without a nice project and just dying to cut your teeth on a OS you can try to modify for your needs? Are you finding it frustrating when everything works on minix? No more all-nighters to get a nifty program working? Then this post might be just for you :-)<br /> As I mentioned a month(?) ago, I&#39;m working on a free version of a minix-lookalike for AT-386 computers. It has finally reached the stage where it&#39;s even usable (though may not be depending on what you want), and I am willing to put out the sources for wider distribution. It is just version 0.02 (+1 (very small) patch already), but I&#39;ve successfully run bash/gcc/gnu-make/gnu-sed/compress etc under it.<br /> Sources for this pet project of mine can be found at nic.funet.fi (128.214.6.100) in the directory /pub/OS/Linux.<br /> The directory also contains some README-file and a couple of binaries to work under linux<br /> (bash, update and gcc, what more can you ask for :-). Full kernel source is provided, as no minix code has been used. Library sources are only partially free, so that cannot be distributed currently. The system is able to compile &quot;as-is&quot; and has been known to work. Heh. Sources to the binaries (bash and gcc) can be found at the same place in /pub/gnu.<br /> <br /> Resum: Recordeu quan cadasc&uacute; s&rsquo;havia d&rsquo;escriure el seu propi codi per a cada pe&ccedil;a de maquinari?[&hellip;]<br /> Com vaig mencionar fa un mes, estic treballant en una versi&oacute; semblant a minix per a AT-386. Ja he aconseguit que funcioni i he fet funcionar bash, gcc, gnu-make, gnu-sed, compress, etc.<br /> Les fonts d&rsquo;aquest projecte es troben a nic.funet.fi (128.214.6.100) al directori /pub/OS/Linux<br /> [&hellip;] He utilitzat algunes parts del codi de Minix, per tant algunes parts no son distribu&iuml;bles, [&hellip;]<br /> <br /> La versi&oacute; 0.03 va sortir en poques setmanes i al desembre en va sortir la 0.10, encara que aquestes versions eren molt esquel&egrave;tiques, nom&eacute;s suportaven discs durs de AT i no es podia executar sense bash. La versi&oacute; 0.11 va ser molt millor ja que suportava diferents tipus de teclat, diferents dispositius de disquet, suport per a VGA, EGA, Hercules, etc. El n&uacute;mero de la versi&oacute; va pujar directament des del 0.12 fins al 0.95, ja que el codi havia estat millorat considerablement a trav&eacute;s d&rsquo;Internet. Va tardar m&eacute;s d&rsquo;un any en treure la versi&oacute; 1.0, que va arribar el 14 de maig de 1994. La s&egrave;rie actual del nucli &eacute;s la 2.6.x i segueix creixent dia a dia per millorar la seva estructura.<br /> <br /> S&#39;ha d&#39;entendre que si b&eacute; Linux &eacute;s el nucli del sistema operatiu i la seva part m&eacute;s important, un nucli sol no pot fer absolutament res. Per&ograve; aquestes utilitats ja havien estat desenvolupades per la Free programari Foundation i nom&eacute;s faltava ajuntar-ho per tenir el qu&egrave; ara anomenen GNU/Linux. Linus va decidir que el nom d&rsquo;aquest sistema operatiu seria Freax (Free &ldquo;lliure&rdquo; + Freak &ldquo;raro&rdquo; + X &ldquo;sistema de finestres&rdquo;) per&ograve; gr&agrave;cies a un company seu va decidir anomenar-lo Linux i atorgar-lo a la llic&egrave;ncia GPL<br /> <br /> <br /> <br /> Aviat, moltes companyies es van moure en aquest m&oacute;n creant les &ldquo;distribucions&rdquo;, que eren el conjunt del Kernel m&eacute;s cert programari. Les companyies m&eacute;s famoses van ser Red Hat, Caldera, Debian. Altres companyies van guanyar m&eacute;s responsabilitat, com &eacute;s el cas de les creadores de GUIs (Graphical User Interface), com ara X-Window, KDE, GNOME,... Linux era, per tant, sistema operatiu segur, fiable i, sobretot, que es pot descarregar, modificar, corregir, millorar (sempre, es clar, que tingueu algun coneixement de programaci&oacute;) i utilitzar gratu&iuml;tament tot convertint-se avui en dia en l&#39;amena&ccedil;a m&eacute;s important a l&#39;hegemonia de Microsoft en el m&oacute;n dels sistemes operatius i un aut&egrave;ntic fenomen en el mercat mundial de servidors amb una quota de mercat del 27% i el suport de companyies de l&#39;al&ccedil;ada d&#39;IBM, Hewlett-Packard i Sun Microsystems.<br /> <br /> Kernel<br /> <br /> Nucli del sistema o Kernel es podria definir com a cor del sistema operatiu. &Eacute;s l&rsquo;encarregat de que tot el programari y el maquinari de l&rsquo;ordinador puguin treballar junts.<br /> Les funcions m&eacute;s importants, encara que no les &uacute;niques, s&oacute;n:<br /> - Administraci&oacute; de la mem&ograve;ria, per a tots els programes en execuci&oacute;.<br /> - Administraci&oacute; del temps del processador, que aquests programes en execuci&oacute; utilitzen<br /> - &Eacute;s l&rsquo;encarregat de que puguem accedir als perif&egrave;rics/elements del nostre ordinador d&rsquo;una manera c&ograve;moda.<br /> <br /> Hi ha Dos versions del Linux Kernel:<br /> - Versi&oacute; de Producci&oacute;: La versi&oacute; de producci&oacute;, &eacute;s la versi&oacute; estable fins al moment. Aquesta versi&oacute; &eacute;s el resultat final de les versions de desenvolupament o experimentals.<br /> Quan l&rsquo;equip de desenvolupament de kernel experimental, decideix que ha aconseguit un kernel estable i amb suficient qualitat, es llen&ccedil;a una nova versi&oacute; de producci&oacute; o estable. Aquesta versi&oacute; &eacute;s la s&#39;hauria utilitzar per un &uacute;s normal del sistema, ja que son les versions considerades m&eacute;s estables i lliures d&rsquo;errades en el moment del llan&ccedil;ament.<br /> - Versi&oacute; de Desenvolupament: Aquesta versi&oacute; &eacute;s experimental i &eacute;s la que utilitzen els desenvolupadors per programar, comprovar i verificar noves caracter&iacute;stiques, correccions, etc. Aquest nuclis solen ser inestables i no s&rsquo;haurien d&rsquo;utilitzar, a no ser que es s&agrave;piga el que es fa.<br /> <br /> Les versions del Kernel es numeren amb 3 nombres, de la seg&uuml;ent forma: XX.YY.ZZ<br /> XX &amp;#61664; indica la s&egrave;rie principal del kernel. Fins ara nom&eacute;s existeixen la 1 i la 2. Aquest nombre canvia quan la manera de funcionar del kernel ha experimentat un canvi molt important.<br /> YY&amp;#61664;Indica si la versi&oacute; &eacute;s de desenvolupament o de producci&oacute;. Un nombre senar, significa que &eacute;s de desenvolupament, un parell, que &eacute;s de producci&oacute;.<br /> ZZ&amp;#61664;Indica les noves revisions dins de la versi&oacute;, en les que l&rsquo;&uacute;nic que s&rsquo;ha modificat, son errades de programaci&oacute; (bugs)<br /> Els kernels es poden descarregar d&rsquo;un gran nombre de servidors d&rsquo;internet. Especialment des de http://www.kernel.org<br /> Caracter&iacute;stiques<br /> <br /> -Multitasca: La paraula multitasca descriu l&rsquo;habilitat d&rsquo;executar varis programes al mateix temps.<br /> Linux utilitza la multitasca preventiva, la qual assegura que tots els programes que s&rsquo;estan utilitzant en un moment donat seran executats, sent el sistema operatiu l&rsquo;encarregat de cedir el temps del microprocessador a cada programa.<br /> - Multiusuari: Molts usuaris utilitzant la mateixa m&agrave;quina al mateix temps.<br /> -Multiplataforma: Les plataformes en les que en un principi es pot utilitzar Linux son 386-, 486-, Pentium, Pentium Pro, PentiumI-IV, Amiga i Atari, tamb&eacute; existeixen versions per a la seva utilitzaci&oacute; en plataformes com Alpha, ARM, MIPS, PowerPC i SPARC.<br /> -Multiprocessador: Suport per a sistemes amb m&eacute;s d&rsquo;un processador, nom&eacute;s disponible per a Intel y SPARC<br /> Funciona en mode protegit 386<br /> -Protecci&oacute; de la mem&ograve;ria entre processos, de manera que cap d&rsquo;ells pugui penjar el sistema.<br /> -Carrega els executables per demanda: Linux nom&eacute;s llegeix del disc aquelles parts d&rsquo;un programa que son utilitzades actualment.<br /> -Mem&ograve;ria virtual utilitzant paginaci&oacute; (sense intercanvi de processos complerts) a disc: A una partici&oacute; o fitxer en el sistema d&rsquo;arxius, o ambd&oacute;s, amb la possibilitat d&rsquo;afegir m&eacute;s &agrave;rees d&rsquo;intercanvi sobre la marxa.<br /> -La mem&ograve;ria es gestiona com a un recurs unificat per als programes de l&rsquo;usuari i per la mem&ograve;ria cau del disc, de tal forma que tota la mem&ograve;ria lliure pot ser utilitzada com a mem&ograve;ria cau i aquesta pot, a la seva vegada, ser redu&iuml;da quan s&rsquo;executin grans programes.<br /> -Llibreries compartides de c&agrave;rrega din&agrave;mica (Dll&rsquo;s) i llibreries est&agrave;tiques.<br /> -Es realitzen bolcats d&rsquo;estat (core dumps) per a possibilitar els an&agrave;lisi post-mortem, permetent l&rsquo;&uacute;s de depuradors sobre els programes.<br /> -Compatible amb POSIX, System V y BSD a nivell font.<br /> -Emulaci&oacute; de iBCS2, gaireb&eacute; completament compatible amb SCO, SVR3 i SVR4 a nivell binari.<br /> -Tot el codi font est&agrave; disponible, incloent-hi el nucli complet i tots els controladors, les eines de desenvolupament i tots els programes de usuari; a m&eacute;s a m&eacute;s tot aix&ograve; es pot distribuir lliurement. Hi ha alguns programes comercials que actualment no son distribu&iuml;ts amb el seu codi font, per&ograve; el programari gratu&iuml;t &eacute;s gratu&iuml;t<br /> -Control de tasques POSIX<br /> -Pseudo-terminals amb el nom de pty&rsquo;s<br /> -Emulaci&oacute; de 387 al nucli, de tal forma que els programes no hagin de fer la seva pr&ograve;pia emulaci&oacute; matem&agrave;tica, d&rsquo;aquesta manera totes les m&agrave;quines Linux semblaran que tinguin coprocessador matem&agrave;tic. <br /> -Suport per a molts teclats nacionals o adaptats i es bastant f&agrave;cil afegir-ne de nous din&agrave;micament.<br /> -Consoles virtuals m&uacute;ltiples: varies sessions de amb diferent usuaris a trav&eacute;s de la consola i totalment independents<br /> -Acc&eacute;s a particions MS-DOS mitjan&ccedil;ant un sistema d&rsquo;arxius especial: no es necessari cap comanda especial per a utilitzar la partici&oacute; MS-DOS doncs aquesta sembla tenir un sistema d&rsquo;arxius semblant al d&rsquo;Unix. El suport per a VFAT, FAT32 (Windows NT, 95/98) de lectura i escriptura es possible des de la versi&oacute; 2.0 per&ograve; els nom&eacute;s hi ha suport de lectura per a NTFS des de la 2.2<br /> -Sistema d&rsquo;arxius de CD-ROM que llegeix tots els formats est&agrave;ndards de CD-ROM<br /> -TCP/IP, incloent ftp, telnet, ...<br /> -programari client i servidor de Netware, Windows Native (Samba) i Lan Manager.<br /> Diversos protocols de xarxa inclosos en el kernel: TCP, IPv4, IPv6, AX.25, X.25, IPX, DDP, Netrom, etc.<br />  <br /> <br /> <br /> <br /> <br /> <br /> <br /> Distribucions de Linux<br /> <br /> Linux ha sigut sempre un sistema operatiu de lliure distribuci&oacute;, que serveix de ben poc tot sol, es per aix&ograve; que s&rsquo;ajunten aplicacions del projecte GNU. <br /> Fer que aquest conjunt funcioni &eacute;s una tasca molt dif&iacute;cil per a un usuari de nivell mitj&agrave;, aix&iacute; que seria impossible per a un usuari de nivell b&agrave;sic.<br /> Per aquesta causa hi ha conjunts de aplicacions, fitxers, programes i el sistema Linux a les que anomenem Distribucions. Totes elles es poden aconseguir gratu&iuml;tament a trav&eacute;s d&rsquo;Internet o demanant els CDs a l&rsquo;empresa per un m&ograve;dic preu.<br /> Tot seguit s&rsquo;exposaran les m&eacute;s importants:<br /> <br /> <br /> <br /> Red Hat<br /> Aquesta distribuci&oacute; &eacute;s la m&eacute;s coneguda i la m&eacute;s comercialitzada. Encara que pertany a la GPL, es necess&agrave;ria una subscripci&oacute; per a poder actualitzar el sistema, el problema &eacute;s que s&rsquo;ha de pagar. Abans aquesta empresa nom&eacute;s cobrava el suport que oferien. Per a la gent que no vol continuar amb l&rsquo;anterior projecte, els ha quedat el projecte Fedora Core que m&eacute;s endavant explicarem.<br /> Red Hat (barret vermell) ofereix suport per a empreses, sobre codi obert i actualitzacions d&rsquo;aplicacions. El tipus de paquets que utilitza s&oacute;n RPM i es pot aconseguir m&eacute;s informaci&oacute; a www.redhat.com<br /> <br /> <br /> <br /> Fedora Core<br /> Aquesta distribuci&oacute; &eacute;s el projecte gratu&iuml;t de Red Hat, pot ser descarregat des de diversos servidors a triar a la p&agrave;gina oficial (http://fedora.redhat.com). Va ser comen&ccedil;ada per Warren Togami com a una comunitat per construir paquets d&rsquo;alta qualitat per a Red Hat. Ara s&oacute;n dos projectes similars que han desembocat dues Distribucions. <br /> Actualment la ultima versi&oacute; estable &eacute;s Fedora Core 2. Aquesta utilitza Anaconda Installer per a la instal&middot;laci&oacute;, Gnome 2.6.0.1 i la versi&oacute; 2.6.5 del Kernel. A m&eacute;s d&#39;una gran quantitat d&rsquo;aplicacions importants com per a l&rsquo;edici&oacute; de texts, servidor web, ...<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> Debian<br /> Aquesta distribuci&oacute; &eacute;s la m&eacute;s coneguda pels usuaris de nivell mig-alt. &Eacute;s la distribuci&oacute; creada &uacute;nicament per programadors de tot el m&oacute;n sense formar cap empresa, per tant &eacute;s completament gratu&iuml;ta. Ens arriba amb uns 8710 paquets compilats pr&egrave;viament (un total de 8 CDs), que poden aconseguir-se a www.debian.org.<br /> Ofereixen suport a trav&eacute;s de correu electr&ograve;nic i els canals distribu&iuml;ts per tot l&rsquo;IRC.<br /> El projecte va ser comen&ccedil;at l&rsquo;agost de 1993 per Ian Murdock. Al principi no era res m&eacute;s que un conjunt de hackers que van decidir fer un sistema operatiu totalment lliure utilitzant Linux i GNU. El nom ve del nom de la seva dona, Debra, i el seu propi nom.<br /> Hi ha una llista d&rsquo;organitzacions que utilitzen Debian molt extensa en aquesta direcci&oacute; http://www.debian.org/users/ amb m&eacute;s de 20 membres espanyols.<br /> Curiosament totes les versions tenen el nom de personatges que hagin sortit a les pel&middot;l&iacute;cules de &ldquo;Toy Story&rdquo;, entre d&rsquo;altres &ldquo;woody&rdquo;, &ldquo;sid&rdquo;, &ldquo;sarge&rdquo;, ...<br /> L&rsquo;&uacute;ltima versi&oacute; estable &eacute;s la Debian 3.0 &ldquo;woody&rdquo;, amb el kernel 2.4.19 i la versi&oacute; 2.2.25 de KDE.<br /> Encara que sembli que est&agrave; enrederida, existeix el projecte unstable i el projecte testing, tots dos amb aplicacions actualitzades per&ograve; com be diu el nom, no es segur utilitzar-les.<br /> <br /> 					<br /> Suse <br /> Aquesta Distribuci&oacute;, d&rsquo;origen alemany, &eacute;s un altre marca comercial, suportada per una gran empresa anomenada Novell Business.<br /> La seva &uacute;ltima versi&oacute; disponible es la Suse Linux 9.1 Personal que pot ser extreta de la pagina oficial www.suse.com.<br /> Aquesta versi&oacute; funciona amb el kernel 2.6.4, una versi&oacute; de KDE 3.2, suport per a m&agrave;quines de 64 bits i el seu instal&middot;lador YaST.<br /> Existeixen solucions especials per a empreses i per a particulars. Tamb&eacute; existeix una versi&oacute; de Live-CD.<br /> <br /> <br /> Gentoo<br /> <br /> Aquesta distribuci&oacute; &eacute;s una de les m&eacute;s optimitzades i configurables. Gr&agrave;cies a la tecnologia anomenada Portage aquesta distribuci&oacute; pot esdevenir qualsevol tipus de sistema, ja sigui un servidor o una estaci&oacute; de treball. Per aix&ograve; l&rsquo;anomenem &#39;metadistribuci&oacute;&#39;.<br /> Portage ens ajuda, mitjan&ccedil;ant unes seq&uuml;&egrave;ncies de comandes, a triar el tipus d&rsquo;aplicacions que volem i les caracter&iacute;stiques que volem que tinguin. Al mateix temps mant&eacute; el sistema actualitzat.<br /> El sistema se&rsquo;ns presenta amb tots els paquets actualitzats gr&agrave;cies a Portage. T&eacute; una versi&oacute; de Live-CD tamb&eacute;.<br /> www.gentoo.org<br /> <br /> <br /> <br /> <br /> Mandrake<br /> Aquesta distribuci&oacute;, d&rsquo;origen Franc&egrave;s, &eacute;s considerada la m&eacute;s senzilla i esta basada en Red Hat. Tots els nous usuaris comencen per aquesta distribuci&oacute;. Pot ser comprada o b&eacute; descarregada de www.mandrakelinux.com<br /> Aquesta est&agrave; en la versi&oacute; 10.1 que cont&eacute; el Kernel 2.6.8, KDE 3.2.3 i el instal&middot;lador DiskDrake. T&eacute; una versi&oacute; Live-CD anomenada Mandrake-Move <br /> <br /> <br /> Knoppix<br /> Aquesta distribuci&oacute; basada en Debian, &eacute;s la versi&oacute; Live-CD per excel&middot;l&egrave;ncia. &Eacute;s un CD que conta amb una col&middot;lecci&oacute; de programes GNU/Linux i un sistema autom&agrave;tic de detecci&oacute; de maquinari que en suporta gran quantitat.<br /> Pot ser utilitzada per a habituar-se a l&rsquo;entorn Linux per part de les persones que vulguin provar-lo, pot ser utilitzat com a disc de rescat, etc. No es necessari instal&middot;lar-lo al disc dur, ja que utilitza la descompressi&oacute; al vol, i nom&eacute;s necessitar&agrave; la mem&ograve;ria RAM. Tamb&eacute; pot ser instal&middot;lada al disc dur.<br /> Disposa de la versi&oacute; 2.4.27 del Kernel, encara que com opcional tamb&eacute; hi ha la 2.6.7, tamb&eacute; t&eacute; KDE 3.2.3 entre d&rsquo;altres. Es pot treure de www.knoppix.org<br /> <br /> Distribucions Espanyoles.<br /> <br /> Linex<br /> GNU/Linex &eacute;s la distribuci&oacute; del govern Extremeny, una perfecta soluci&oacute; per als principiants ja que est&agrave; feta en Live-CD. Aquesta est&agrave; basada en Debian 3.0 (woody) amb un Kernel 2.4.18 i utilitzat des de GNOME 2.0. (www.linex.org)<br /> <br /> <br /> <br /> <br /> GuadaLinex<br /> Aquesta &eacute;s la proposta del govern Andal&uacute;s. Basada en la anteriorment mencionada Linex (Live-CD) amb dues versions existents: Guadalinex EDU per a escoles i Guadalinex per a la gent normal. (www.guadalinex.org)<br /> <br /> <br /> Catix<br /> Catix &eacute;s una altre proposta de Live-CD que disposa del Kernel 2.6.6 i KDE 3.2.2 (http://www.tecnocampus.com/catix/index.html)<br /> <br /> <br /> <br /> <br /> <br /> Lliurex<br /> Lliurex &eacute;s la proposta del govern Valenci&agrave; i est&agrave; especialitzada per a l&rsquo;&uacute;s escolar.<br /> <br /> <br /> Catux<br /> Aquesta associaci&oacute; ha creat un prodigi de distribuci&oacute;, basada en Damn Small Linux, que a la seva vegada esta basada en Knoppix. Es tracta d&rsquo;una distribuci&oacute; emmagatzemada dins una mem&ograve;ria USB , de manera que aquest actua com a un disc dur i pot ser arrencat mitjan&ccedil;ant els detectors de maquinari de Knoppix. La seva gran innovaci&oacute; &eacute;s la capacitat d&rsquo;escriptura al mem&ograve;ria USB, una cosa que fins ara no s&rsquo;havia aconseguit.<br /> Hi ha dues versions, la petita per a &uacute;s a mem&ograve;ries USB de 128 mb i la gran per a &uacute;s a mem&ograve;ries USB de 256 mb. Totes dues amb un kernel 2.4.25 i KDE. Aix&ograve; ho han aconseguit mitjan&ccedil;ant el peda&ccedil; e2compr, el qual es capa&ccedil; de comprimir el contingut.<br /> www.catux.org<br /> <br /> UBUNTU									<br /> La nostra distribuci&oacute; ser&agrave; la Ubuntu 4.10 (anomenada &quot;The Warty Warthog&quot;), una distribuci&oacute; de &uacute;ltima generaci&oacute;, que fa pocs mesos que va sortir, incorpora el kernel 2.6.8.1, la versi&oacute; m&eacute;s nova de GNOME com a interf&iacute;cie gr&agrave;fica i una gran quantitat de aplicacions tan per a l&rsquo;&uacute;s escolar com per a l&rsquo;empresarial. De totes maneres sempre es pot actualitzar el sistema i descarregar noves aplicacions amb la comanda apt-get install xxxx o la aplicaci&oacute; gr&agrave;fica Synaptic<br /> Els seus dip&ograve;sits estan dividits en quatre tipus:<br /> Main: Aplicacions lliures suportades pel sistema Ubuntu que seran actualitzades r&agrave;pidament en cas de trobar errors. Es pot trobar programari m&eacute;s utilitzat en entorns d&rsquo;escriptori i servidors.<br /> Restricted: Aplicacions amb llicencia d&#39;altres propietaris, aquesta ser&agrave; actualitzada quan els autors ho creguin convenient, doncs no &eacute;s lliure com la resta.<br /> Universe: M&eacute;s de 13.000 aplicacions no suportades directament per l&rsquo;equip que no estan subjectes a actualitzaci&oacute; immediata. (no activada per defecte)<br /> Multiverse: Aplicacions que no queda clar si s&oacute;n legals i poden ser distribu&iuml;des sense problemes a causa de les seves llicenci&eacute;s (no activada per defecte)<br /> <br /> Com podem comprovar en l&rsquo;annex, la instal&middot;laci&oacute; del nostre sistema no es gaire dif&iacute;cil, nom&eacute;s s&rsquo;han de seguir els passos i tenir molt de compte al fer les particions del nostre disc dur.<br /> A partir d&rsquo;aquest moment la nostra experi&egrave;ncia ser&agrave; molt pr&ograve;xima a l&rsquo;usual a Windows.<br /> <br /> <br /> <br /> Hist&ograve;ria d&rsquo;Ubuntu<br /> <br /> Mark ShuttleWorth, conegut per ser el primer turista espacial, va contractar a 35 hackers, als que va encarregar el desenvolupament d&rsquo;una complexa infraestructura especialment dissenyada per a millorar i facilitar el desenvolupament del sistema Linux.<br /> Es van reunir a Oxford durant 15 dies per treballar en quatre aplicacions.<br /> 1-Ubuntu: Un sistema operatiu basat en Debian explicat m&eacute;s endavant.<br /> 2- Soyuz: Una plataforma que facilita l&rsquo;agregaci&oacute; de paquets de programari<br /> 3-Malone: Un complex sistema de seguiment d&rsquo;errors<br /> 4-Rossetta: Un instrument destinat a suportar l&rsquo;assist&egrave;ncia per als traductors.<br /> <br /> Aquest projecte te una caracter&iacute;stica innovadora i &eacute;s que te&rsquo;l poden enviar a casa de manera gratu&iuml;ta (no importa la quantitat)<br /> http://www.shipit.ubuntulinux.org/<br /> <br /> <br /> <br /> Associacions <br /> GNU<br /> <br /> <br /> El fet de que Unix esdevingu&eacute;s marca registrada va impulsar a Richard Stallman, un altre dels grans noms del m&oacute;n de la inform&agrave;tica, a fundar al 1984 la Free Software Fundation, una organitzaci&oacute; sense &agrave;nim de lucre que t&eacute; com a missi&oacute; crear des de zero un UNIX gratu&iuml;t, de lliure distribuci&oacute; i amb el codi font obert anomenat amb l&#39;acr&ograve;nim GNU (GNU is Not Unix). Stallman i els seus col&middot;laboradors van comen&ccedil;ar a escriure les utilitats que hauria de tenir aquest hipot&egrave;tic sistema operatiu un cop exist&iacute;s. <br /> L&#39;aportaci&oacute; m&eacute;s important de la FSF al m&oacute;n de la inform&agrave;tica &eacute;s la seva llic&egrave;ncia GPL. Aquesta llic&egrave;ncia aplicada a un programa no nom&eacute;s fa que sigui gratu&iuml;t, de distribuci&oacute; lliure i amb el codi font disponible, sin&oacute; que obliga a que tamb&eacute; sigui aix&iacute; qualsevol modificaci&oacute; o programa derivat que utilitzi part del codi font.<br /> <br /> Avui dia, es confon el terme de GNU i Linux. Linux &eacute;s el que considerem el Kernel, el cor del sistema, la part que va fer Linus Torvalds i GNU seria el conjunt de programari, es per aix&ograve; que l&rsquo;anomenem GNU/Linux<br /> <br /> Richard Stallman &eacute;s el principal autor de la Col&middot;lecci&oacute; de Compiladors GNU, un compilador dissenyat per a suportar diverses arquitectures i m&uacute;ltiples llenguatges. Tamb&eacute; va escriure el GNU debugger (gbd), GNU Emacs i molts altres programes.<br /> www.gnu.org<br /> <br /> GPL (Llic&egrave;ncia p&uacute;blica general)<br /> <br /> <br /> Aquesta &eacute;s la llic&egrave;ncia que s&rsquo;aplica al programari de GNU entre d&rsquo;altres.<br /> La llic&egrave;ncia p&uacute;blica general ens proposa entre d&rsquo;altres els seg&uuml;ents termes:<br /> 1.Es poden copiar i distribuir c&ograve;pies literals del codi font.<br /> 2.Es pot modificar la c&ograve;pia del programa o qualsevol tros, senyalant les coses que heu modificat i distribuint-lo a la resta.<br /> 3.Es pot copiar i distribuir el programa, sempre i quan s&#39;entregui el codi font.<br /> 4.Si hi ha paisos o patents que restringeixen la distribuci&oacute;, aquesta quedar&agrave; rescindida.<br /> 5.Com que &eacute;s una llic&egrave;ncia gratu&iuml;ta, no existeix cap tipus de garantia, excepte si existeix cap acord entre els afectats.<br /> <br /> CATUX<br /> <br /> <br /> Catux &eacute;s una associaci&oacute; d&rsquo;usuaris de GNU/Linux procedents en la seva majoria del Bages que es reuneix a Sant Joan de Vilatorrada, concretament en un local anomenat &ldquo;Format&rdquo;, cada diumenge.<br /> Em vaig unir a aquest grup prop del mes d&rsquo;Agost i vaig assistir a diverses sessions, en les que van parlar de coses molt interessants relacionades amb el m&oacute;n de Linux i a m&eacute;s a m&eacute;s hem van ajudar en la instal&middot;laci&oacute; de Knoppix en el meu ordinador, que posteriorment vaig substituir per Ubuntu.<br /> Aquesta associaci&oacute; sense &agrave;nim de lucre, ha fet m&uacute;ltiples presentacions de Linux en diverses fires i esdeveniments. Tamb&eacute; treballa conjuntament amb l&rsquo;Ajuntament de Manresa en les classes que aquest ofereix, en especial les de instal&middot;laci&oacute; i iniciaci&oacute;.<br /> www.catux.org<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> Instal&middot;laci&oacute;<br /> <br /> La instal&middot;laci&oacute; de Windows no sol complicar-se molt, per&ograve; no passa el mateix amb Linux, ja que aquest sistema operatiu ens permet el control i la personalitzaci&oacute; d&rsquo;una quantitat major de par&agrave;metres i opcions en el proc&eacute;s. Malgrat tot aix&ograve; s&rsquo;estan fent grans aven&ccedil;os i moltes distribucions utilitzen un proc&eacute;s no gaire dif&iacute;cil.<br /> Abans de instal&middot;lar Linux, hem de llegir la informaci&oacute; que cont&eacute; el mateix CD de la distribuci&oacute;. Aix&ograve; sol ser un problema, ja que normalment est&agrave; tot en angl&egrave;s, per&ograve; gr&agrave;cies a http://es.tldp.org/, aquesta tasca no ens ser&agrave; dif&iacute;cil.<br /> Cal tenir en compte tamb&eacute; la manera en que s&rsquo;organitzen els fitxers segons el sistema operatiu<br /> Sistema Operatiu<br /> Sistema de fitxers<br /> Ms-DOS<br /> VFAT<br /> Linux<br /> Ext1/ext2/ext3/reiserfs<br /> Windows 95<br /> FAT16<br /> Windows 98<br /> FAT32<br /> Windows NT/2k/XP<br /> NTFS<br /> <br /> <br /> Generalment aix&ograve; dificulta la instal&middot;laci&oacute; de diversos sistemes operatius barrejats, per&ograve; per a solucionar aquest problema existeixen les particions, que consisteixen a dividir el nostre disc dur virtualment de forma que pugui contenir m&eacute;s d&rsquo;un tipus de sistema de fitxers. <br /> Si fem particions, podrem disposar de dos discs durs (no f&iacute;sics) de manera que podem instal&middot;lar diferents sistemes operatius a cada part. <br /> D&rsquo;aquesta manera podem deixar el nostre Windows en la primera partici&oacute; i instal&middot;lar Linux a la segona, aix&iacute; no perdrem dades ni perdrem l&rsquo;acc&eacute;s en cas d&rsquo;emerg&egrave;ncia a un altre sistema operatiu.<br /> <br /> Per a seleccionar amb quin sistema operatiu volem arrencar existeixen els gestors d&rsquo;arrancada, els quals s&rsquo;executen en el proc&eacute;s d&rsquo;arrancada del PC i ens permeten seleccionar el sistema que volem mitjan&ccedil;ant les tecles del direcci&oacute;. Els dos gestors m&eacute;s coneguts s&oacute;n LILO (Linux Loader) i GRUB.<br /> <br /> Hi ha un altre concepte b&agrave;sic a l&rsquo;hora d&rsquo;instal&middot;lar Linux, aquest &eacute;s el de Super Usuari o usuari Root. Aquest usuari &eacute;s l&rsquo;administrador del sistema i per tant te acc&eacute;s a tota la informaci&oacute; del sistema, per tant s&rsquo;ha d&rsquo;anar en compte quan s&rsquo;utilitzi aquest usuari, ja que es poden destruir moltes coses.<br /> <br /> <br /> <br /> <br /> Iniciaci&oacute;<br /> <br /> Existeixen tres formes d&rsquo;accedir a un sistema Linux:<br /> A trav&eacute;s d&rsquo;una consola de text, l&rsquo;usuari es connecta directament a l&rsquo;ordinador sense entorn gr&agrave;fic.<br /> Des d&rsquo;un gestor gr&agrave;fic (X Window), l&rsquo;usuari es connecta directament a l&rsquo;ordinador utilitzant un entorn gr&agrave;fic.<br /> Des d&rsquo;un ordinador remot mitjan&ccedil;ant protocols com telnet o Secure Shell (ssh)<br /> <br /> Entrada al sistema<br /> <br /> En tots els casos, ens apareixer&agrave; a la pantalla la seg&uuml;ent informaci&oacute;:<br /> Login:	(es tecleja el nom de l&rsquo;usuari)<br /> Password:  (es tecleja la contrasenya)<br /> <br /> Per motius de seguretat, la contrasenya ha de contenir com a m&iacute;nim sis car&agrave;cters i aquests han de ser diferents del nom de l&#39;usuari.<br /> <br /> Estructura del sistema<br /> <br /> Els arxius que cont&eacute; el sistema de fitxers han de tenir les seg&uuml;ents caracter&iacute;stiques:<br /> Han de tenir un nom de entre 1 i 255 car&agrave;cters.<br /> Es poden utilitzar tots els car&agrave;cters, excepte la barra inclinada &ldquo;/&rdquo;(simbolitza un directori), tampoc es recomanable utilitzar els car&agrave;cters de significat especial &ldquo;= \ ^ ~ &#39; &quot; ` * ; - ? [ ] ( ) ! &amp; ~ &lt; &gt; &ldquo;.<br /> Les lletres maj&uacute;scules i les min&uacute;scules es consideren diferents. No &eacute;s el mateix linux.txt que Linux.txt o linux.Txt<br />  <br /> De la mateixa manera que a Windows es poden aplicar extensions als fitxers per diferenciar-los. &Eacute;s per aix&ograve; que Linux nom&eacute;s distingeix tres tipus de arxius. <br /> Arxius o fitxers ordinaris, mencionats anteriorment.<br /> Directoris (o carpetes), arxiu especial que agrupa altres fitxers de manera estructurada.<br /> Arxius especials, representen els dispositius connectats a l&rsquo;ordinador, per tant introduir fitxers a l&rsquo;arxiu que equival a la impressora, seria el mateix que imprimir.<br /> <br /> Qualsevol sistema operatiu modern te una estructura jer&agrave;rquica i depen dels directoris . D&rsquo;aquesta manera hi ha un directori pare que emmagatzema els directoris de cada usuari i aquests el fitxers.<br /> El sistema d&rsquo;arxius de Windows est&agrave; lligat de forma directa al seu maquinari (C: representa el disc dur, D: representa la unitat lectora, ...), en canvi el sistema d&rsquo;arxius de Linux esta lligat a un directori arrel, expressat amb el signe &ldquo;/&rdquo; , del qual en sorgeixen la resta:<br /> <br /> / Arrel del sistema d&rsquo;arxius.<br /> /dev Cont&eacute; fitxers del sistema que representen  dispositius f&iacute;sics.<br /> /etc Aquest directori esta reservat per als fitxers de configuraci&oacute; del sistema. En aquest directori no ha d&#39;apar&egrave;ixer cap binari(programes), sin&oacute; que han d&#39;apar&egrave;ixer dos subdirectoris m&eacute;s:<br /> /etc/X11 Fitxers de configuraci&oacute; de X Window<br /> /etc/skel Fitxers de configuraci&oacute; b&agrave;sica que tamb&eacute; es troben al directori del usuari<br /> /lib Cont&eacute; les llibreries necess&agrave;ries per a la execuci&oacute; de programes que resideixen a /bin<br /> /proc Cont&eacute; fitxers especials que o b&eacute; reben o b&eacute; envien informaci&oacute; al kernel del sistema.<br /> /sbin Cont&eacute; programes que son accessibles nom&eacute;s per al superusuari o root.<br /> /usr Aquest &eacute;s un dels directoris m&eacute;s importants del sistema, doncs cont&eacute; els programes comuns de tots els usuaris. La seva estructura sol ser:<br /> /usr/X11R6 Cont&eacute; els programes per executar X Window.<br /> /usr/bin Programes generals, incloent el compilador C/C++.<br /> /usr/doc Documentaci&oacute; general del sistema.<br /> /usr/etc Fitxers de configuraci&oacute; generals.<br /> /usr/include Fitxers de cap&ccedil;alera de C/C++ (.h).<br /> /usr/info Fitxers de informaci&oacute; de GNU.<br /> /usr/lib Llibreries generals dels programes.<br /> /usr/man Manuals accessibles amb la comanda man (explicada m&eacute;s endavant)<br /> /usr/sbin Programes d&rsquo;administraci&oacute; del sistema.<br /> /usr/src Codi font de programes.<br /> /var Aquest directori cont&eacute; informaci&oacute; temporal de programes. <br /> <br /> Accedir als diferents dispositius no &eacute;s tan f&agrave;cil com a Windows, doncs el sistema d&rsquo;arxius requereix el proc&eacute;s de &ldquo;muntatge&rdquo;, molt m&eacute;s segur que el de Windows i al mateix temps ens estalvia la p&egrave;rdua de dades en el proc&eacute;s. Aquest consisteix a:<br /> - Introduir el disquet a la disquetera<br /> - Muntar el sistema d&rsquo;arxius amb la comanda mount<br /> - Manipular el contingut del disquet.<br /> - Desmuntar el sistema d&rsquo;arxius del disquet<br /> - Extreure el disquet. <br /> Aquest proc&eacute;s ens exigeix permisos de root per fer el proc&eacute;s m&eacute;s segur encara. <br /> <br /> Els sistemes Unix tenen uns permisos molt estrictes que ens donen acc&eacute;s als fitxers d&rsquo;una manera o un altre.<br /> R	 Perm&iacute;s de lectura del fitxer<br /> W 	 Perm&iacute;s de escriptura del fitxer<br /> X	 Perm&iacute;s d&rsquo;execuci&oacute; del fitxer<br /> S	 Perm&iacute;s per canviar el propietari del fitxer. <br /> <br /> Aquests permisos s&#39;estenen a un usuari especial (u), a un grup d&rsquo;usuaris (g) o a la resta de usuaris (a).<br /> <br /> A difer&egrave;ncia de Windows, els arxius executables no estan marcats per l&rsquo;extensi&oacute; .exe, sin&oacute; que els marca l&rsquo;atribut del perm&iacute;s d&rsquo;execuci&oacute;.<br /> <br /> <br /> X Window<br /> <br /> X Window &eacute;s l&rsquo;entorn gr&agrave;fic habitual dels sistemes Unix. El sistema X Window es composa de dues parts principals, el servidor X i el programa encarregat de la gesti&oacute; de les finestres. El servidor X &eacute;s el programa que s&rsquo;encarrega de dibuixar les finestres, per contra, el gestor de finestres s&rsquo;encarrega de crear-les i gestionar la seva aparen&ccedil;a. Els dos gestors m&eacute;s coneguts s&oacute;n GNOME i KDE.<br /> <br /> GNOME<br /> <br /> Quan Ubuntu arrenca en mode gr&agrave;fic apareix una finestra similar a aquesta :<br /> <br /> figura1<br /> En aquesta finestra hi introdu&iuml;m el nostre nom d&rsquo;usuari, premem [enter], introdu&iuml;m la nostra contrasenya i tornem a pr&eacute;mer [enter]. D&rsquo;aquesta manera s&rsquo;iniciar&agrave; la nostra sessi&oacute;, ens apareixer&agrave; una finestreta que ens carregar&agrave; GNOME i quan aquesta desapareix ja haurem entrat oficialment en la nostre sessi&oacute;.<br /> Hi ha un seguit d&rsquo;opcions en la primera pantalla que tot seguit comentarem:<br /> Sessi&oacute;: permet a l&rsquo;usuari seleccionar l&rsquo;entorn gr&agrave;fic en cas de haver-hi m&eacute;s. En ser Ubuntu, l&rsquo;&uacute;nic disponible &eacute;s GNOME.<br /> Llengua: ens permet escollir la llengua en que volem que estigui el nostre entorn<br /> Torna a arrencar: arrenca de nou l&rsquo;ordinador<br /> Atura: Apaga l&rsquo;ordinador<br /> <br /> <br /> figura 2<br /> <br /> Com es pot observar en la figura 2, aquest entorn &eacute;s molt similar a Windows, per tant ens resulta molt familiar. Els nous entorns gr&agrave;fics estan dissenyats per a la utilitzaci&oacute; del ratol&iacute;, per tant hi ha icones, men&uacute;s, una barra superior amb enlla&ccedil;os, ...<br /> Si premem el bot&oacute; [Ordinador] ens mostrar&agrave; un men&uacute; especialitzat a administrar el sistema.<br /> Hi podem trobar la Carpeta personal, una carpeta amb tots els Discs, la opci&oacute; de sortir del sistema on diu Surt, Configuraci&oacute; de xarxa ...<br /> Per a veure els programes disponibles hem de fer clic sobre [Aplicacions] i aix&ograve; ens mostrar&agrave; tots els programes disponibles ordenats segons categories.<br /> Les aplicacions incloses amb Ubuntu, entre d&rsquo;altres, s&oacute;n:<br /> <br /> Editor de text (gedit): Aquest &eacute;s l&rsquo;editor per defecte de GNOME i &eacute;s molt senzill d&rsquo;utilitzar. <br /> Suport per fer i desfer<br /> Suport per imprimir i veure pr&egrave;vies d&rsquo;impressi&oacute;<br /> Capacitat de tallar, copiar i enganxar.<br /> Cerca i reempla&ccedil;a l&iacute;nies<br /> Colors modulables segons el llenguatge utilitzat (C, C++, Java, HTML, XML, Python, Perl, etc.)  <br /> <br /> <br /> Gestor de fitxers (File roller)<br /> Creaci&oacute; i modificaci&oacute; d&rsquo;arxius<br /> Visualitzaci&oacute; del contingut d&rsquo;arxius<br /> Extracci&oacute; d&rsquo;arxius<br /> File Roller &eacute;s nom&eacute;s un front-end (una interf&iacute;cie gr&agrave;fica) per arxivar programes com tar o zip. Els tipus suportats s&oacute;n<br /> Arxius Tar descomprimits (.tar) o comprimits amb:<br /> gzip (.tar.gz , .tgz) <br /> bzip (.tar.bz , .tbz) <br /> bzip2 (.tar.bz2 , .tbz2) <br /> compress  (.tar.Z , .taz)<br /> lzop (.tar.lzo , .tzo) <br /> Arxius Zip (.zip) <br /> Arxius Jar  (.jar , .ear , .war)<br /> Arxius Lha  (.lzh) <br /> Arxius Rar (.rar) <br /> <br /> <br /> <br /> El GIMP (GNU Image Manipulation Program) <br /> Aquest programa te tantes possibilitats, que pot ser utilitzat com a un simple programa de pintura o com a un programa de retoc de fotografies expert. Els formats suportats s&oacute;n bmp, gif, jpeg, mng, pcx, pdf, png, ps, psd, tiff, tga, xpm, &hellip;<br /> Cada dia s&rsquo;expansiona gr&agrave;cies a nous connectors i altres coses que el complementen.<br /> <br /> <br /> gThumb<br /> <br /> Aquest programa &eacute;s el gestor d&rsquo;imatges m&eacute;s utilitzat a l&rsquo;entorn GNOME, ja que &eacute;s capa&ccedil; de:<br /> Visualitzar imatges en formats bmp, jpeg, gif, png, tiff, ico, xpm. I moure-les a gust i fins i tot posar-les en mode de pantalla sencera.<br /> Buscar imatges i organitzar-les<br /> Tamb&eacute; te instruments per a la modificaci&oacute; d&rsquo;imatges.<br /> <br /> <br /> <br /> Evolution	<br /> Aquest programa ens permetr&agrave; administrar el nostre correu.<br /> Inclou un cercador de missatges i un calendari per a la nostre comoditat, a m&eacute;s a m&eacute;s d&rsquo;augmentar la nostres seguretat mitjan&ccedil;ant noves maneres de visualitzaci&oacute; de correu.<br /> <br /> <br /> Gaim<br /> Gaim &eacute;s un programa de missatgeria que accepta diferents protocols: AIM, ICQ, MSN messenger, Yahoo!, IRC, Jabber, Gadu-Gadu, SILC, GroupWise Messenger i xarxes Zephyr.<br /> Es pot connectar simult&agrave;niament a totes aquestes xarxes.<br /> <br /> Gnomemeeting								<br /> Amb aquest programa ens podrem comunicar mitjan&ccedil;ant Webcam<br /> <br /> <br /> Mozillla Firefox<br /> &Eacute;s un cercador petit, r&agrave;pid, f&agrave;cil d&rsquo;utilitzar, que disposa de moltes extensions per millorar-lo. A m&eacute;s a m&eacute;s, te :<br /> Alta seguretat<br /> Opci&oacute; de buscar mitjan&ccedil;ant Tabs (pestanyes)<br /> Bloquejador de Pop-ups<br /> Integraci&oacute; amb Google i molts altres cercadors.<br /> <br /> <br /> <br /> Xchat								<br /> Xchat &eacute;s un client d&rsquo;IRC (Internet Relay Chat) que utilitza el sistema X Window.<br /> <br /> <br /> Totem									<br /> Totem &eacute;s un reproductor de pel&middot;l&iacute;cules per a l&rsquo;escriptori GNOME, basat en Xine. Accepta la selecci&oacute; de peces i es mou sobre tot a trav&eacute;s del teclat.<br /> <br /> <br /> Extractor de CD (sound juicer)<br /> Aquesta aplicaci&oacute; ens permetr&agrave; extreure pistes d&rsquo;un CD<br /> <br /> OpenOffice						<br /> Es tracta d&#39;un producte molt complet que cont&eacute;, de forma integrada, un processador de texts, un gestor de fulls de c&agrave;lcul, diverses eines per a la creaci&oacute; i edici&oacute; de presentacions, dibuixos vectorials, gr&agrave;fics i f&oacute;rmules, i diverses utilitats de conversi&oacute; de fitxers (entre d&#39;altres, els formats de Microsoft Office).<br /> <br /> Synaptic<br /> Synaptic &eacute;s front-end per administrar els paquets del nostre sistema amb les mateixes caracter&iacute;stiques que apt.<br /> Ens permet cercar, obtenir informaci&oacute; d&rsquo;un paquet amb nom&eacute;s un clic, administrar els dip&ograve;sits (sources.list), etc.<br /> Aquest programa &eacute;s molt &uacute;til per actualitzar el nostre sistema, ja que es capa&ccedil; de descarregar les noves versions dels programes i instal&middot;lar-les.<br /> http://www.nongnu.org/synaptic/index.html<br /> <br /> <br /> Altres aplicacions que poden ser instal&middot;lades:<br /> Xine<br /> Reproductor d&rsquo;arxius multim&egrave;dia en general<br /> Te&rsquo;l pots baixar des de xine.sourceforge.net o de qualsevol servidor amb la comanda apt-get install xine-ui <br /> Xmms									<br /> Xmms &eacute;s un altre reproductor multim&egrave;dia per a sistemes UNIX. Xmms treballa amb X WIndow i pot reproduir MP3, WAV, i molts m&eacute;s amb els connectors. Mitjan&ccedil;ant un altre connector, xmms &eacute;s capa&ccedil; de reproduir v&iacute;deo de manera molt rudiment&agrave;ria.<br />  L&rsquo;est&egrave;tica del reproductor est&agrave; clarament basada en el seu equivalent a Windows, Winamp<br /> www.xmms.org<br />  <br /> <br /> Apache Http Server<br /> <br /> El servidor http d&rsquo;Apache &eacute;s un dels m&eacute;s utilitzats arreu del m&oacute;n, concretament un 67% de la xarxa l&rsquo;utilitzava a l&rsquo;any 2004. Aquest servidor intenta ser una implementaci&oacute; del dimoni http gratu&iuml;ta.<br /> www.apache.org<br /> <br /> <br /> Adaptaci&oacute;<br /> <br /> Intercanviar fitxers.<br /> Podem afirmar que Linux pot llegir casi tots els fitxers procedents de Windows, pel que fa a l&rsquo;escriptori. Gr&agrave;cies a Nautilus, el explorador de fitxers per defecte de GNOME, podrem obrir diferents aplicacions per llegir els diferents tipus de fitxers.<br /> Per poder obrir tota la documentaci&oacute; en format PDF, disposem de Acrobat PDF (www.adobe.com) com a lector propi.<br /> Abans els fitxers de text pla eren tractats de diferents formes segons l&rsquo;editor. Avui dia, aix&ograve; no passa, gr&agrave;cies a gedit (GNOME) o Notepad i Wordpad (WINDOWS).<br /> Qualsevol usuari de WinZip o WinRAR sentir&agrave; la mateixa sensaci&oacute; utilitzant File-Roller, un compressor/descompressor gr&agrave;fic integrat a Nautilus.<br /> &Eacute;s molt m&eacute;s simple que els programes de Windows, ja que &eacute;s capa&ccedil; de manipular tan fitxers t&iacute;pics de Linux (TAR, GZIP) com de Windows (lha, zip, rar, war, arj, &hellip;)<br /> <br /> Copiar i esborrar fitxers de forma senzilla<br /> Avui dia, per copiar, moure, esborrar o reanomenar fitxers no &eacute;s necessari ser un expert en la consola. Ubuntu disposa de Nautilus, que &eacute;s un administrador de fitxers equivalent a Internet Explorer. Les operacions habituals estan disponibles mitjan&ccedil;ant icones i men&uacute;s. Ens permet vistes preliminars d&rsquo;alguns arxius (imatges, text pla), aix&iacute; com l&rsquo;execuci&oacute; directe mitjan&ccedil;ant el doble clic. Disposa de moltes alternatives, com tot el programari de GNU.<br /> <br /> Multim&egrave;dia<br /> El nostre escriptori disposa de suport per a visualitzar tants formats d&rsquo;imatge com es puguin imaginar (JPEG, GIF, TIFF, PNG, BMP, &hellip;) i a m&eacute;s a m&eacute;s ve integrat amb Nautilus, visualitzant-los en miniatura.<br /> Hi ha un seguit d&rsquo;aplicacions com Eye of Gnome que ens permetr&agrave; observar la imatge amb m&eacute;s detall, gThumb que ens permet fer el mateix, per&ograve; hi afegeix la possibilitat de poder navegar per la carpeta d&rsquo;una manera intu&iuml;tiva.<br /> Per a la creaci&oacute; d&rsquo;imatges senzilles disposem de gpaint, un cl&ograve;nic del Paint de Microsoft. Per&ograve; tamb&eacute; disposem de programari capa&ccedil; de fer retoc fotogr&agrave;fic professional, amb multitud de filtres i possibilitats de retallat intel&middot;ligent d&rsquo;imatges i contorns anomenat The GIMP.<br /> Per escoltar m&uacute;sica disposem de XMMS, un programa molt similar a WinAmp, que ens permet escoltar tot tipus de fitxers d&rsquo;&agrave;udio (mp3, wma, &hellip;), disposa de equalitzador i selecci&oacute; a l&rsquo;atzar de pistes. Si es vol extreure pistes d&rsquo;un CD, podem utilitzar Sound Juicer.<br /> Totem, ens permetr&agrave; visualitzar els nous formats de v&iacute;deo comprimit com DivX, XviD i MPEG. Tamb&eacute; podrem visualitzar DVD, VCD (V&iacute;deo CD), &hellip;<br /> Per a les connexions de punt a punt entre WebCam tenim el cl&ograve;nic de NetMeeting, l&rsquo;anomenat GnomeMeeting, amb les mateixes funcionalitats.<br /> <br /> Eines Ofim&agrave;tiques.<br /> S&rsquo;ha realitzat un esfor&ccedil; molt gran per part de tots els programadors i ara disposem de programes totalment compatibles amb els formats de Windows. (GNumeric, KOffice i AbiWord), per&ograve; tamb&eacute; disposem d&rsquo;una suite molt m&eacute;s coneguda i avan&ccedil;ada, aquesta s&rsquo;anomena OpenOffice.org<br /> Disposa de compatibilitat amb documents creats per MSOffice, des de la versi&oacute; del 3.11 fins a la versi&oacute; XP. Malgrat tot, encara no disposa d&rsquo;una eina semblant a Access.<br /> Una de les grans caracter&iacute;stiques que ens ofereix OpenOffice.org &eacute;s que pot ser executat a tots dos sistemes operatius d&rsquo;una manera similar. <br /> Un altre gran caracter&iacute;stica &eacute;s la capacitat de convertir els documents que editi, amb aix&ograve; vull dir que si nosaltres fem un document en format OpenOffice.org (.sxw) el podem passar a format .doc, de manera que qualsevol usuari de MSOffice el podr&agrave; llegir.<br /> A m&eacute;s a m&eacute;s, gr&agrave;cies a la utilitzaci&oacute; de XML, els documents ocupen molt poc, no com els documents de Word que a vegades ocupen un espai desmesurat. Tamb&eacute; s&rsquo;aconsegueix m&eacute;s estabilitat al sistema, fent possible l&rsquo;administraci&oacute; de documents gegants.<br /> Disposem de cinc aplicacions en aquesta suite:<br /> Writer: Ens permet importar documents escrits amb MSWord, WordPerfect i formats RTF. Aquestes importacions poden sortir defectuoses si s&rsquo;han utilitzat caracter&iacute;stiques molt espec&iacute;fiques, per&ograve; amb uns lleugers canvis no es notar&agrave;. La seva forma d&rsquo;utilitzaci&oacute; &eacute;s molt similar a MSWord, encara que els men&uacute;s estan m&eacute;s ben ordenats. Disposa de corrector ortogr&agrave;fic, acc&eacute;s a bases de dades, es capa&ccedil; de generar documents PDF, es capa&ccedil; d&rsquo;editar documents HTML, &hellip;<br /> HTML editor: incl&ograve;s  dins el Writer.<br /> Calc: Si es coneixen les f&oacute;rmules i macroinstruccions de MSExcel, no hi haur&agrave; cap problema amb aquest programa, ja que es un cl&ograve;nic.<br /> Impress: &eacute;s l&rsquo;equivalent a MSPowerPoint (&uacute;s de plantilles, animacions d&rsquo;elements, tipus d&rsquo;elements gr&agrave;fics disponibles, &uacute;s de botons amb accions associades a la presentaci&oacute;, transici&oacute; de diapositives, vista a pantalla completa) i a m&eacute;s a m&eacute;s es fa ideal per a treballar amb presentacions de 20 o 30 MB.<br /> Draw: programa de dibuix vectorial<br /> Navegar per Internet<br /> Les possibilitats de Linux a Internet s&oacute;n molt poderoses i a m&eacute;s a m&eacute;s ja no fa falta ser un expert en sistemes per dominar-lo.<br /> Disposem Suites com Mozilla, que ens ofereix una interf&iacute;cie molt similar a Netscape Navigator i es troba totalment tradu&iuml;t a l&#39;espanyol, s&oacute;n per tant una bona eina de migraci&oacute;. Aquest navegador disposa de marcadors per a guardar les adreces preferides, perfils per guardar les prefer&egrave;ncies particulars de cada usuari que utilitzi el mateix sistema, botons de navegaci&oacute; intu&iuml;tius, barra de direccions, bloqueig de finestres emergents, suport per a l&#39;&uacute;s de signatura digital i molts m&eacute;s. Com a caracter&iacute;stica distintiva, cal destacar l&#39;&uacute;s de &ldquo;Tabs&rdquo; o solapes, que ens permeten navegar per diferents Webs a la mateixa finestra mitjan&ccedil;ant separadors.<br /> El client de correu i not&iacute;cies Mozilla Mail ens permet descarregar les nostres b&uacute;sties i organitzar la informaci&oacute; c&ograve;modament en carpetes. Disposa de filtres per als missatges entrants i ens permet importar el correu que tenim a Netscape Communicator 4.x<br /> Mozilla Composer &eacute;s l&#39;editor de p&agrave;gines web. Ens permet crear p&agrave;gines sense necessitat de gaires coneixements de codi HTML.<br /> Per als usuaris de MSN Messenger tamb&eacute; disposen del seu cl&ograve;nic, AMSN (alvaro&#39;s MSN)<br /> Evolution, ens permet tenir organitzat el correu en safates d&#39;entrada i sortida, gestiona calendari i que tot aix&ograve; estigui en una barra vertical al costat esquerre fa que sembli una c&ograve;pia de MSOutlook.<br /> <br /> <br /> INT&Egrave;RPRET D&#39;ORDRES<br /> <br /> Fins al moment hem estat comentant l&rsquo;entorn gr&agrave;fic, per&ograve; d&rsquo;una forma o d&rsquo;una altra, l&rsquo;usuari s&rsquo;haur&agrave; de relacionar en el mode text. Aix&ograve; es basa en l&rsquo;execuci&oacute; d&rsquo;una s&egrave;rie de comandes, que son interpretades per un programa o int&egrave;rpret d&#39;ordres (shell). Linux disposa de varis programes d&#39;interpretaci&oacute; d&#39;ordres, per&ograve; el m&eacute;s conegut i utilitzat &eacute;s Bash (Bourne Again Shell).<br /> L&rsquo;usuari root ha desaparegut en la nostra distribuci&oacute; per defecte, per tant, per executar aplicacions que necessitin del perm&iacute;s de root, haurem d&rsquo;introduir la comanda sudo seguida de la comanda que s&rsquo;havia d&rsquo;executar. Aquest ens demanar&agrave; la contrasenya d&rsquo;usuari i ja ho podrem executar.<br /> Ex. sudo mkdir /apache [per crear una carpeta anomenada &ldquo;apache&rdquo; al directori arrel. Una vegada introdu&iuml;t ens demanar&agrave; la contrasenya]<br /> Mitjan&ccedil;ant la comanda sudo &ndash;s aconseguirem que totes les comandes posteriors a aquesta s&rsquo;executin com a root.<br /> <br /> Una forma d&rsquo;executar un int&egrave;rpret d&#39;ordres a Ubuntu, &eacute;s entrant al men&uacute; [Aplicacions], [Sistema], [Terminal].<br /> Una vegada fet aix&ograve;, ens permetr&agrave; inserir comandes al sistema.<br /> <br /> Son necess&agrave;ries una s&egrave;rie de nocions b&agrave;siques que cal tenir en compte a l&rsquo;hora d&rsquo;introduir comandes:<br /> Les comandes s&rsquo;han de teclejar amb precisi&oacute;. <br /> Les lletres maj&uacute;scules i min&uacute;scules es consideren diferents. <br /> Normalment el sistema operatiu utilitza un signe de $ per a indicar que esta preparat per a rebre comandes, en cas de ser root, aquest es substitueix per un #.<br /> Quan sigui necessari introduir el nom d&rsquo;un fitxer o directori, Linux ens permet escriure les primeres lletres d&rsquo;aquest i realitza un completat autom&agrave;tic en si es prem la tecla [TAB]. Si no es pot distingir entre diversos fitxers, aquest completar&agrave; el nom fins al punt en que siguin diferents.<br /> Suposem que tenim una carpeta amb el seg&uuml;ents arxius<br /> Cartes.txt<br /> Deures_de_filo.txt<br /> Deures_de_grec.txt<br /> Si escrivim cat C[tab]aquest omplir&agrave; la resta del contingut fins a escriure Cartes.txt. En canvi, en escriure cat D[tab], aquest nom&eacute;s omplir&agrave; fins Deures_de_<br /> <br /> Algunes comandes.<br /> <br /> date			Mostra a la pantalla l&rsquo;hora i el dia.<br /> cal 1975		Mostra el calendari de l&rsquo;any 1975.<br /> cal 05 1975 	Mostra el calendari del mes de maig del 1975.<br /> who	Indica quins usuaris estan al sistema en aquest moment, en quin terminal i des de quina hora.<br /> man [comanda] Mostra un manual de la comanda sol&middot;licitada, ja que Linux cont&eacute; molts manuals de les seves aplicacions. Amb aquesta comanda ens apareixer&agrave; una nova pantalla que es pot navegar amb els cursors del teclat i prement q per a sortir.<br /> clear	Aquesta comanda neteja la consola.<br /> <br /> <br /> Llistar el contingut del directoris: comanda ls (list)<br /> Aquesta comanda ens permet obtenir informaci&oacute; del contingut dels directoris.<br /> ls 			Mostra els noms del fitxers i subdirectoris del directori actual.<br /> ls &ndash;a 			Mostra tots els fitxers, incloent els ocults.<br /> ls &ndash;l			Mostra informaci&oacute; detallada de cada fitxer.<br /> ls [directori]		Mostra el contingut del directori.<br /> ls *.gif		Mostra tots els fitxers amb l&rsquo;extensi&oacute; .gif.<br /> <br /> Creaci&oacute; de subdirectoris: comanda mkdir (make directory)<br /> Aquesta comanda ens permet crear subdirectoris (make directory)<br /> mkdir cartes  [crea un subdirectori anomenat cartes]<br /> <br /> Supressi&oacute; de subdirectoris: comanda rmdir (remove directory)	<br /> Aquesta comanda ens permet suprimir directoris, sempre i quan estiguin buits.<br /> rmdir cartes[borra el subdirectori abans creat]  (remove directory)<br /> <br /> Canvi de directori: comanda cd<br /> Aquesta comanda ens permet canviar de directori.<br /> cd /home/fran/ 	Aquesta comanda ens portaria al directori /home/fran/<br /> cd ..	Ens fa retrocedir un nivell, si est&agrave;vem a /home/fran/, ens situar&agrave; a /home/<br /> cd			Ens fa retornar al nostre directori personal (/home/fran/)<br /> <br /> Situaci&oacute; actual: comanda pwd (print working directory)<br /> Aquesta comanda ens permet visualitzar la ruta cap al nostre directori<br /> pwd			en el cas d&rsquo;estar al directori personal mostraria /home/fran/<br /> <br /> Acc&eacute;s a unitats de disc: comanda mount<br /> A difer&egrave;ncia de Windows, no s&rsquo;utilitzen lletres (&ldquo;a:&rdquo;, &ldquo;c:&rdquo;, ...). Per a poder accedir al contingut d&rsquo;una unitat de disc, aquesta ha d&rsquo;haver estat &ldquo;muntada&rdquo;. El muntat es realitza mitjan&ccedil;ant la comanda mount. <br /> mount &ndash;t iso9660 /dev/cdrom /mnt/cdrom <br /> on &ndash;t iso9660 indica el tipus de sistema que utilitza la unitat (iso9660 per CD-Rom, fat32 o ntfs en el cas de Windows i ext2 en cas de Linux), /dev/cdrom/ indica el dispositiu que es muntar&agrave;. Tots els dispositius estan representats per un fitxer al directori /dev, per exemple, en cas de disquet aquest estar&agrave; representat per /dev/fd0, i per &uacute;ltim /mnt/cdrom, &eacute;s el directori on es volen muntar els arxius.<br /> Les noves distribucions ja no exigeixen aquesta gran comanda, amb un mount /mnt/floppy, seria suficient.<br /> Per a desmuntar &eacute;s el mateix proc&eacute;s substituint el mount  per umount.<br /> <br /> Copia de fitxers: comanda cp (copy)<br /> Aquesta comanda serveix per copiar arxius d&rsquo;un directori a un altre o al mateix.<br /> cp arxiu1 arxiu2	Aquesta comanda copia l&rsquo;arxiu1 anomenant-lo arxiu2 al mateix directori.<br /> cp /home/fran/arxiu1 /home/tr/ Aquesta copia l&rsquo;arxiu1 del directori /home/fran/ al directori /home/tr/<br /> <br /> Moure fitxers: comanda mv (move)<br /> mv /home/fran/arxiu1 /home/tr/ Aquesta comanda mou l&rsquo;arxiu1 al directori personal de TR, no deixa rastre a /home/fran/   <br /> Esborrar fitxers: comanda rm (remove)<br /> rm /home/fran/arxiu1 /home/tr/arxiu1 Esborra els arxius &ldquo;arxiu1&rdquo; de cada directori<br /> rm &ndash;i arxiu1 Amb aquesta comanda ens preguntaria si realment volem esborrar.<br /> rm * 	           Amb aquesta comanda es borra tot el contingut del directori.<br /> <br /> Espai ocupat: comanda du <br /> du &ndash;h 		Aquesta comanda ens donar&agrave; l&rsquo;espai ocupat en bytes<br /> <br /> Visualitzaci&oacute; sense format de fitxers: comanda cat, head, tail,<br /> Cat/head/tail arxiu1		Mostren tot/principi/final del fitxer seleccionat<br /> <br /> Comanda tar i bunzip2<br /> Moltes vegades ens descarregarem arxius en format tar.gz o tar.bz2, formats que serveixen per a unir molts fitxers en un de sol, com la compressi&oacute; a Windows.<br /> Desempaquetar .tar.gz<br /> Tar &ndash;zxvf arxiu.tar.gz 	Aquesta comanda desempaqueta l&rsquo;arxiu anomenat arxiu.tar.gz i el desa a la mateixa carpeta.<br /> Desempaquetar .tar.bz2<br /> Tar &ndash;xvfj arxiu.tar.bz2 	 <br /> <br /> La comanda tar &ndash;cvf nomdelarxiu.tar arxius_inclos1 arxiu_inclos2 ... crea un arxiu anomenat &ldquo;nomdelarxiu.tar&rdquo; amb tots els arxius que hem incl&ograve;s. Es podria utilitzar gzip nomdelarxiu.tar per a comprimir l&rsquo;arxiu &ldquo;nomdelarxiu.tar&rdquo; deixant-lo com a &ldquo;nomdelarxiu.tar.gz&rdquo;.<br /> <br /> Comandes sobre programes<br /> Xchat  &amp; 	Aquesta comanda executa el programa xchat en segon pla<br /> Fg 1		Portaria el programa xchat a primer pla<br /> Bg 1 		Posa el programa xchat en segon pla<br /> <br /> Actualitzant aplicacions: comanda apt-get<br /> Apt &eacute;s una aplicaci&oacute; que consulta un servidors pr&egrave;viament assignats a sources.list i en descarrega l&rsquo;aplicaci&oacute; assignada.<br /> Apt-get install apache  Aquesta comanda instal&middot;la l&rsquo;&uacute;ltima versi&oacute; de apache al nostre <br /> sistema.<br /> Apt-get remove apache Aquesta comanda desinstal&middot;la apache.<br /> <br /> <br /> Projecte Web.<br /> Instal&middot;laci&oacute; d&rsquo;Apache<br /> <br /> El servidor d&rsquo;http Apache &eacute;s molt f&agrave;cil d&rsquo;instal&middot;lar, tant f&agrave;cil com escriure apt-get install apache en un int&egrave;rpret d&#39;ordres i esperar uns minuts a que acabi d&rsquo;instal&middot;lar-se.<br /> Aquest programa ens descarrega l&rsquo;arxiu instal&middot;lable del que li proposem i en la seva ultima versi&oacute; disponible o estable segons els servidors triats en l&rsquo;edici&oacute; de sources.list<br /> Una vegada instal&middot;lat, el nostre servidor web s&rsquo;iniciar&agrave; cada cop que connectem l&rsquo;ordinador i nom&eacute;s s&rsquo;haur&agrave; d&rsquo;editar el fitxer de configuraci&oacute; situat a /etc/httpd.conf<br /> En aquest fitxer hem d&rsquo;editar els seg&uuml;ents par&agrave;metres:<br /> - DocumentRoot &ldquo;/var/www/&rdquo; Directori de la p&agrave;gina web<br /> - ServerName &ldquo;localhost&rdquo; Nom del servidor &ldquo;grap.mine.nu&rdquo;<br /> La configuraci&oacute; per defecte ens permetr&agrave; veure la nostre p&agrave;gina web sense necessitat d&rsquo;estar connectats.<br /> Per &uacute;ltim hem de col&middot;locar la nostra p&agrave;gina web, amb extensi&oacute; html, al directori /var/www/ i comprovar el nostre resultat escrivint a qualsevol navegador http://localhost:80<br /> <br /> Contractaci&oacute; del domini.<br /> Si volgu&eacute;ssim entrar a la nostre p&agrave;gina web des d&rsquo;una altre m&agrave;quina o Internet, no ens serviria escriure http://localhost:80 , si no que haur&iacute;em d&rsquo;escriure la nostre IP de la seg&uuml;ent manera http://xxx.xxx.xxx.xxx:80. Per exemple : http://192.12.214.2<br /> Aquest seguit de n&uacute;meros &eacute;s molt dif&iacute;cil d&rsquo;aprendre (m&eacute;s encara si la nostra connexi&oacute; te IP din&agrave;mica, que canvia cada cop que iniciem la connexi&oacute;), per tant es poden contractar dominis lliures a www.mine.nu acabats en .mine.nu o .homelinux.net/com/org:<br /> Els dominis contractats s&oacute;n<br /> grap.mine.nu (servidor windows)<br /> grap.homelinux.net (servidor Ubuntu)<br /> grap.homelinux.com (servidor Ubuntu)<br /> grap.homelinux.org (servidor Ubuntu)<br /> Cada cop que una connexi&oacute; s&rsquo;inicia, hem d&rsquo;anar a la p&agrave;gina web www.mine.nu per a retocar els n&uacute;meros de la IP antiga per la IP actual en cas de connexi&oacute; d&rsquo;ip din&agrave;mica, en cas de ser est&agrave;tica no ens faria falta aquest proc&eacute;s. D&rsquo;aquesta manera cada cop que escrivim http://grap.mine.nu ens adre&ccedil;ar&agrave; a http://192.12.214.2<br /> <br /> La resta de llocs web estan tots basades en el mateix estil, taules centrades amb el contingut, per tant no hi ha gaire secret.<br /> <br /> Espai Web<br /> Gr&agrave;cies a l&rsquo;adquisici&oacute; de la l&iacute;nia ADSL hem van regalar 50 MB d&rsquo;espai Web a Telefonica sense cap tipus de publicitat. Per tant, podem pujar una copia de la nostre web, per tal de que quan el nostre ordinador no estigui connectat, la p&agrave;gina estigui disponible.<br /> Mitjan&ccedil;ant el protocol ftp (indicat per Telefonica), entrem al seu servidor (ftp.telefonica.net) i hi allotgem la nostra plana. El seu nom real seria http://personal.telefonica.terra.es/web/grapp/ per&ograve; poca gent recordar&agrave; aquest nom.<br /> Com a possible soluci&oacute; existeixen serveis gratu&iuml;ts de redirecci&oacute; com el domini .tk o el domini .es.vg entre d&rsquo;altres que s&oacute;n molt &uacute;tils.<br /> De manera que si ens dirigim a www.dot.tk i ens registrem, podrem aconseguir el nom que vulguem (mentre estigui lliure). I si anem a http://www.dominios.es.vg/ i fem el mateix procediment, les nostres adreces podran ser ben recordades ja que els noms seran relativament curts.<br /> www.grapp.tk<br /> www.grapp.es.vg<br /> <br /> <br /> <br /> Conclusi&oacute;<br /> Aquest treball ens ha demostrat que Linux no &eacute;s un sistema que requereixi cert grau de coneixement, que qualsevol persona pot fer-lo servir sense cap problema i a sobre no &eacute;s dif&iacute;cil d&rsquo;aconseguir, ja que &eacute;s gratu&iuml;t.<br /> Linux ens proporciona estabilitat al sistema (per molt que les aplicacions es bloquegin, no fa falta tornar iniciar el sistema al complet), una seguretat perfecta que permet personalitzar completament el codi per si es vol adaptar a les pr&ograve;pies necessitats.<br /> Pel que fa a les aplicacions trobem que la majoria de programes per Windows tenen una alternativa en Linux, moltes vegades calcada. Podrem desenvolupar les mateixes tasques a ambd&oacute;s sistemes, de manera que no es notar&agrave; la difer&egrave;ncia en el resultat.<br /> Tenim la certesa de que molts virus que ens espanten per la televisi&oacute;, no ens afectaran, ja que la majoria funcionen nom&eacute;s sota Windows.<br /> Si que &eacute;s cert que molt maquinari no &eacute;s totalment funcional, per&ograve; aix&ograve; es solucionar&agrave; amb el temps. Tamb&eacute; es provocat per les companyies, les quals eliminen funcions d&rsquo;aquests per estalviar diners i creen els controladors que supleixen les funcions per a un sol sistema operatiu, Windows.<br /> En conclusi&oacute;, &eacute;s una bona alternativa que cal provar, experimentar i explicar-ho als companys per a que cada dia hi hagi m&eacute;s usuaris i possibles col&middot;laboradors que ajudaran en la creaci&oacute; de Linux.<br /> <br /> Documents<br /> FERNICHE BRITO, Diego: &ldquo;Como hacer que convivan Linux y Windows&rdquo;, PC World.<br /> N&ordm; 210. Juny 2004. p&agrave;g. 69-79. <br /> <br /> GARC&Iacute;A DE JAL&Oacute;N, Javier/AGUINAGA, Iker/ MORA, Alberto: Aprenda Linux como si estuviera en primero. Gener 2002<br /> <br /> MARTINEZ, Rafael: El rinc&oacute;n de Linux. rafael@usit.uio.no . 2004.<br /> <br /> TEIJEIRO OTERO, MARIO/ CONSTANTINO, MANUEL / ROMERO IGLESIAS, SANTIAGO: FAQ sobre linux para principiantes. asimovi@teleline.es/ constan@bart.us.es / santiago.romero@iname.com . 02 Juny 1999<br /> <br /> HASAN, Ragib: History of Linux. ragibhasan@yahoo.com. 2004.<br /> <br /> STALLMAN, Richard: Llic&egrave;ncia p&uacute;blica general de GNU. 1991<br />  <br /> PETERSEN, Richard: Fundamentos de programaci&oacute;n en Linux. 2001<br /> <br /> <br /> Enlla&ccedil;os<br /> <br /> www.catux.org<br /> www.gnu.org<br /> www.redhat.com<br /> http://fedora.redhat.com<br /> www.debian.org<br /> www.suse.com<br /> www.gentoo.org<br /> www.mandrakelinux.com<br /> www.knoppix.org<br /> www.linex.org<br /> www.guadalinex.org<br /> http://www.tecnocampus.com/catix/index.html<br /> www.ubuntulinux.org<br /> www.apache.org<br /> http://es.tldp.org<br /> www.osdir.com<br /> www.gnome.org/projects/gedit<br /> fileroller.sourceforge.net/<br /> www.gimp.org<br /> gthumb.sourceforge.net<br /> http://www.novell.com/es-es/products/desktop/features/evolution.html<br /> gaim.sourceforge.net<br /> www.gnomemeeting.org/<br /> http://www.mozilla.org/products/firefox/<br /> http://www.xchat.org/<br /> http://www.hadess.net/totem.php3<br /> http://www.burtonini.com/blog/computers/sound-juicer<br /> www.openoffice.org<br /> http://www.nongnu.org/synaptic/index.html<br /> xine.sourceforge.net<br /> www.xmms.org<br /> www.softcatala.org<br /> <br /> Annex<br /> <br /> <br /> LLIC&Egrave;NCIA P&Uacute;BLICA GENERAL DE GNU<br /> <br /> Versi&oacute; 2, Juny de 1991 <br /> Copyright (C) 1989, 1991 Free Software Foundation, Inc.  <br /> 59 Temple Place - Suite 330, Boston, MA  02111-1307, USA<br /> <br /> Es permet que tothom faci c&ograve;pies literals d&#39;aquest document de llic&egrave;ncia i les distribueixi, per&ograve; no &eacute;s perm&egrave;s modificar-lo.<br /> <br /> Pre&agrave;mbul<br /> Les llic&egrave;ncies de la major part de programari estan pensades per prendre-us la llibertat de compartir-lo i modificar-lo. Contr&agrave;riament, la Llic&egrave;ncia p&uacute;blica general de GNU pret&eacute;n garantir-vos la llibertat de compartir i modificar el programari lliure -- assegurar-se que el programari sigui lliure per a tots els seus usuaris i usu&agrave;ries. Aquesta Llic&egrave;ncia p&uacute;blica general de GNU afecta la majoria del programari de la Free Software Foundation (fundaci&oacute; pel programari lliure) i a qualsevol altre programa els autors o autores del qual decideixin usar-la (algun altre programari de la Free Software Foundation, en canvi, est&agrave; protegit per la Llic&egrave;ncia p&uacute;blica general per a biblioteques de GNU [NdeT: aquesta llic&egrave;ncia, la LGPL, &eacute;s la que actualment la FSF anomena Llic&egrave;ncia p&uacute;blica menys general]). Tamb&eacute; podeu aplicar-la als vostres programes. <br /> Quan parlem de programari lliure (free software) ens referim a la llibertat, no al preu [NdeT: en catal&agrave; no hi ha l&#39;ambig&uuml;itat que hi ha en angl&egrave;s]. Les nostres llic&egrave;ncies p&uacute;bliques generals estan pensades per assegurar que tingueu la llibertat de distribuir c&ograve;pies del programari lliure (i cobrar per aquest servei si aix&iacute; ho voleu), que rebeu el codi font o que el pugueu rebre si el voleu, que pugueu modificar el programari o fer-ne servir parts en programes lliures nous; i que sapigueu que podeu fer aquestes coses. <br /> Per protegir els vostres drets, hem d&#39;imposar restriccions que prohibeixin a tothom denegar-vos aquests drets o demanar-vos que hi renuncieu. Aquestes restriccions suposen algunes responsabilitats per a v&oacute;s si distribu&iuml;u c&ograve;pies del programari o si el modifiqueu. <br /> Per exemple, si distribu&iuml;u c&ograve;pies d&#39;un aquests programes, tant si &eacute;s de franc com per un preu, heu de donar als destinataris els mateixos drets que teniu v&oacute;s. Us heu d&#39;assegurar que tamb&eacute; ells rebin o puguin obtenir el codi font. I els heu de fer saber aquests termes per tal que coneguin els seus drets. <br /> Protegim els vostres drets en dos passos: (1) Ens reservem el copyright del programari, i (2) us oferim aquesta llic&egrave;ncia que us d&oacute;na perm&iacute;s legal per copiar, distribuir i/o modificar el programari. <br /> A m&eacute;s a m&eacute;s, per protegir-nos i protegir l&#39;autor o autora, volem estar segurs que tothom ent&eacute;n que no hi ha cap garantia per a aquest programari lliure. Si alg&uacute; modifica el programari i el passa, volem que els destinataris s&agrave;piguen que el que tenen no &eacute;s l&#39;original, per tal que qualsevol problema que haguessin pogut introduir terceres persones no repercuteixi en la reputaci&oacute; de l&#39;autor o autora original. <br /> Finalment, qualsevol programa lliure est&agrave; constantment amena&ccedil;at per les patents de programari. Volem evitar el perill de que els redistribu&iuml;dors d&#39;un programa lliure acabin obtenint llic&egrave;ncies de patents, i de resultes el programa esdevingui propietat exclusiva d&#39;alg&uacute;. Per evitar-ho, he deixat clar que de qualsevol patent se n&#39;han d&#39;emetre llic&egrave;ncies per a tothom o no emetre&#39;n cap. <br /> Les condicions exactes per a la c&ograve;pia, distribuci&oacute; i modificaci&oacute; s&oacute;n les seg&uuml;ents. <br /> <br /> TERMES I CONDICIONS PER A LA C&Ograve;PIA, DISTRIBUCI&Oacute; I MODIFICACI&Oacute;<br /> <br /> 0. Aquesta llic&egrave;ncia afecta a qualsevol programa o altra obra que contingui un av&iacute;s del posse&iuml;dor del copyright que digui que es pot distribuir sota els termes d&#39;aquesta llic&egrave;ncia p&uacute;blica general. D&#39;ara endavant, el &quot;programa&quot; es refereix a aquest programa o obra, i una &quot;obra basada en el programa&quot; voldr&agrave; dir el programa o qualsevol obra derivada segons la llei de copyright: &eacute;s a dir una obra que contingui el programa o alguna part d&#39;ell, ja sigui literalment o amb modificacions o b&eacute; tradu&iuml;t a altres lleng&uuml;es. (Per aix&ograve; mateix, les traduccions s&#39;inclouen sense cap limitaci&oacute; en el terme &quot;modificaci&oacute;&quot;). Ens referim a Cada beneficiari de la llic&egrave;ncia com a &quot;v&oacute;s&quot;. <br /> Les activitats que no siguin c&ograve;pia, distribuci&oacute; o modificaci&oacute; no estan contemplades en aquesta llic&egrave;ncia, queden fora del seu &agrave;mbit. No es restringeix l&#39;acte d&#39;executar el programa, i la sortida del programa queda contemplada nom&eacute;s si el seu contingut constitueix una obra basada en el programa (independentment de que s&#39;hagi creat executant el programa). Que aquest sigui el cas o no depen de qu&egrave; faci el programa. <br /> <br /> 1. Podeu copiar i distribuir c&ograve;pies literals del codi font del programa tal i com el rebeu, en qualsevol mitj&agrave;, sempre i quan publiqueu en cada c&ograve;pia, de manera adient i ben visible, una nota de copyright i una ren&uacute;ncia de garantia; manteniu intactes tots els avisos que fan refer&egrave;ncia a aquesta llic&egrave;ncia i a l&#39;abs&egrave;ncia de garanties de cap mena; i lliureu a qualsevol altre destinatari del programa una c&ograve;pia d&#39;aquesta llic&egrave;ncia juntament amb el programa. <br /> Podeu cobrar un preu per l&#39;acte f&iacute;sic de trametre una c&ograve;pia i podeu, si aix&iacute; ho voleu, oferir alguna garantia a canvi d&#39;un preu. <br /> <br /> 2. Podeu modificar la c&ograve;pia o c&ograve;pies del programa o qualsevol tros, tot fornint una obra basada en el programa, i podeu copiar i distribuir aquestes modificacions o obres sota els termes de la Secci&oacute; 1 anterior, sempre i quan tamb&eacute; compliu les seg&uuml;ents condicions: <br /> <br /> a) Heu de fer que els fitxers modificats portin indicacions ben visibles que diguin que heu modificat els fitxers i la data de la modificaci&oacute;. <br /> <br /> b) Heu d&#39;atorgar gratu&iuml;tament a totes les terceres parts els termes d&#39;aquesta mateixa llic&egrave;ncia sobre la totalitat de qualsevol obra que distribu&iuml;u o publiqueu, que completament o en part contingui o sigui un derivat del programa o qualsevol part d&#39;aquest. <br /> <br /> c) Si el programa modificat normalment llegeix instruccions interactivament quan s&#39;executa, heu de fer que quan s&#39;arrenqui per a aquest &uacute;s interactiu de la manera m&eacute;s habitual, imprimeixi o mostri un missatge que inclogui una nota de copyright adient i un av&iacute;s de que no hi ha garantia (o, si de cas, que digui que la garantia l&#39;oferiu v&oacute;s mateix) i que els usuaris poden redistribuir el programa sota aquestes condicions, i que indiqui a l&#39;usuari o usu&agrave;ria com veure una c&ograve;pia d&#39;aquesta llic&egrave;ncia. (Excepci&oacute;: si el mateix programa &eacute;s interactiu per&ograve; normalment no escriu un missatge d&#39;aquesta mena, la vostra obra basada en el programa tampoc cal que l&#39;escrigui). <br /> Aquests requeriments afecten a l&#39;obra modificada com un tot. Si hi ha parts identificables que no estan derivades del programa, i es poden considerar raonablement com a obres independents i separades en si mateixes, aleshores aquesta llic&egrave;ncia i els seus termes no s&#39;apliquen a aquelles parts quan les distribu&iuml;u com a obres separades. Per&ograve; quan distribu&iuml;u aquestes mateixes parts integrades en un tot que sigui una obra basada en el programa, la distribuci&oacute; del tot s&#39;ha de fer d&#39;acord amb els termes d&#39;aquesta llic&egrave;ncia, i els permisos atorgats a altres beneficiaris abasten el tot sencer i, per tant, totes i cadascuna de les parts, independentment de qui les hagi escrites.. <br /> Aix&iacute; doncs, la intenci&oacute; d&#39;aquesta secci&oacute; no &eacute;s reclamar o disputar-vos cap dret a codi que hagueu escrit del tot v&oacute;s mateix. La intenci&oacute; &eacute;s m&eacute;s aviat exercir el dret a controlar la distribuci&oacute; d&#39;obres derivades o col&middot;lectives basades en el programa. <br /> A m&eacute;s a m&eacute;s, la simple agregaci&oacute; amb el programa (o amb una obra basada en el programa) d&#39;altres obres no basades en el programa en un volum d&#39;un mitj&agrave; d&#39;emmagatzemament o de distribuci&oacute; no posa aquestes altres obres sota l&#39;&agrave;mbit de la llic&egrave;ncia. <br /> <br /> 3. Podeu copiar i distribuir el programa (o una obra basada en el programa, segons la secci&oacute; 2) en forma executable o de codi objecte d&#39;acord amb els termes de les Seccions 1 i 2 anteriors, sempre i quan tamb&eacute; feu una de les coses seg&uuml;ents: <br /> <br /> a) L&#39;acompanyeu amb el codi font complet corresponent, capa&ccedil; de ser llegit per un ordinador i en un mitj&agrave; utilitzat habitualment per a l&#39;intercanvi de programari; o <br /> <br /> b) L&#39;acompanyeu amb un oferiment per escrit, amb validesa com a m&iacute;nim fins al cap de tres anys, de subministrar a tota tercera part, i per un preu no superior al que us costi f&iacute;sicament realitzar la distribuci&oacute;, el codi font complet corresponent, que es distribuir&agrave; d&#39;acord amb els termes de les seccions 1 i 2 anteriors en un mitj&agrave; utilitzat habitualment per a l&#39;intercanvi de programari; o, <br /> <br /> c) L&#39;acompanyeu amb la informaci&oacute; que hagueu rebut de l&#39;oferiment de distribuir el codi font corresponent (Aquesta alternativa nom&eacute;s &eacute;s permesa per a la distribuci&oacute; no comercial i nom&eacute;s si heu rebut el programa en forma executable o de codi objecte amb aquest oferiment, d&#39;acord amb la subsecci&oacute; b anterior). <br /> El codi font per a una obra vol dir la forma preferida de l&#39;obra per tal de fer-hi modificacions. Per una obra executable, el codi font complet vol dir tot el codi font per tots els m&ograve;duls que cont&eacute;, m&eacute;s tots els fitxers de definici&oacute; d&#39;interf&iacute;cies associats si s&#39;escau, m&eacute;s les seq&uuml;&egrave;ncies que es facin servir per controlar la compilaci&oacute; i la instal&middot;laci&oacute; de l&#39;executable si s&#39;escau. Tanmateix, fent una excepci&oacute; especial, el codi font que es distribueixi no cal que inclogui res del que normalment es distribueixi (sia en forma bin&agrave;ria o de codi font) amb els components principals (compilador, nucli o similars) del sistema operatiu en qu&egrave; s&#39;executa el programa, tret que el component en q&uuml;esti&oacute; acompanyi l&#39;executable. <br /> Si la distribuci&oacute; de l&#39;executable consisteix en donar acc&eacute;s per copiar-lo d&#39;un lloc determinat, aleshores serveix com a distribuci&oacute; del codi font el fet de donar un acc&eacute;s equivalent per copiar el codi font, encara que les terceres parts no estiguin obligades a copiar el codi font en copiar el codi objecte. <br /> <br /> 4. No podeu copiar, modificar, reemetre llic&egrave;ncies, o distribuir el programa si no &eacute;s de la forma expressa que atorga aquesta Llic&egrave;ncia. Qualsevol altre intent de copiar, modificar, reemetre llic&egrave;ncies, o distribuir el programa &eacute;s il&middot;l&iacute;cit i finalitzar&agrave; autom&agrave;ticament els drets que hagueu obtingut d&#39;aquesta llic&egrave;ncia. Tanmateix, les parts que hagin rebut de v&oacute;s c&ograve;pies o drets d&#39;acord amb aquesta llic&egrave;ncia no veuran les seves llic&egrave;ncies finalitzades mentre segueixin observant-les estrictament. <br /> <br /> 5. No esteu obligat a acceptar aquesta llic&egrave;ncia, donat que no l&#39;heu signada. Tanmateix, no hi ha cap altra opci&oacute; que us doni perm&iacute;s per modificar o distribuir el programa o les seves obres derivades. Aquestes accions queden prohibides per la llei si no accepteu aquesta llic&egrave;ncia. Aix&iacute; doncs, en modificar o distribuir el programa o les seves obres derivades, esteu indicant que accepteu aquesta llic&egrave;ncia per fer-ho, i tots els seus termes i condicions per copiar, distribuir o modificar el programa o obres basades en ell. <br /> <br /> 6. Cada cop que distribu&iuml;u el programa (o qualsevol obra basada en el programa), el destinatari rep autom&agrave;ticament, de qui va emetre la llic&egrave;ncia origin&agrave;riament, una llic&egrave;ncia per copiar, distribuir o modificar el programa sotmesa a aquests termes i condicions. No podeu imposar cap m&eacute;s restricci&oacute; a l&#39;exercici dels drets que aqu&iacute; es confereixen. No sou responsable de fer complir aquesta llic&egrave;ncia a terceres parts. <br /> <br /> 7. Si, a conseq&uuml;&egrave;ncia d&#39;una decisi&oacute; judicial, una demanda per infracci&oacute; d&#39;una patent o per qualsevol altra ra&oacute; (no exclusivament relacionada amb patents), se us imposen condicions (tant si &eacute;s per ordre judicial, acord, o el que sigui) que contradiuen les condicions d&#39;aquesta llic&egrave;ncia, no quedeu excusat de les condicions d&#39;aquesta llic&egrave;ncia. Si no us &eacute;s possible distribuir de manera que satisfeu alhora les obligacions que us imposa aquesta llic&egrave;ncia i qualsevol altra obligaci&oacute; pertinent, aleshores resulta que no podeu distribuir el programa en absolut. Per exemple, si una llic&egrave;ncia de patent no permet&eacute;s redistribuir gratu&iuml;tament el programa a aquells que hagin rebut c&ograve;pies de v&oacute;s directament o indirecta, aleshores la &uacute;nica manera en qu&egrave; podr&iacute;eu satisfer tant aix&ograve; com aquesta llic&egrave;ncia seria abstenir-vos completament de distribuir el programa. <br /> Si qualsevol fragment d&#39;aquesta secci&oacute; qued&eacute;s invalidat o no es pogu&eacute;s fer complir en qualsevol circumst&agrave;ncia particular, la intenci&oacute; &eacute;s que s&#39;apliqui el balan&ccedil; de la secci&oacute;, i que s&#39;apliqui la secci&oacute; en la seva totalitat en altres circumst&agrave;ncies. <br /> El prop&ograve;sit d&#39;aquesta secci&oacute; no &eacute;s induir-vos a infringir cap patent ni cap altre requeriment del dret a la propietat, o a discutir-ne la validesa; l&#39;&uacute;nic prop&ograve;sit d&#39;aquesta secci&oacute; &eacute;s protegir la integritat del sistema de distribuci&oacute; de programari lliure, que s&#39;implementa amb pr&agrave;ctiques de llic&egrave;ncia p&uacute;blica. Molta gent ha fet generoses contribucions a l&#39;ampli ventall de programari distribu&iuml;t per aquest sistema refiant-se de l&#39;aplicaci&oacute; consistent del sistema; li pertoca a l&#39;autor, autora o donant decidir si vol distribuir programari per algun altre sistema, i un beneficiari de la llic&egrave;ncia no pot imposar aquesta opci&oacute;. <br /> Aquesta secci&oacute; pret&eacute;n deixar del tot clar el que es considera una conseq&uuml;&egrave;ncia de la resta de la llic&egrave;ncia. <br /> <br /> 8. Si hi ha paisos que restringeixen la distribuci&oacute; o l&#39;&uacute;s del programari, ja sigui per patents o per interf&iacute;cies sota copyright, el posse&iuml;dor del copyright original que posi el programa sota aquesta llic&egrave;ncia pot afegir limitacions geogr&agrave;fiques expl&iacute;cites que excloguin aquests paisos, de manera que la distribuci&oacute; nom&eacute;s quedi permesa dintre dels paisos no exclosos, o entre ells. En tal cas, aquesta llic&egrave;ncia incorpora la limitaci&oacute; com si estigu&eacute;s escrita en el text de la llic&egrave;ncia. <br /> <br /> 9. La Free Software Foundation (Fundaci&oacute; per al programari lliure) pot publicar versions revisades o noves de la llic&egrave;ncia p&uacute;blica general de tant en tant. Aquestes versions noves seran semblants en esperit a la versi&oacute; present, per&ograve; poden diferir en detalls per tractar nous neguits o problemes. <br /> Cada versi&oacute; rep un n&uacute;mero de versi&oacute; distintiu. Si el programa especifica un n&uacute;mero de versi&oacute; d&#39;aquesta llic&egrave;ncia que li &eacute;s aplicable i &quot;qualsevol versi&oacute; posterior&quot;, teniu l&#39;opci&oacute; de seguir els termes i condicions de la versi&oacute; especificada o de qualsevol versi&oacute; publicada posteriorment per la Free programari Foundation. Si el programa no especifica un n&uacute;mero de versi&oacute; d&#39;aquesta llic&egrave;ncia, podeu triar qualsevol versi&oacute; que hagi publicat la Free programari Foundation en qualsevol data. <br /> <br /> 10. Si voleu incorporar parts del programa en altres programes lliures les condicions de distribuci&oacute; dels quals s&oacute;n diferents, escriviu a l&#39;autor per demanar-li perm&iacute;s. Per al programari que est&agrave; sota copyright de la Free programari Foundation, escriviu a la Free programari Foundation; de vegades fem excepcions per permetre-ho. Prendrem la nostra decisi&oacute; guiats pels dos objectius de mantenir la condici&oacute; de lliure de tots els derivats del nostre programari lliure i de promoure la compartici&oacute; i la reutilitzaci&oacute; del programari en general. <br /> <br /> ABS&Egrave;NCIA DE GARANTIES <br /> <br /> 11. COM QUE LA LLIC&Egrave;NCIA DEL PROGRAMA &Eacute;S GRATU&Iuml;TA, NO HI HA GARANTIA PER AL PROGRAMA, EN LA MESURA QUE HO PERMETI LA LLEI APLICABLE. EXCEPTE EL QUE ALTRAMENT ES DIGUI PER ESCRIT, ELS POSSE&Iuml;DORS DEL COPYRIGHT I/O ALTRES PARTS SUBMINISTREN EL PROGRAMA &quot;TAL QUAL&quot; SENSE CAP MENA DE GARANTIA, NI EXPL&Iacute;CITA NI IMPL&Iacute;CITA, INCLOSES, ENTRE ALTRES, LES GARANTIES IMPL&Iacute;CITES DE COMERCIALITZABILITAT I APTITUD PER A PROP&Ograve;SITS DETERMINATS. TOT EL RISC PEL QUE FA A LA QUALITAT I RENDIMENT DEL PROGRAMA &Eacute;S VOSTRE. EN CAS QUE EL PROGRAMA RESULT&Eacute;S DEFECTU&Oacute;S, V&Oacute;S ASSUMIU TOT EL COST D&#39;ASSIST&Egrave;NCIA, REPARACI&Oacute; O CORRECCI&Oacute;. <br /> <br /> 12. EL POSSE&Iuml;DOR DEL COPYRIGHT, O QUALSEVOL ALTRA PART QUE PUGUI MODIFICAR O REDISTRIBUIR EL PROGRAMA TAL I COM ES PERMET M&Eacute;S AMUNT NO US HAUR&Agrave; DE RESPONDRE EN CAP CAS, TRET DEL QUE REQUEREIXI LA LLEI APLICABLE O ELS ACORDS PER ESCRIT, PER PERJUDICIS, INCLOSOS ELS INCIDENTALS, DERIVATS, ESPECIALS O GENERALS QUE ES DERIVIN DE L&#39;&Uacute;S O DE LA IMPOSSIBILITAT D&#39;&Uacute;S DEL PROGRAMA (INCLOSES ENTRE D&#39;ALTRES LES P&Egrave;RDUES DE DADES, LES DADES QUE EL PROGRAMA HAGI MALM&Egrave;S, LES P&Egrave;RDUES QUE US HAGI PROVOCAT A V&Oacute;S O A TERCERS O LA IMPOSSIBILITAT DE QUE EL PROGRAMA FUNCIONI AMB QUALSEVOL ALTRE PROGRAMA), FINS I TOT SI AQUEST POSSE&Iuml;DOR O ALTRA PART HA ESTAT ADVERTIDA DE LA POSSIBILITAT D&#39;AQUESTS PERJUDICIS. <br /> <br /> FINAL DELS TERMES I CONDICIONS<br /> <br /> Com podeu aplicar aquests termes als vostres programes nous<br /> Si desenvolupeu un programa nou, i voleu que tingui l&#39;&uacute;s m&eacute;s gran possible per part del p&uacute;blic, la millor manera d&#39;aconseguir-ho &eacute;s fer-lo programari lliure que tothom podr&agrave; redistribuir i modificar d&#39;acord amb aquests termes. <br /> Per fer-ho, afegiu els avisos seg&uuml;ents al programa. El m&eacute;s segur &eacute;s posar-los al comen&ccedil;ament de cada fitxer font per transmetre de la manera m&eacute;s efectiva l&#39;exclusi&oacute; de garanties; i cada fitxer hauria de portar com a m&iacute;nim la l&iacute;nia de &quot;copyright&quot; i un apuntador que indiqui on es pot trobar la nota sencera. <br /> Una l&iacute;nia amb el nom del programa i una idea de qu&egrave; fa.<br /> Copyright (C) any  nom de l&#39;autor o autora<br /> <br /> Aquest programa &eacute;s lliure; el podeu redistribuir i/o modificar<br />  d&#39;acord amb els termes de la Llic&egrave;ncia p&uacute;blica general de GNU tal <br />  i com la publica la Free programari Foundation; tant se val la versi&oacute; 2<br />  de la Llic&egrave;ncia com (si ho preferiu) qualsevol versi&oacute; posterior.<br /> <br /> <br /> Aquest programa es distribueix amb l&#39;esperan&ccedil;a que ser&agrave; &uacute;til, <br /> per&ograve; SENSE CAP GARANTIA; ni tant sols amb la garantia de <br /> COMERCIALITZABILITAT O APTITUD PER A PROP&Ograve;SITS DETERMINATS.  Vegeu<br /> la Llic&egrave;ncia general p&uacute;blica de GNU per a m&eacute;s detalls. <br /> <br /> <br /> Haur&iacute;eu d&#39;haver rebut una c&ograve;pia de la llic&egrave;ncia p&uacute;blica general <br /> de GNU amb aquest programa; si no, escriviu a la Free programari <br /> Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA  02111-1307, USA.<br /> Poseu-hi la informaci&oacute; que calgui per contactar amb v&oacute;s per correu electr&ograve;nic i de paper. <br /> Si el programa &eacute;s interactiu, feu-lo treure una breu nota com aquesta quan arrenca en mode interactiu: <br /> Gnomovisi&oacute; versi&oacute; 69, Copyright (C) any nom de l&#39;autor o autora<br /> El Gnomovisi&oacute; va SENSE CAP MENA DE GARANTIA; premeu &#39;mostra g&#39; per saber-ne <br /> els detalls.  Aix&ograve; &eacute;s programari lliure, i se us convida a redistribuir-lo<br /> d&#39;acord amb certes condicions; piqueu &#39;mostra c&#39; per saber-ne els detalls.<br /> Les instruccions hipot&egrave;tiques &#39;mostra g&#39; i &#39;mostra c&#39; haurien de mostrar les parts escaients de la llic&egrave;ncia p&uacute;blica general. Naturalment, les instruccions poden tenir altres noms que no siguin &#39;mostra g&#39; i &#39;mostra c&#39;; fins i tot podrien ser pics amb el ratol&iacute; o opcions de men&uacute;, o el que li vagi b&eacute; al vostre programa. <br /> Tamb&eacute; haur&iacute;eu d&#39;aconseguir que l&#39;empresari per qui treballeu (si treballeu de programador) o la vostra escola, si &eacute;s el cas, signin una &quot;ren&uacute;ncia de copyright&quot; pel programa, si s&#39;escau. Aqu&iacute; teniu un exemple, canvieu-hi els noms: <br /> Ioiodina, S.A. , per la present renuncia a tot inter&egrave;s <br /> en el copyright del programa `Gnomovisi&oacute;&#39; (que fa l&#39;aleta <br /> als compiladors) escrit   pel Jordi Pica Codi<br /> <br /> signat per Mag Nat, 28 de desembre de 1989<br /> Mag Nat, vicepresident<br /> Aquesta Llic&egrave;ncia p&uacute;blica general no us permet incorporar el vostre programa en programes de propietat. Si el vostre programa &eacute;s una biblioteca de subrutines, potser trobeu m&eacute;s &uacute;til permetre enlla&ccedil;ar (link) aplicacions de propietat amb la biblioteca. Si &eacute;s aix&ograve; el que voleu, feu servir la Llic&egrave;ncia p&uacute;blica general per a biblioteques de GNU per comptes d&#39;aquesta llic&egrave;ncia [NdeT: la FSF ara li diu llic&egrave;ncia p&uacute;blica menys general per comptes de llic&egrave;ncia p&uacute;blica general per a biblioteques]. </div>
    
            </p>

            <h3>
                Categories:
                
        Articles, Iniciació
    
            </h3>

            <hr />
            <h1>Comentaris</h1>
            <ul class="list-group">
                
        <li class="list-group-item comment">Re: Linux, el desconegut (treb Excel.lent i entenedora introducció al món Línux.

Quina creus que serà la distribució que implantarà el departament d'educació de la Generalitat de Catalunya? Segons el que em responguis, me la instal.laria. Apa-li. Gràcies i aDéu-Siau!<p class="comment-author">Escrit al 2006-12-29 01:18:59 per Anònim</p></li><li class="list-group-item comment">Re: Linux, el desconegut (treb Segons el meu punt de vista, la generalitat es capaç de crear-se una propia distribució, tal com han fet el govern extremeny, l'andalús, el valencià, ...<p class="comment-author">Escrit al 2006-12-29 01:21:09 per Anònim</p></li><li class="list-group-item comment">Re: Linux, el desconegut Això això, havent centenars de distribucions ja creades per què aprofitar-les i fer-ne ús quan es pot reinventar la roda i fer una altra distribució nova? En fi...<p class="comment-author">Escrit al 2006-12-29 01:22:23 per Anònim</p></li><li class="list-group-item comment">Re: Linux, el desconegut Dues coses:

1) tu has llegit l'anterior post? com et creus que ho va fer per exemple el govern andalús, va partir de debian! no et montis històries!

2) el treball pot ser consultat amb fotografies a http://www.telefonica.net/web2/franhp/linux.pdf<p class="comment-author">Escrit al 2006-12-29 01:23:03 per grap</p></li>
    
            </ul>


            <a href="http://catux.org/post_list.html">
                <i class="fas fa-chevron-left"></i>
                Arxius
            </a>
        </div>

    </div>


    </div> <!-- /.container -->

    <div class="container">
        <nav class="navbar navbar-inverse catux-footer">
            <p class="navbar-text">
                Tot el contingut de Catux està subjecte sota la nova versió de la llicència de
                <a href="http://creativecommons.org/licenses/by/2.5/es/deed.ca">Creative Commons</a>
            </p>
        </nav>
    </div>



</body>
</html>
