<!DOCTYPE html>
<html>
<head lang="cat">
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="description" content="Associació d'usuaris de GNU/Linux de la Catalunya Central">
    <meta name="keywords" content="gnu/linux, linux, programari lliure, gnu, lug, associacio, manresa, sant joan de vilatorrada, catalan, català, catalunya">
    <meta name="author" content="Catux">
    <link rel="icon" href="http://localhost:9000/images/favicon.ico">

    <title>Catux</title>

    <link rel="stylesheet" type="text/css" href="http://localhost:9000/css/main.css">
    <script src="http://localhost:9000/js/main.js"></script>
</head>
<body>
    <div class="navbar-wrapper">
        <div class="container">

            <nav class="navbar navbar-inverse">
                <div class="container">
                    <div class="navbar-header col-sm-5">
                        <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
                            <span class="sr-only">Toggle navigation</span>
                            <span class="icon-bar"></span>
                            <span class="icon-bar"></span>
                            <span class="icon-bar"></span>
                        </button>
                        <a href="http://localhost:9000/">
                            <img src="http://localhost:9000/images/catuxlogo.png" alt="Catux" width="40%"><br>
                            <div class="visible-lg"> Associació d'usuaris de GNU/Linux de la Catalunya Central</div>
                        </a>
                    </div>
                    <div id="navbar" class="navbar-collapse collapse navbar-links">
                        <ul class="nav navbar-nav navbar-right">
                            <li><a href="http://localhost:9000/post_list.html">Blog</a></li>
                            <li><a href="http://localhost:9000/traduccio.html">Traducció</a></li>
                        </ul>
                    </div>
                </div>
            </nav>
        </div>
    </div> <!-- /.navbar-wrapper -->

    <div class="container">
        
    <div class="container-fluid">

        <div class="post">
            <a href="http://localhost:9000/post_list.html">
                <i class="fas fa-chevron-left"></i>
                Arxius
            </a>

            <h1>
                
        Llançament de Firefox 1.5, ja en català!
    
            </h1>

            <h3>
                Escrit al
                
        2005-12-02 00:00:00
    
                per
                
        Pinucset
    
            </h3>

            <p>
                
        <span class="noticia">Avui dia 2-12-05, tres dies despr&eacute;s <a href="http://www.mozilla.com/press/mozilla-2005-11-29.html">que fos anunciada la nova versi&oacute; 1.5</a> del conegut navegador <a href="http://www.mozilla.com/">Firefox</a> en angl&egrave;s per part de la <a href="http://www.mozilla.org/">Mozilla Corporation</a>. Ha sortit el navegador en catal&agrave;, gr&agrave;cies a <a href="http://www.softcatala.org/">Softcatala</a> tal com anuncien <a href="http://www.softcatala.org/noticies/02122005344.htm">en aquesta not&iacute;cia</a>.<br /> <br /> Si ja teniu el Firefox insta lat en castell&agrave; o angl&egrave;s podeu baixar-vos <a href="http://www.softcatala.org/projectes/mozilla/#firefox">els paquets de catal&agrave;</a>, si en canvi encara no us heu actualitzat a la nova versi&oacute; us podeu descarregar el navegador <a href="http://www.mozilla.com/firefox/all.html">directament en catal&agrave; des del web oficial del projecte</a>.<br /> <br /> El llan&ccedil;ament d&#39;aquest navegador ha tingut molt&iacute;ssim &egrave;xit. Si amb la sortida del Firefox 1.0 i van haver 500.000 desc&agrave;rregues les primeres 24 hores amb aquesta nova versi&oacute; hi ha hagut un mili&oacute; de desc&agrave;rregues a les primeres 24 hores i dos milions a les 48 hores, tot un &egrave;xit!<br /> <br /> Tamb&eacute; &eacute;s interessant comentar que coincidint amb la sortida d&#39;aquest navegador, <a href="http://www.google.com/">Google</a> ja permet a trav&eacute;s del seu servei <a href="http://adsense.google.com/">Adsense</a> <a href="http://google.dirson.com/noticias.new/1991/"> anunciar Firefox al teu web</a> i rebre fins a un euro cada vegada que un usuari de Windows se&#39;l descarrega.<br /> <br /> El Firefox ha tingut <a href="http://www.mozilla.com/firefox/releases/1.5.html">interessants millores</a> (traducci&oacute; del changelog):<br /> <br /> <li>Actualitzacions autom&agrave;tiques: Quan surti una nova versi&oacute; no far&agrave; falta instal&middot;lar-la de nou, ella mateixa s&#39;actualitzar&agrave; respectant l&#39;idioma i les extensions.<br /> </li><li>Millores en els botons &#39;endavant&#39; i &#39;endarrere&#39;, de manera que s&oacute;n m&eacute;s r&agrave;pids.<br /> </li><li>Possibilitat d&#39;ordenar i moure les pestanyes.<br /> </li><li>Neteja de la informaci&oacute; personal amb un sol clic (webs visitades, desc&agrave;rregues...).<br /> </li><li>El cercador <a href="http://www.answers.com/">Answers.com</a> ha estat afegit als cercadors predeterminats.<br /> </li><li>Millores en la usabilitat: Errors descriptius, men&uacute; d&#39;opcions redissenyat i possibilitat d&#39;activar el &quot;mode m&eacute;s segur&quot;.<br /> </li><li>Millor accessibilitat: Lectors de pantalla per a discapacitats.<br /> </li><li>Possibilitat de reportar un web que no funciona.<br /> </li><li>Millor suport per a Mac OS X, amb una millor migraci&oacute; des de Safari i Mac Internet Explorer.<br /> </li><li>Suporta m&eacute;s est&agrave;ndards: SVG, CSS 2 i CSS 3, i JavaScript 1.6.<br /> </li><li>Moltes millores en la seguretat.<br /> <br /> Doncs b&eacute;, espero que fru&iuml;u amb el Panda Roig, ja que <a href="http://www.kriptopolis.org/node/1529">segons sembla</a> Firefox significa Panda Roig, no guineu!<br /> <br /> Molta sort!</li></span>
    
            </p>

            <h3>
                Categories:
                
        Notícies, Últimes notícies
    
            </h3>

            <hr />
            <h1>Comentaris</h1>
            <ul class="list-group">
                
        <li class="list-group-item comment">Re: Llançament de Firefox 1.5, 
Segons sembla a la Web de la Wikipedia, entrada Firefox potser no és cert lo de Kriptopolis del final de tot.

Copio-enganxo:

The Chinese word &#28779;&#29392; (fire fox) can refer to the Red Fox or the Red Panda. The latter meaning was popularized by a mistaken comment on a web page of the Wellington Zoo (sometimes quoted as the Bristol Zoo) and later by the Mozilla Foundation.


Per cert, que la nova versió de la guineu de foc o panda roig fa molt bona pinta! (vaig a actualitzar-me ara, que no he tingut temps...)<p class="comment-author">Escrit al 2006-12-29 15:41:36 per cpina</p></li><li class="list-group-item comment">Re: Llançament de Firefox 1.5, I a gnu/linux (i altres *nix) com es farà per les actualitzacions? Perquè els binaris no es poden tocar a no ser que siguis root...<p class="comment-author">Escrit al 2006-12-29 15:42:27 per Anònim</p></li><li class="list-group-item comment">Re: Llançament de Firefox 1.5, A l'anònim, jo per exemple en Linux a vegades per tenir l'última versió del Firefox l'instal·lo al meu home ($HOME/bin/firefox, per exemple) així que allà no hi haurà problemes en actualitzar (ho pot fer el meu usuari sense problemes).

Si està instal·lat al sistema i es necessita ser root ja malament per les actualitzacions automàtiques (a no ser que facin algun invent molt estrany :-) -no ho he mirat...)<p class="comment-author">Escrit al 2006-12-29 15:43:02 per cpina</p></li>
    
            </ul>


            <a href="http://localhost:9000/post_list.html">
                <i class="fas fa-chevron-left"></i>
                Arxius
            </a>
        </div>

    </div>


    </div> <!-- /.container -->

    <div class="container">
        <nav class="navbar navbar-inverse catux-footer">
            <p class="navbar-text">
                Tot el contingut de Catux està subjecte sota la nova versió de la llicència de
                <a href="http://creativecommons.org/licenses/by/2.5/es/deed.ca">Creative Commons</a>
            </p>
        </nav>
    </div>



</body>
</html>
