<!DOCTYPE html>
<html>
<head lang="cat">
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="description" content="Associació d'usuaris de GNU/Linux de la Catalunya Central">
    <meta name="keywords" content="gnu/linux, linux, programari lliure, gnu, lug, associacio, manresa, sant joan de vilatorrada, catalan, català, catalunya">
    <meta name="author" content="Catux">
    <link rel="icon" href="https://catux.org/images/favicon.ico">

    <title>Catux</title>

    <link rel="stylesheet" type="text/css" href="https://catux.org/css/main.css">
    <script src="https://catux.org/js/main.js"></script>
</head>
<body>
    <div class="navbar-wrapper">
        <div class="container">

            <nav class="navbar navbar-inverse">
                <div class="container">
                    <div class="navbar-header col-sm-5">
                        <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
                            <span class="sr-only">Toggle navigation</span>
                            <span class="icon-bar"></span>
                            <span class="icon-bar"></span>
                            <span class="icon-bar"></span>
                        </button>
                        <a href="https://catux.org/">
                            <img src="https://catux.org/images/catuxlogo.png" alt="Catux" width="40%"><br>
                            <div class="visible-lg"> Associació d'usuaris de GNU/Linux de la Catalunya Central</div>
                        </a>
                    </div>
                    <div id="navbar" class="navbar-collapse collapse navbar-links">
                        <ul class="nav navbar-nav navbar-right">
                            <li><a href="https://catux.org/post_list.html">Blog</a></li>
                            <li><a href="https://catux.org/traduccio.html">Traducció</a></li>
                            <li><a href="https://catux.org/contactar.html">Contactar</a></li>
                        </ul>
                    </div>
                </div>
            </nav>
        </div>
    </div> <!-- /.navbar-wrapper -->

    <div class="container">
        
    <div class="container-fluid">

        <div class="post">
            <a href="https://catux.org/post_list.html">
                <i class="fas fa-chevron-left"></i>
                Arxius
            </a>

            <h1>
                
        Manresa
    
            </h1>

            <h3>
                Escrit al
                
        2006-12-29 00:00:00
    
                per
                
        admin
    
            </h3>

            <p>
                
        <font size="2">Dediquem un humil apartat a la nostra ciutat, explicant part de la seva hist&ograve;ria, amb l&#39;objectiu de mostrar a la gent la bellesa interior de Manresa. A les l&iacute;nies inferiors s&#39;adjunta un text amb la seva hist&ograve;ria.</font><font size="2"><br />              <br /> Dins el terme de Manresa hi ha indicis de poblament neol&iacute;tic i d&#39;un poblat ib&egrave;ric al tur&oacute; del Puigcardaner.<br />             <br /> Per la seva part, els romans van batejar el primitiu nucli urb&agrave; amb el nom de Minorisa, origen del nom actual.<br />             <br /> Arrasada i abandonada per els musulmans en varies ocasions, la reconquesta definitiva de Manresa no es va produir fins a finals del segle IX, a mans del compte Guifr&eacute; el Pil&oacute;s (Wilfredo el Velloso).&nbsp; Al segle X va apar&egrave;ixer documentat per primera vegada el comptat de Manresa, que durant aquell segle i el seg&uuml;ent va desempenyar un paper primordial com avan&ccedil;ada cristiana a les terres interiors de Catalunya.<br />              <br /> El creixement de la ciutat medieval es va produir durant els segles XII i XIII<br />             <br /> Acabada la conquesta, Manresa va perdre el seu car&agrave;cter militar i va adquirir el de vila comercial i artesana, consolidant-se com a centre d&#39;un ampli territori circumdant.<br />             <br /> La primera meitat del segle XIV va ser la &egrave;poca daurada de la ciutat. Es van construir edificis com la Seu i fins a cinc esgl&eacute;sies m&eacute;s, que desapareixerien durant la Guerra Civil. Aix&iacute; mateix es van edificar diversos convents, tamb&eacute; desapareguts, i la important obra de la S&egrave;quia, que va portar aigua del Llobregat a la ciutat.<br />              <br /> El segle XV va ser un segle de guerres i de inestabilitat, per&ograve; el segle XVI es va produir un fet que projectaria Manresa per tot el m&oacute;n cristi&agrave;. L&#39;any 1522 va arribar a la ciutat San Ignasi de Loyola, i s&#39;hi va estar 9 mesos, durant els quals va tenir l&#39;experi&egrave;ncia m&iacute;stica que el portaria a la fundaci&oacute; de la Companyia de Jes&uacute;s.<br />             <br /> Als segles seg&uuml;ents, Manresa va haver de suportar les destruccions de guerres i epid&egrave;mies, i despr&eacute;s del Decret de Nova Planta (1714), la ciutat es va confirmar com la capital del corregiment de Manresa, que agrupava els territoris del Bages, Berga, el Llu&ccedil;an&egrave;s i el Moian&egrave;s.<br />              <br /> Al segle XIX es va iniciar amb el paper destacat de Manresa a la Guerra de la Independ&egrave;ncia, que li va valer els t&iacute;tols de &quot;molt noble i molt lleial&quot;. Finalitzada la guerra, la ciutat va emprendre el proc&eacute;s d&#39;industrialitzaci&oacute; i les modernes fabriques de teixits de cot&oacute; van substituir als tradicionals tallers de draps de llana i cintes.<br />             <br /> A partir d&#39;aquell moment, Manresa va definir el seu futur com una ciutat industrial, de primer ordre dins de Catalunya, amb un important pes social, econ&ograve;mic i pol&iacute;tic. Nom&eacute;s cal recordar les anomenades Bases de Manresa, redactades l&#39;any 1892, que van constituir el primer projecte constitucional catal&agrave; i van ser el punt de partida de l&#39;Estatut d&#39;Autonomia de 1979. Manresa &eacute;s un important nucli industrial amb empreses de diferents sectors. La tradicional ind&uacute;stria t&egrave;xtil, encara ben representada, fent pes davant la metal&middot;l&uacute;rgica i la qu&iacute;mica.<br />              <br />             </font><font size="2">Tanmateix, la seva condici&oacute; de capital comarcal i la seva excel&middot;lent situaci&oacute; en un encreuament natural de camins li proporcionen una din&agrave;mica comercial semblant a la de les capitals de prov&iacute;ncia catalanes, i compta, a m&eacute;s, amb un sector de serveis en expansi&oacute;.<br />             <br /> L&#39;agricultura i la ramaderia s&oacute;n activitats tradicionals que han quedat despla&ccedil;ades, mentre que el turisme va adquirint un cert pes. L&#39;anomenada fa&ccedil;ana monumental de Manresa t&eacute; com element destacat la Seu, el Pont Vell i la Santa Cova.<br />              <br /> La Seu de Manresa, el nom oficial de la qual &eacute;s el de col&middot;legiats - bas&iacute;lica de Santa Maria, es troba en el punt m&eacute;s alt de la ciutat, al cim del Puigcardaner i &eacute;s el primer que es veu en arribar a la ciutat. Es va construir entre els segles XIV i XV i constitueix un notable exemple d&#39;arquitectura g&ograve;tica catalana. En el seu interior podem veure el resultat de la s&iacute;ntesi entre les esgl&eacute;sies d&#39;una i tres naus, i posseeix una interessant mostra de pintura g&ograve;tica catalana.<br />             <br /> Al costat de la Seu es troba el palau de just&iacute;cia, que data del segle XVII i es un bonic exemple de la arquitectura civil barroca.<br />              <br /> El Pont Vell s&#39;al&ccedil;a sobre el riu Cardener. Es tracta de la reconstrucci&oacute; fidel d&#39;un pont medieval del segle XII, del que nom&eacute;s es conserven les bases del seu arc central. El pont, que va ser destru&iuml;t el 1939 i refet entre els anys 1960 i 1962, dibuixa vuit arcs de mig punt amb una al&ccedil;ada m&agrave;xima de 25 m sobre el cabal del riu.<br />             <br /> La Santa Cova es troba prop del pont. Segons explica la llegenda, un peregr&iacute; basc que es deia <em>I&ntilde;igo L&oacute;pez de Recalde</em>              <em>y Loyola </em>es va aturar en aquesta gruta per resar i fer penit&egrave;ncia, per&ograve; despr&eacute;s d&#39;un &egrave;xtasi m&iacute;stic, la va convertir en un lloc de recolliment i reflexi&oacute; durant la seva estada a Manresa.<br />             <br /> Dins la Cova se suposa que va escriure els famosos &quot;Exercicis espirituals&quot; i va tra&ccedil;ar els plans per la fundaci&oacute; de la Companyia de Jes&uacute;s. Despr&eacute;s de la canonitzaci&oacute; de San Ignasi de Loyola, la cova fou convertida en lloc de culte, i al segle XVIII s&#39;hi va construir una esgl&eacute;sia , que constitueix un dels millors exemples de la anomenada arquitectura r&uacute;stica jesu&iacute;tica. Al seu costat s&#39;aixeca el convent jesu&iuml;ta, obra de finals del segle XIX.<br />              <br /> El pou de la Gallina &eacute;s un altre dels llocs llegendaris de Manresa. Segons diu la tradici&oacute; popular, una nena va perdre la seva gallina en aquest pou, i per obra i gr&agrave;cia de San Ignasi de Loyola, va poder recuperar-la. Tocant al pou es troba la capella de Sant Ignasi del Pou, que commemora el miracle.<br />             <br /> S&oacute;n molts els racons i monuments arquitect&ograve;nics que mereixen una visita.<br />             <br /> Destaca principalment la pla&ccedil;a Major, presidida per l&#39;ajuntament, del segle XVIII; el bonic claustre g&ograve;tic del convent dels Caputxins, o els carrerons i placetes medievals del barri antic.<br />              <br /> Cal esmentar tamb&eacute; l&#39;antic monestir de Santa Clara, l&#39;hospital de Santa Ll&uacute;cia, que va acollir a San Ignasi i on va tenir lloc el seu c&egrave;lebre rapte i el Col&middot;legi de San Ignasi, declarat monument hist&ograve;ric - art&iacute;stic i actualment seu del Museu comarcal de Manresa.<br />             <br /> D&#39;altra banda, conv&eacute; visitar tamb&eacute; les cases Torrents i Lluvi&agrave;, i el quiosc Fius i Pal&agrave;, ambd&oacute;s modernistes; i els magatzems Jorba, potser l&#39;exemple m&eacute;s important de artdec&oacute; a Catalunya.<br />              <br /> Finalment, destaca el passeig de Pere III, inaugurat l&#39;any 1891 i on es concentren algunes de les millors construccions modernes, com el Casino i el Teatre Kursaal. Manresa, a pesar de ser una ciutat con un marcat car&agrave;cter industrial, encara mant&eacute; la seva tradici&oacute; agr&iacute;cola i ramadera.<br />             </font>
    
            </p>

            <h3>
                Categories:
                
        Els nostres pobles, Nosaltres
    
            </h3>

            <hr />
            <h1>Comentaris</h1>
            <ul class="list-group">
                
        <li class="list-group-item">Sense comentaris</li>
    
            </ul>


            <a href="https://catux.org/post_list.html">
                <i class="fas fa-chevron-left"></i>
                Arxius
            </a>
        </div>

    </div>


    </div> <!-- /.container -->

    <div class="container">
        <nav class="navbar navbar-inverse catux-footer">
            <p class="navbar-text">
                Tot el contingut de Catux està subjecte sota la nova versió de la llicència de
                <a href="http://creativecommons.org/licenses/by/2.5/es/deed.ca">Creative Commons</a>
            </p>
        </nav>
    </div>



</body>
</html>
