<!DOCTYPE html>
<html>
<head lang="cat">
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="description" content="Associació d'usuaris de GNU/Linux de la Catalunya Central">
    <meta name="keywords" content="gnu/linux, linux, programari lliure, gnu, lug, associacio, manresa, sant joan de vilatorrada, catalan, català, catalunya">
    <meta name="author" content="Catux">
    <link rel="icon" href="http://localhost:9000/images/favicon.ico">

    <title>Catux</title>

    <link rel="stylesheet" type="text/css" href="http://localhost:9000/css/main.css">
    <script src="http://localhost:9000/js/main.js"></script>
</head>
<body>
    <div class="navbar-wrapper">
        <div class="container">

            <nav class="navbar navbar-inverse">
                <div class="container">
                    <div class="navbar-header col-sm-5">
                        <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
                            <span class="sr-only">Toggle navigation</span>
                            <span class="icon-bar"></span>
                            <span class="icon-bar"></span>
                            <span class="icon-bar"></span>
                        </button>
                        <a href="http://localhost:9000/">
                            <img src="http://localhost:9000/images/catuxlogo.png" alt="Catux" width="40%"><br>
                            <div class="visible-lg"> Associació d'usuaris de GNU/Linux de la Catalunya Central</div>
                        </a>
                    </div>
                    <div id="navbar" class="navbar-collapse collapse navbar-links">
                        <ul class="nav navbar-nav navbar-right">
                            <li><a href="http://localhost:9000/post_list.html">Blog</a></li>
                            <li><a href="http://localhost:9000/traduccio.html">Traducció</a></li>
                        </ul>
                    </div>
                </div>
            </nav>
        </div>
    </div> <!-- /.navbar-wrapper -->

    <div class="container">
        
    <div class="container-fluid">

        <div class="post">
            <a href="http://localhost:9000/post_list.html">
                <i class="fas fa-chevron-left"></i>
                Arxius
            </a>

            <h1>
                
        Publicación de la nueva licencia de software libre: LPO.
    
            </h1>

            <h3>
                Escrit al
                
        2005-08-23 00:00:00
    
                per
                
        pepik
    
            </h3>

            <p>
                
        <span class="noticia"> El grupo de desarrollo del proyecto openXpertya acaba de publicar la licencia de software libre denominado Licencia P&uacute;blica openXpertya. (<a href="http://www.openxpertya.org/dmdocuments/LPO.pdf">LPO </a>)<br /> Esta licencia est&aacute; basada en la nueva licencia de software libre <a href="http://www.sun.com/cddl/">CDDL </a> (&quot; Common Development and Distribution License &quot;), un nuevo tipo de licencia desarrollada por SUN y presentada el 1 de Diciembre del 2.004, enviada&nbsp;al <a href="http://www.opensource.org/">OSI </a> el 14 de diciembre de 2004, y&nbsp;aprobada el pasado 14 de enero del 2.005. Esta es tambi&eacute;n la primera traducci&oacute;n legal al espa&ntilde;ol de la licencia <a href="http://www.sun.com/cddl/">CDDL</a>, adaptada a la legislaci&oacute;n al derecho espa&ntilde;ol y de la Uni&oacute;n Europea y la Licencia P&uacute;blica openXpertya (<a href="http://www.openxpertya.org/dmdocuments/LPO.pdf">LPO </a>) es la primera licencia espa&ntilde;ola de software libre que permite la mayor libertad posible de utilizaci&oacute;n al usario....<br /> &nbsp;<br /> &nbsp;<br /> <a href="http://www.sun.com/cddl/">CDDL </a> est&aacute; basada en la licencia <a href="http://www.sun.com/cddl/CDDL_why_summary.html">MPL 1.1 (Mozilla Public License)</a>, pero agrega ciertas condiciones no incluidas en la mayor&iacute;a de las licencias open source. Por ejemplo, <a href="http://www.sun.com/cddl/">CDDL </a> permite tener cualquier tipo c&oacute;digo dentro de la misma soluci&oacute;n. Usando terminolog&iacute;a de open source, <a href="http://www.sun.com/cddl/">CDDL </a> no es viral, como es el caso de la vieja licencia&nbsp; <a href="http://www.opensource.org/licenses/gpl-license.php">GPL </a> ( General Public License, 1991 ), y por lo tanto&nbsp;posibilita la inclusi&oacute;n de cualquier otro tipo de c&oacute;digo, sea cual sea la licencia del mismo, en la soluci&oacute;n&nbsp;completa ( la licencia <a href="http://www.opensource.org/licenses/gpl-license.php">GPL </a>  por ejemplo,&nbsp;est&aacute; fuertemente limitada, y s&oacute;lo permite el linkado con el propio c&oacute;digo <a href="http://www.opensource.org/licenses/gpl-license.php">GPL</a>, haciendo en la pr&aacute;ctica un monopolio por parte de la organizaci&oacute;n <a href="http://www.gnu.org/home.es.html">GNU</a> y la fundaci&oacute;n para el sofwtare libre). Adicionalmente la licencia <a href="http://www.sun.com/cddl/">CDDL</a> s&oacute;lo se adjudica a la totalidad del producto al que hace referencia y no a sus partes. Dichas partes podr&iacute;an estar bajo esta licencia o bajo cualquier otro tipo de licencia al extraerse del software original completo.<br /> El proyecto <a href="http://www.openxpertya.com/">openXpertya</a> adopta esta licencia <a href="http://www.openxpertya.org/dmdocuments/LPO.pdf">LPO</a> para posibilitar la inclusi&oacute;n y reutilizaci&oacute;n de software derivado o adaptado de otros proyectos, que de otra manera no podr&iacute;a ser utilizado junto. Esto posibilita la utilizaci&oacute;n del <a href="http://www.openxpertya.org/">ERP</a> con virtualmente cualquier otro c&oacute;digo o producto, cuya licencia no prohiba expresamente su utilizaci&oacute;n o linkado con c&oacute;digo de terceros. As&iacute; la licencia <a href="http://www.openxpertya.org/dmdocuments/LPO.pdf">LPO</a> est&aacute; formada por la propia licencia CDDL fielmente traducida y adaptada a la legislaci&oacute;n espa&ntilde;ola y un Addendum final haciendo referencia a las definiciones iniciales de dicha licencia en el caso del producto de software libre openXpertya. La licencia openXpertya posibilita adem&aacute;s expresamente el relicenciamiento bajo la licencia GNU <a href="http://www.gnu.org/copyleft/lesser.html">LGPL</a>, o en su lugar cualquier otra que respete las condiciones la propia licencia <a href="http://www.openxpertya.org/dmdocuments/LPO.pdf">LPO</a>; de aquellas partes del c&oacute;digo o librer&iacute;as extraidas del c&oacute;digo nuevo del proyecto openXpertya.<br /> La utilizaci&oacute;n de esta licencia <a href="http://www.openxpertya.org/dmdocuments/LPO.pdf">LPO</a> por parte del grupo de desarrollo de openXpertya es muy interesante, toda vez que la propia aplicaci&oacute;n openXpertya est&aacute; realizada en <a href="http://java.sun.com/">Java</a>, y <a href="http://www.sun.com/">SUN</a> planea utilizar la licencia CDDL original para el lanzamiento de pr&oacute;ximas versiones del entorno de desarrollo en Java, JDK; como ya hizo en el pasado liberando el sistema operativo Solaris. <br /> La licencia <a href="http://www.openxpertya.org/dmdocuments/LPO.pdf">LPO</a> est&aacute; abierta de manera que cualquier otro proyecto de software libre pueda utilizarla o usarla para crear su propia licencia, sabiendo en todo momento que los usuarios del c&oacute;digo licenciado dispondr&aacute; de la m&aacute;xima libertad posible en la utilizaci&oacute;n del software, actual y futura y que dicha licencia est&aacute; aprobada por la OSI. <br /> Las intenciones del grupo de desarrollo de openXpertya, que publica esta licencia son la libre utilizaci&oacute;n de la misma por parte de terceros y la cesi&oacute;n posterior de la custodia inicial de dicha licencia a una Fundaci&oacute;n que la promocione y la utilice en la creaci&oacute;n de software libre empresarial absolutamente libre, sin limitaciones de ning&uacute;n tipo en su utilizaci&oacute;n.<br /> La licencia <a href="http://www.openxpertya.org/dmdocuments/LPO.pdf">LPO</a> puede ser obtenida en la parte p&uacute;blica de la web del proyecto openXpertya: <a href="http://www.openxpertya.org/">http://www.openxpertya.org</a> en el apartado de <a href="http://www.openxpertya.org/documentacion/">documentaci&oacute;n</a>. Tambi&eacute;n es posible la discusi&oacute;n, observaciones y opniones en los foros del proyecto acerca de dicha licencia y obtener mayor informaci&oacute;n registr&aacute;ndose.<br /> <br /> M&aacute;s informaci&oacute;n y discusiones acerca de la Licencia P&uacute;blica openXpertya en <a href="http://www.openxpertya.org/">http://www.openxpertya.org</a> y <a href="http://www.openxpertya.com/">http://www.openxpertya.com</a> </span>
    
            </p>

            <h3>
                Categories:
                
        Notícies, Últimes notícies
    
            </h3>

            <hr />
            <h1>Comentaris</h1>
            <ul class="list-group">
                
        <li class="list-group-item">Sense comentaris</li>
    
            </ul>


            <a href="http://localhost:9000/post_list.html">
                <i class="fas fa-chevron-left"></i>
                Arxius
            </a>
        </div>

    </div>


    </div> <!-- /.container -->

    <div class="container">
        <nav class="navbar navbar-inverse catux-footer">
            <p class="navbar-text">
                Tot el contingut de Catux està subjecte sota la nova versió de la llicència de
                <a href="http://creativecommons.org/licenses/by/2.5/es/deed.ca">Creative Commons</a>
            </p>
        </nav>
    </div>



</body>
</html>
