<!DOCTYPE html>
<html>
<head lang="cat">
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="description" content="Associació d'usuaris de GNU/Linux de la Catalunya Central">
    <meta name="keywords" content="gnu/linux, linux, programari lliure, gnu, lug, associacio, manresa, sant joan de vilatorrada, catalan, català, catalunya">
    <meta name="author" content="Catux">
    <link rel="icon" href="https://catux.org/images/favicon.ico">

    <title>Catux</title>

    <link rel="stylesheet" type="text/css" href="https://catux.org/css/main.css">
    <script src="https://catux.org/js/main.js"></script>
</head>
<body>
    <div class="navbar-wrapper">
        <div class="container">

            <nav class="navbar navbar-inverse">
                <div class="container">
                    <div class="navbar-header col-sm-5">
                        <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
                            <span class="sr-only">Toggle navigation</span>
                            <span class="icon-bar"></span>
                            <span class="icon-bar"></span>
                            <span class="icon-bar"></span>
                        </button>
                        <a href="https://catux.org/">
                            <img src="https://catux.org/images/catuxlogo.png" alt="Catux" width="40%"><br>
                            <div class="visible-lg"> Associació d'usuaris de GNU/Linux de la Catalunya Central</div>
                        </a>
                    </div>
                    <div id="navbar" class="navbar-collapse collapse navbar-links">
                        <ul class="nav navbar-nav navbar-right">
                            <li><a href="https://catux.org/post_list.html">Blog</a></li>
                            <li><a href="https://catux.org/traduccio.html">Traducció</a></li>
                            <li><a href="https://catux.org/contactar.html">Contactar</a></li>
                        </ul>
                    </div>
                </div>
            </nav>
        </div>
    </div> <!-- /.navbar-wrapper -->

    <div class="container">
        
    <div class="container-fluid">

        <div class="post">
            <a href="https://catux.org/post_list.html">
                <i class="fas fa-chevron-left"></i>
                Arxius
            </a>

            <h1>
                
        Resposta a les inquietuds dels no iniciats a usar Programari Llliure
    
            </h1>

            <h3>
                Escrit al
                
        2005-11-15 00:00:00
    
                per
                
        cpina
    
            </h3>

            <p>
                
        <span class="noticia">Ara fa uns dies <a href="http://www.catux.org/index.php?contingut=articles&amp;num=94">vem publicar</a> el resultat de la &#39;din&agrave;mics dels postits&#39; que Catux va fer a Ripoll el dia 17 de Setembre.<br /> <br /> En aquell recull es veu els problemes, pors, inquitetuds que la gent t&eacute; respecte el Programari Lliure i GNU/Linux, i que vem comentar durant la din&agrave;mica.<br /> <br /> En aquest article (que no &eacute;s t&egrave;cnic) <a href="http://www.catux.org/index.php?contingut=articles&amp;num=97">es pot llegir la resposta dels problemes comuns de la gent.</a> &Eacute;s a dir, com solucionar els problemes, reflexions, etc.</span> <h2>Introducci&oacute;</h2><br /> El dia 17 de Setembre del 2005 Catux va anar a les <a href="http://www.xarxa-omnia.org/ripoll/mambo/">Jornades de Programari Lliure a Ripoll.</a><br /> <br /> Aquell dia es va fer una din&agrave;mica de grup, on la gent va donar el seu punt de vista sobre les avantatges i desavantatges de migrar o utilitzar Programari Lliure. Catux <a href="http://www.catux.org/index.php?contingut=articles&amp;num=94">va publicar</a> les opinions expressades per usuaris que tenien diferents coneixements d&#39;inform&agrave;tica, alguns m&eacute;s avan&ccedil;ats que altres, diferents experi&egrave;ncies, etc.<br /> <br /> Els inconvenients que es van comentar no s&oacute;n ficticis o de laboratori, sin&oacute; que s&oacute;n els que realment els usuaris (majorit&agrave;riament de Windows) troben a l&#39;hora de migrar a utilitzar Programari Lliure i GNU/Linux en concret. Per&ograve; aquests inconvenients molts cops s&oacute;n degut a una mala percepci&oacute; o mala informaci&oacute;, aix&iacute; que en aquest article intentarem analitzar-les i explicar-les, veure si &eacute;s cert o no (o fins a quin punt), etc.<br /> <br /> S&#39;han agrupat les idees que s&oacute;n tan iguals que la resposta hagu&eacute;s estat molt semblant. Algunes idees que s&oacute;n semblants no s&#39;han agrupat ja que es comenta algun petit mat&iacute;s diferent.<br /> <br /> <h2>Recull de problemes observats pels usuaris</h2><br /> <strong>M&eacute;s compatibilitat amb maquinari.</strong><br /> <strong>Puc tenir l&#39;&uacute;ltim maquinari.</strong><br /> Hi ha molt maquinari compatible. De fet cada dia que passa Linux suporta m&eacute;s i m&eacute;s maquinari, i hi ha varies empreses que ja fan controladors nadius per Linux, com pot ser Nvidia (fa el controlador) o ATI (facilita informaci&oacute; per a fer el controlador). Impressores Kyocera, HP, Epson i altres tamb&eacute; faciliten els controladors expl&iacute;citament per GNU/Linux.<br /> Hi ha algunes peces que poden provocar maldecaps, tal com alguns m&ograve;dems USB. Curiosament, la majoria de maquinari on es poden trobar problemes de configuraci&oacute; tamb&eacute; en tenen en altres sistemes operatius (el cas dels m&ograve;dems USB amb Microsoft Windows solen provocar problemes, incompatibilitats, etc.). En aquests casos sempre hi ha alternatives per aconseguir aquesta funcionalitat. En una minoria (rara) de casos, es pot donar el cas que calgui canviar un dispositiu, que segur que ser&agrave; menor que el cost de no canviar-lo i seguir amb altres sistemes.<br /> <br /> <strong>L&#39;&uacute;s del programari propietari &eacute;s m&eacute;s simple de fer funcionar.</strong><br /> <strong>Utilitzar-lo em suposa adquirir m&eacute;s coneixements dels que tinc. &Eacute;s m&eacute;s c&ograve;mode seguir amb el programari propietari.</strong><br /> <strong>Sortir de la rutina (Windows) no &eacute;s f&agrave;cil i requereix un esfor&ccedil;, que no tothom est&agrave; disposat a fer.</strong><br /> <strong>No &eacute;s bo, ja que al canviar de programes, poden ser diferents i hi ha m&eacute;s dificultat per aprendre el seu &uacute;s.</strong><br /> El paradigma de pr&agrave;cticament qualsevol programa ser&agrave; el mateix en ambd&oacute;s sistemes. Per exemple, l&#39;&uacute;s d&#39;un processador de text no depen del sistema operatiu on s&#39;est&agrave; executant; de fet depen poc fins i tot de quin processador de text &eacute;s. Pot canviar m&iacute;nimament, per&ograve; no completament. Tamb&eacute; hi sol haver guies per canviar d&#39;un processador a un altre (i el mateix amb qualsevol programa).<br /> El canvi &eacute;s el mateix que una persona que condueix un cotxe i se&#39;l canvia, segurament per millorar. Els primers dies se sentir&agrave; una mica diferent, trobar&agrave; a faltar alguns comandaments a &quot;l&#39;antic lloc&quot; i hi veur&agrave; difer&egrave;ncies, per&ograve; aquestes no provocaran que no el s&agrave;piga conduir.<br /> Es pot dir el mateix canviant de tel&egrave;fon m&ograve;bil; els primers dies un sempre es nota diferent per&ograve; &eacute;s una sensaci&oacute; que se supera prou r&agrave;pid, un cop ja es coneix m&eacute;s el nou m&ograve;bil.<br /> En el cas del Programari Lliure hi ha un guany clar: la llibertat. Aix&iacute; que val la pena bescanviar aquest guany per una petita inversi&oacute; de temps i alguna petita incomoditat que hi pugui haver els primers dies o setmanes. Cal dir que les solucions en general en programari lliure s&oacute;n tan v&agrave;lides o m&eacute;s que les de Programari Privatiu.<br /> <br /> <strong>Empreses que donin suport (arreglin el PC de casa).</strong><br /> Se suposa que es refereix a les t&iacute;piques botigues de proximitat. Es tracta de buscar les que s&iacute; que donen suport, ja que haver-n&#39;hi, n&#39;hi ha. Els companys Igualadins d&#39;Iglu estan preparant una llista de botigues que fan descomptes si es compra l&#39;ordinador amb Linux, en faciliten suport, etc. Segur que ben aviat tenen a la seva <a href="http://www.iglu-cat.net/">p&agrave;gina Web</a> l&#39;article (des de Catux tamb&eacute; en farem ress&ograve;)<br /> <br /> <strong>Considero que hi ha molta informaci&oacute; sobre el programari lliure, per&ograve; no &eacute;s f&agrave;cil d&#39;entendre per l&#39;usuari &quot;de casa&quot; (la part t&egrave;cnica).</strong><br /> Cada dia hi ha m&eacute;s documentaci&oacute; f&agrave;cil d&#39;entendre, adre&ccedil;ada a aquests usuaris. Un exemple &eacute;s l&#39;Ubuntuguide, que es pot trobar en <a href="http://guia-ubuntu.org/">castell&agrave;</a> i en <a href="http://ubuntuguide.com/">angl&egrave;s</a>.<br /> En qualsevol cas, el nou usuari dom&egrave;stic es trobar&agrave; molt acompanyat en tot moment, si m&eacute;s no mitjan&ccedil;ant llistes de correu, f&ograve;rums, xats, i sobretot mitjan&ccedil;ant grups d&#39;usuaris locals. Un clar exemple &eacute;s Catux, on qualsevol persona pot venir els Diumenges a la tarda i se l&#39;ajudar&agrave; a entendre el nou sistema, resoldre possibles problemes, etc.<br /> <br /> <strong>Considero que la persona que treballa i programa, t&eacute; el dret de poder treure&#39;n rendiment (beneficis).</strong><br /> I tant, faltaria m&eacute;s! Tamb&eacute; cal pensar com es guanyen la vida les persones que treballen actualment amb la inform&agrave;tica. El nivell de desenvolupament de programari privatiu a Espanya &eacute;s molt baix. Qui fa servir programes privatius fets a Espanya? A nivell de commodity product (&eacute;s a dir, vendre la llic&egrave;ncia dins una caixa com si fos un producte) pr&agrave;cticament nom&eacute;s hi ha l&#39;antivirus Panda. En canvi la majoria d&#39;empreses d&#39;inform&agrave;tica es dediquen a fer programari a mida per clients concrets i cobren mitjan&ccedil;ant contractes de manteniment. La majoria d&#39;ingressos d&#39;aquestes empreses &eacute;s en concepte de manteniment, fet que podrien mantenir igualment -encara amb m&eacute;s facilitat- fent programari lliure.<br /> Tamb&eacute; reflexionar que amb el programari privatiu la major part dels beneficis de les empreses van a l&#39;estranger, sense possibilitat de mercat local, m&eacute;s proper a l&#39;usuari (el m&agrave;xim que, amb programari privatiu acostumen a fer les empreses locals &eacute;s trucar a l&#39;estranger). En canvi amb el programari lliure es fomenta el mercat local, al tenir aquestes les llibertats d&#39;adaptar-lo, arreglar els problemes, etc. <br /> La majoria de guanys de la gent que treballen en inform&agrave;tica a la nostra zona no &eacute;s desenvolupament programari privatiu, sin&oacute; donant suport a aquest; per aquest costat no hi hauria problema. I les que desenvolupen programari privatiu poden canviar el seu model de negoci (hi ha moltes refer&egrave;ncies que expliquen com fer-ho, est&agrave; fora de l&#39;abast d&#39;aquest document)<br /> <br /> <strong>Tot el programari i els formats s&oacute;n per Windows.</strong><br /> Quan al programari, cal tenir en compte que n&#39;hi ha molt de multiplataforma, de qualitat i lliure (en s&oacute;n clars exemples <a href="http://www.mozilla.org/">Mozilla Firefox</a>, <a href="http://openoffice.org/">OpenOffice.org2</a>, <a href="http://gimp.org/">Gimp</a>, entre altres).<br /> Tamb&eacute; cal comentar que es pot trobar a faltar programari de Microsoft Windows a GNU/Linux perqu&egrave; &eacute;s el que un coneix. Quan es coneix el programari per GNU/Linux, se&#39;n troba a faltar per Microsoft Windows (per exemple, l&#39;<a href="http://amarok.sf.net/">Amarok</a>). &Eacute;s a dir, es troba a faltar el que es coneix, no el qu&egrave; es desconeix. Llavors es veuria que per MS-Windows tamb&eacute; hi falta molt programari.<br /> Sobre els formats de documents; OpenOffice, per exemple, pot llegir i escriure documents en format MS-Word (o Excel, o Power Point) de forma prou correcta. Amb els formats gr&agrave;fics no hi ha cap problema, igual que amb els de v&iacute;deo.<br /> &Eacute;s cert que pot haver-hi necessitat d&#39;algun programa que nom&eacute;s es troba per Microsoft Windows. En aquest cas caldr&agrave; buscar-ne un substitut; hi ha diversos llocs Web a la xarxa que faciliten equival&egrave;ncies entre programes MS-Windows i GNU/Linux, normalment amb una oferta m&eacute;s &agrave;mplia per aquests. Tamb&eacute; es pot impulsar la creaci&oacute; d&#39;una aplicaci&oacute; lliure com la que es necessiti, buscant m&eacute;s gent amb les mateixes necessitats. Amb programari lliure &eacute;s molt f&agrave;cil modificar o adaptar codi d&#39;altres programes, cosa gaireb&eacute; impossible quan al programari privatiu. Una soluci&oacute; m&eacute;s senzilla &eacute;s usar un emulador com &eacute;s <a href="http://winehq.com/">Wine</a>. I si voleu compatibilitat al 100%, podeu obrir una finestra per a executar MS-Windows dins de GNU/Linux, com Win4Lin o VMWare.<br /> <br /> <br /> <strong>General no &eacute;s &uacute;til per guanyar-se la vida.</strong><br /> <strong>Empreses perden.</strong><br /> <strong>&Eacute;s m&eacute;s f&agrave;cil crear beneficis i llocs de treball amb Programari Propietari.</strong><br /> Aquest &eacute;s un altre t&ograve;pic. Sobre els beneficis, l&#39;&uacute;nic que canvia amb el Programari Lliure &eacute;s el model de negoci. Es passa de ser un model de venda per llic&egrave;ncia a ser un model de personalitzaci&oacute;, suport, millora, manteniment, etc. Un exemple clar &eacute;s veure com empreses com Novell i IBM estan treballant (tan desenvolupament com utilitzant) Programari Lliure, i hi estan guanyant grans quantitats de diners, ja que podem estar segurs que si no fos aix&iacute; no ho farien pas.<br /> <br /> Sobre els llocs de treball, es pot dir que encara &eacute;s m&eacute;s fals. Els llocs de treball que genera el Programari Privatiu solen estar majorit&agrave;riament centralitzats als Estats Units, on resideixen les grans corporacions. No generen llocs de treball en l&#39;&agrave;mbit nacional, i si en generen s&oacute;n llocs de treball de molt baixa qualitat t&egrave;cnica (no es pot resoldre cap problema sense passar abans per caixa d&#39;Estats Units, no &eacute;s t&eacute; la llibertat de personalitzar els programes, etc.). D&#39;altra banda, augmenta la qualificaci&oacute; dels professionals que s&#39;hi dediquen, que passen de ser venedors a inform&agrave;tics que saben el que tenen entre les mans.<br /> <br /> Com a punt final, les poques empreses de Programari Privatiu que es troben a casa nostra no acostumen a guanyar els diners venent llic&egrave;ncies (&iquest;quant inverteix un usuari o empresa en llic&egrave;ncies?) sin&oacute; que ho fan justament amb el manteniment, millores, personalitzaci&oacute; del programari del que han venut les llic&egrave;ncies, fet que es podria fer igualment amb Programari Lliure.<br /> <br /> <br /> <strong>Hi ha molts professionals, botigues i distribu&iuml;dors a qui el programari lliure enfonsaria part del negoci.</strong><br /> Sobre els professionals, cal senzillament un reciclatge. Aquest reciclatge s&#39;ha de fer en certa mesura igualment si no es canvia de plataforma. Nom&eacute;s s&#39;ha fer, segurament, un esfor&ccedil; m&eacute;s gran que es veur&agrave; recompensat en el futur. Cal passar de les accions rutin&agrave;ries a controlar realment el que s&#39;est&agrave; fent. A m&eacute;s, aix&ograve; &eacute;s molt m&eacute;s divertit i genera menys frustraci&oacute; professional. Es resolen els problemes que t&eacute; el client d&#39;un, no els que t&eacute; un producte que s&#39;ha venut al client.<br /> <br /> Distribu&iuml;dors: poden passar a distribuir... distribucions de Linux. No &eacute;s cap problema. &Eacute;s m&eacute;s, poden fer la seva pr&ograve;pia distribuci&oacute; feta especialment per cobrir les necessitats dels seus clients, personalitzada i millorada pels seus casos particulars d&#39;&uacute;s (cal afegir que aix&ograve; ja s&#39;ha fet i es fa actualment)<br /> <br /> <br /> <strong>Puc jugar a molts jocs.</strong><br /> En Windows hi ha molts jocs comercials, en GNU/Linux n&#39;hi ha menys, &eacute;s cert. Tot i aix&ograve; GNU/Linux t&eacute; alguns jocs -molt bons- lliures, que tamb&eacute; poden fer passar bones estones de diversi&oacute;.<br /> En tot cas, &eacute;s segur que &eacute;s un peix que es mossega la cua. No hi ha jocs perqu&egrave; encara no hi ha prou usuaris, i no hi ha usuaris perqu&egrave; no hi ha jocs. Per tant, podem ser usuaris prescindint moment&agrave;niament d&#39;algun joc, tot arribar&agrave;. Dels emuladors abans esmentats n&#39;hi ha tamb&eacute; especialitzats en jocs.<br /> <br /> Igualment cal destacar que Microsoft ha intentat (amb t&agrave;ctiques poc &egrave;tiques, com alentir la velocitat de treball en cas d&#39;utilitzar les llibreries OpenGL que s&oacute;n multiplataforma) que sigui dif&iacute;cil fer jocs multiplataforma entre MS-Windows i Linux. Volem seguir-li el joc, o no?<br /> <br /> <strong>No s&#39;utilitza tant b&eacute; perqu&egrave; no es publiquen informacions d&#39;&uacute;s a nivell institucional.</strong><br /> (Catux: nivell institucional &eacute;s l&#39;administraci&oacute; p&uacute;blica?)<br /> L&#39;administraci&oacute; normalment no s&#39;ha caracteritzat mai per marcar el ritme quant a noves tecnologies. Tanmateix el programari lliure, tot i que ara est&agrave; arribant al gran p&uacute;blic, no &eacute;s un fet totalment nou, i aix&ograve; es pot veure reflectit a diversos llocs. Per exemple, al comen&ccedil;ament del Tripartit a Catalunya es va fer el pacte del Tinell, on es pot llegir:<br /> <br /> &quot;3.3 Fer accessibles tots els lloc web finan&ccedil;ats amb fons p&uacute;blic (respectant els est&agrave;ndards establerts per World Wide Web Consortium).<br /> 3.4 Utilitzar est&agrave;ndards oberts que garanteixin el dret a escollir programari als usuaris.<br /> 3.5 Fomentar la producci&oacute; de programari lliure i la corresponent documentaci&oacute; d&#39;&uacute;s en catal&agrave;.&quot;<br /> Aquest text es pot trobar <a href="http://www.lafactoriaweb.com/articulos/tinell23.htm">en aquesta plana Web.</a><br /> A <a href="http://lafarga.org/">La Farga</a>, iniciativa feta per la Generalitat, es veuen els cursos que fan de Programari Lliure. La nova Web de la Generalitat est&agrave; ja for&ccedil;a orientada al programari lliure, i fins i tot faciliten programari lliure per GNU/Linux i MS-Windows desenvolupat per ells mateixos que &eacute;s un lector RSS, etc. Ara fa pocs dies va apar&egrave;ixer una not&iacute;cia d&#39;un projecte de la Generalitat que impulsaria el Programari Lliure d&#39;alguna manera tamb&eacute; m&eacute;s activa. Quant al Departament d&#39;Ensenyament, s&#39;ha adjudicat ja el concurs per a una distribuci&oacute; GNU/Linux pr&ograve;pia, i s&#39;anir&agrave; fent la transici&oacute; a aquest programari. Moltes universitats tamb&eacute; faciliten un CD-ROM amb programari lliure als seus alumnes. Moltes comunitats aut&ograve;nomes espanyoles tamb&eacute; donen suport actiu a GNU/Linux. I a l&#39;estranger, cada vegada es troben m&eacute;s experi&egrave;ncies d&#39;aquest tipus, des d&#39;Alemanya fins al Brasil.<br /> <br /> <strong>Resist&egrave;ncia al canvi (l&#39;utilitza molta gent).</strong><br /> Per&ograve; curiosament tothom qui coneix els dos sistemes de forma m&eacute;s o menys profunda es queda amb GNU/Linux. Suposem que a alg&uacute; li agrada el past&iacute;s de xocolata. Segurament ha provat el de maduixa per&ograve; ha decidit que prefereix el de xocolata. En canvi, molta gent est&agrave; fent servir Windows sense haver provat l&#39;altre past&iacute;s! No sembla el m&eacute;s l&ograve;gic, oi? Per provar Linux no es necessita molt temps lliure, segurament unes 10 hores amb l&#39;ajuda d&#39;una associaci&oacute; local d&#39;usuaris n&#39;hi ha prou per fer-se&#39;n una idea.<br /> <br /> <strong>La plataforma Windows ara mateix &eacute;s necess&agrave;ria a nivell d&#39;empreses ja que si una empresa volgu&eacute;s implantar Linux i OpenOffice, no es podria comunicar amb la resta sense dificultats.</strong><br /> Sens dubte hi pot haver algun petit problema, per&ograve; ja hi ha empreses que ho fan. Enviar-ho en format PDF, rebre els documents en format MS-Word i fer servir OpenOffice per llegir-ho (la versi&oacute; 2.0 ha millorat molt quant a importacions/exportacions MS) pot ser suficient en molts entorns.<br /> <br /> &Eacute;s una realitat que hi ha empreses que ja treballen d&#39;aquesta manera (fins i tot als Estats Units), i no sembla que tinguin tants problemes. Potser alguns s&iacute;, per&ograve; tamb&eacute; s&#39;estalvien virus, tenen el programari en catal&agrave;, estalvien en llic&egrave;ncies, el programari &eacute;s m&eacute;s estable, tenen menys manteniment, etc. Tot aix&ograve; els surt a compte a canvi de, potser, no veure de forma correcta algun document.<br /> <br /> <br /> <a name="eti1" title="eti1"></a><strong>A nivell d&#39;usuari no est&agrave; a l&#39;al&ccedil;ada (encara) d&#39;altre programari propietari (Microsoft).</strong><br /> Hi ha molts usuaris que estan totalment contents fent servir Linux. Normalment, qui coneix els dos sistemes (tamb&eacute; sent usuaris no avan&ccedil;ats!) es queden amb Linux. Les tasques habituals dels usuaris (escriure documents, navegar, xatejar, veure v&iacute;deos/pel&middot;l&iacute;cules, imprimir, fer gr&agrave;fics...) es poden realitzar igual o millor amb GNU/Linux. Programes com <a href="http://mozilla.org/">Firefox</a>, <a href="http://openoffice.org/">OpenOffice</a>, <a href="http://gimp.org/">Gimp</a>, <a href="http://gaim.sf.net/">Gaim</a>, etc. fan que aix&ograve; sigui possible, junt amb un entorn d&#39;escriptori integrat com poden ser <a href="http://gnome.org/">Gnome</a> o <a href="http://www.kde.org/">KDE</a>. Si voleu programari per enginyeria, retoc fotogr&agrave;fic, edici&oacute; musical, etc. tamb&eacute; en trobareu. A m&eacute;s, podeu provar les aplicacions que vulgueu sense comprometre un c&egrave;ntim, i despr&eacute;s quedar-vos amb la que us vagi millor.<br /> <br /> Una manera de comen&ccedil;ar en aquest m&oacute;n &eacute;s instal&middot;lar els programes lliures que sigui possible en Windows. Per exemple <a href="http://mozilla.org/">Firefox</a>, <a href="http://openoffice.org/">OpenOffice</a>, <a href="http://gimp.org/">Gimp</a> i <a href="http://gaim.sf.net/">Gaim</a>. Utilitzant tot aix&ograve; uns dies ens sentirem m&eacute;s familiaritzats al fer el pas definitiu a Programari Lliure. Un cop a GNU-Linux veureu que no hi ha cap canvi substancial, llevat que les aplicacions funcionen millor.<br /> <br /> <br /> <strong>Manca d&#39;algun tipus de programari.</strong><br /> A MS-Windows tamb&eacute; hi manca programari, que &eacute;s realment bo. Per exemple l&#39;<a href="http://akregator.sourceforge.net/">Akregator</a> (fant&agrave;stic agregador de RSS), <a href="http://kmail.kde.org/">Kmail</a> (molt bon client de correu), <a href="http://www.gnome.org/projects/evolution/">Evolution</a>, <a href="http://k3b.sourceforge.net/">K3B</a> (un gravador de CD i DVD realment bo), etc.<br /> <br /> El que passa &eacute;s que un usuari de Windows nom&eacute;s coneix els programes que estan a MS-Windows per&ograve; no s&oacute;n a Linux. Un usuari de Linux t&eacute; una percepci&oacute; diferent, totalment a l&#39;invers.<br /> <br /> <br /> <strong>Ara mateix hi ha molta facilitat per aprendre a con&egrave;ixer Windows i MSOffice. Si es vol aprendre Linux no hi ha cursos ni especialistes.</strong><br /> S&iacute; que hi ha especialistes. Nom&eacute;s a Catalunya hi ha 96 empreses que treballen sobre Programari Lliure, segons <a href="http://libroblanco.com/">Libro Blanco</a>. Hi ha molts grups d&#39;usuaris amb gent capacitada sobre el tema, que poden ajudar i assessorar.<br /> <br /> Cursos, tamb&eacute; n&#39;hi ha. En algunes acad&egrave;mies d&#39;inform&agrave;tica fan cursos, i &eacute;s habitual jornades de curta durada amb cursos introductoris, que poden servir per tenir un primer contacte. A l&#39;<a href="http://www.lafarga.org/themes/phptemplate/lafarga/images/mas.png">agenda de la Farga</a> hi sol haver dates dels propers cursos. Al Cibernarium de Barcelona fan cursos, l&#39;Ajuntament de Manresa en fa regularment tamb&eacute;, etc.<br /> <br /> <br /> <strong>Un Sistema Operatiu m&eacute;s complex.</strong><br /> No &eacute;s m&eacute;s complex, sin&oacute; desconegut. Hi ha tasques que pot costar m&eacute;s fer-les amb Linux, i n&#39;hi ha que pot costar m&eacute;s fer-les amb Windows. Un problema &eacute;s que tenim un coneixement inherent del sistema Windows del que segurament no en som conscients, i per aix&ograve; prendre certes accions amb Windows (p. ex. instal&middot;lar un Antivirus, Firewall, netejadors de sistema, desfragmentar el disc, etc.) ho veiem de forma normal, quan no hauria de ser aix&iacute;. Amb Linux hi ha un petit proc&eacute;s d&#39;aprenentatge, no per ser dif&iacute;cil (a vegades &eacute;s realment m&eacute;s f&agrave;cil) sin&oacute; per ser lleugerament diferent.<br /> El sistema m&eacute;s f&agrave;cil pot semblar dif&iacute;cil quan no es coneix.<br /> <br /> <strong>Al ser lliure hi ha moltes variacions de cara l&#39;usuari.</strong><br /> Aix&ograve; &eacute;s com dir que anar a un restaurant a menjar de la carta &eacute;s un problema perqu&egrave; hi ha molts plats per a escollir. I que anar a un McDonald&#39;s &eacute;s millor: no tenim feina a escollir. Ning&uacute; veu un problema amb aix&ograve;, per&ograve; s&iacute; amb el Programari. Cal canviar la percepci&oacute;.<br /> <br /> A vegades tamb&eacute; es pot veure com a cada persona &quot;li queda b&eacute;&quot; (com si fos una pe&ccedil;a de roba) una distribuci&oacute; diferent. El fet &eacute;s provar-ne una a veure si s&#39;ajusta a les nostres necessitats. En tot cas, <a href="http://ubuntulinux.org/">Ubuntu</a>, <a href="http://fedora.redhat.com/">Fedora Core</a>, <a href="http://www.opensuse.org/">OpenSuse</a> s&oacute;n distribucions molt adequades per comen&ccedil;ar en aquest m&oacute;n, com <a href="http://www.mandriva.com/">Mandriva</a> o altres.<br /> <br /> <br /> <h2>Conclusions</h2><br /> El document ha estat segurament una mica massa llarg. Les conclusions &eacute;s que cal provar el Programari Lliure, ja que hi ha molta mala informaci&oacute; o informaci&oacute; no actualitzada, amb certs t&ograve;pics vers ell.<br /> Una bona manera de provar GNU/Linux &eacute;s amb la distribuci&oacute; <a href="http://www.ubuntulinux.org/">Ubuntu</a>, que es pot <a href="http://www.ubuntulinux.org/download/">descarregar</a> d&#39;Internet de forma totalment totalment legal. Una altra distribuci&oacute;, m&eacute;s propera a Catalunya, &eacute;s <a href="http://www.catix.org/">C&agrave;tix</a>, a la seva plana Web es pot trobar m&eacute;s informaci&oacute;.<br /> Si es vol migrar de manera progressiva, es pot comen&ccedil;ar a fer servir programari Lliure amb un sistema operatiu Privatiu. En <a href="http://www.catux.org/index.php?contingut=articles&amp;num=97#eti1">aquesta pregunta</a> hi ha algunes refer&egrave;ncies.<br /> Si alg&uacute; t&eacute; dubtes, es pot apuntar a la <a href="http://catux.org/cgi-bin/mailman/listinfo/llista">llista de correu</a> de Catux o d&#39;altres associacions per tal de preguntar, parlar, etc.<br /> <br /> <h2>Refer&egrave;ncies</h2><br /> Bona part de l&#39;argumentaci&oacute; que s&#39;ha anat contestant &eacute;s de collita pr&ograve;pia. Una altra part ha estat inspirada per lectures fetes els &uacute;ltims anys a llocs d&#39;Internet (&eacute;s impossible recollir-los tots) per&ograve; cal destacar els blocs d&#39;en <a href="http://www.catux.org/mnm.uib.es/gallir/">Ricardo Galli</a> i d&#39;en <a href="http://weblog.bitassa.net/">Benjam&iacute; Villoslada.</a><br /> <br /> <h2>Agra&iuml;ments</h2><br /> N&#39;Eduard Selma, que ha millorat en molts aspectes el text (correcci&oacute;, revisi&oacute;, etc.)
    
            </p>

            <h3>
                Categories:
                
        Articles, Iniciació
    
            </h3>

            <hr />
            <h1>Comentaris</h1>
            <ul class="list-group">
                
        <li class="list-group-item">Sense comentaris</li>
    
            </ul>


            <a href="https://catux.org/post_list.html">
                <i class="fas fa-chevron-left"></i>
                Arxius
            </a>
        </div>

    </div>


    </div> <!-- /.container -->

    <div class="container">
        <nav class="navbar navbar-inverse catux-footer">
            <p class="navbar-text">
                Tot el contingut de Catux està subjecte sota la nova versió de la llicència de
                <a href="http://creativecommons.org/licenses/by/2.5/es/deed.ca">Creative Commons</a>
            </p>
        </nav>
    </div>



</body>
</html>
