<!DOCTYPE html>
<html>
<head lang="cat">
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="description" content="Associació d'usuaris de GNU/Linux de la Catalunya Central">
    <meta name="keywords" content="gnu/linux, linux, programari lliure, gnu, lug, associacio, manresa, sant joan de vilatorrada, catalan, català, catalunya">
    <meta name="author" content="Catux">
    <link rel="icon" href="https://catux.github.io/images/favicon.ico">

    <title>Catux</title>

    <link rel="stylesheet" type="text/css" href="https://catux.github.io/css/main.css">
    <script src="https://catux.github.io/js/main.js"></script>
</head>
<body>
    <div class="navbar-wrapper">
        <div class="container">

            <nav class="navbar navbar-inverse">
                <div class="container">
                    <div class="navbar-header col-sm-5">
                        <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
                            <span class="sr-only">Toggle navigation</span>
                            <span class="icon-bar"></span>
                            <span class="icon-bar"></span>
                            <span class="icon-bar"></span>
                        </button>
                        <a href="https://catux.github.io/">
                            <img src="https://catux.github.io/images/catuxlogo.png" alt="Catux" width="40%"><br>
                            <div class="visible-lg"> Associació d'usuaris de GNU/Linux de la Catalunya Central</div>
                        </a>
                    </div>
                    <div id="navbar" class="navbar-collapse collapse navbar-links">
                        <ul class="nav navbar-nav navbar-right">
                            <li><a href="https://catux.github.io/post_list.html">Blog</a></li>
                            <li><a href="https://catux.github.io/traduccio.html">Traducció</a></li>
                        </ul>
                    </div>
                </div>
            </nav>
        </div>
    </div> <!-- /.navbar-wrapper -->

    <div class="container">
        
    <div class="container-fluid">

        <div class="post">
            <a href="https://catux.github.io/post_list.html">
                <i class="fas fa-chevron-left"></i>
                Arxius
            </a>

            <h1>
                
        Samba 3.x, codificació del nom de fitxer: ISO-8859-15/UTF
    
            </h1>

            <h3>
                Escrit al
                
        2006-12-17 00:00:00
    
                per
                
        cpina
    
            </h3>

            <p>
                
        <span class="noticia">Treballant amb Samba 3.x es guarda per defecte el nom dels fitxers amb codificaci&oacute; UTF8. Aix&ograve;, en alguns casos pot no interessar: si no tenim el sistema sencer amb UTF8 i no ens interessa migrar.<br /> <br /> Amb aquest escrit veurem com fer que Samba 3.x desi els fitxers amb codificaci&oacute; ISO-8859-15 (o la del sistema), i tamb&eacute; com canviar el nom dels fitxers que tenim guardats d&#39;UTF8 a ISO-8859-15.<br /> </span><br />     Fa uns dies em vaig trobar amb una s&egrave;rie de problemes amb Samba. Tot i no ser &quot;molt dif&iacute;cil&quot; tenien el seu qu&egrave;, almenys per mi, que sempre em temo les codificacions de car&agrave;cters.<br /> <br /> No s&oacute;c un expert del tema. Nom&eacute;s exposar&eacute; el qu&egrave; vaig veure i com ho vaig solucionar. Hi pot haver alguna apreciaci&oacute; incorrecte, si &eacute;s aix&iacute; demano disculpes (i podeu deixar un comentari...)<br /> <br /> Exposar&eacute; nom&eacute;s els fets, no com vaig arribar a veure-ho tot plegat.<br /> <br /> <br /> <div id="article" class="article_normal"><li>Samba 2.x per defecte guarda els noms de fitxers amb ISO-8859-15 <u>o similar</u>, &eacute;s a dir, per defecte ho guarda amb el tipus de charset del sistema i no amb UTF<br /> </li><li>Samba 3.x per defecte ho guarda amb codificaci&oacute; UTF<br /> </li><li>La distribuci&oacute; que treballem guarda amb sistema ISO-8859-15, no UTF (era el cas concret)<br /> <br /> <br /> Si Samba guarda amb tipus UTF per&ograve; el sistema no, els car&agrave;cters amb accents es desdoblen (s&oacute;n dos car&agrave;cters erronis)<br /> <br /> Si volem fer fitxers al sitema o via Samba i que no hi hagi problemes amb accents, cal tenir-ho tot amb el mateix sistema. Sin&oacute;, quan es fan amb UTF (Samba 3.x per defecte) i no visualitzem amb UTF es veuen dos car&agrave;cters erronis quan hi ha accents. O b&eacute;, si el fitxer est&agrave; fet al sistema Samba mostrar&agrave; car&agrave;cters erronis, etc.<br /> <br /> <strong>Configurar Samba:</strong><br /> Si volem que Samba 3.x guardi en codificaci&oacute; ISO-8859-15 cal posar a /etc/samba/smb.conf, a la secci&oacute; general: unix charset = ISO-8859-15. Llavors els fitxers creats al sistema i via Samba no seran UTF i tot anir&agrave; b&eacute;. El unix charset hauria de ser igual que el del locale per defecte (si no volem tenir problemes, etc.)<br /> <br /> Tamb&eacute; es pot migrar el sistema a UTF, per&ograve; per varis motius no interessava.<br /> <br /> <strong>Canviar els noms dels fitxers ja existents:</strong><br /> Queda un tema pendent: qu&egrave; fer amb els fitxers que potser han estat creats amb UTF per&ograve; ara volem el seu nom codificat amb ISO-8859-15? Es pot fer servir el programa convmv, paquet a Debian amb el mateix nom. Es pot cridar perqu&egrave; canvi&iuml; tots els fitxers d&#39;un directori i subdirectoris de cop, per&ograve; no anava massa b&eacute; aix&iacute; que ho vaig fer fer d&#39;un amb un. Amb un script tipus:<br /> <br /> <br /> #!/bin/bash<br /> <br /> convmv -f utf8 -t iso-8859-15 --notest --qfrom --qto &quot;$1&quot;<br /> <br /> <br /> i llavors cridar a find amb:<br /> find . -depth -exec canvia.sh {} \;<br /> <br /> El -depth &eacute;s perqu&egrave; find primer processi els fitxers amb m&eacute;s profunditat i despr&eacute;s els de menys profunditat. Sin&oacute; podriem estar canviant el nom del directori pare d&#39;altres subdirectoris i que no es complet&eacute;s el canvi de nom.<br /> <br /> Un cop fet aix&ograve;, tindrem el sistema sense UTF (era un requeriment), el Samba 3.x treballant sense UTF i els fitxers nous i vells sense UTF.<br /> <br /> Canviant lleugerament tot plegat, es pot tenir Samba 2.x amb UTF, o podriem canviar els fitxers de ISO-8859-15 a UTF, etc. nom&eacute;s amb les eines vistes.</li></div>
    
            </p>

            <h3>
                Categories:
                
        Articles, Servidor
    
            </h3>

            <hr />
            <h1>Comentaris</h1>
            <ul class="list-group">
                
        <li class="list-group-item">Sense comentaris</li>
    
            </ul>


            <a href="https://catux.github.io/post_list.html">
                <i class="fas fa-chevron-left"></i>
                Arxius
            </a>
        </div>

    </div>


    </div> <!-- /.container -->

    <div class="container">
        <nav class="navbar navbar-inverse catux-footer">
            <p class="navbar-text">
                Tot el contingut de Catux està subjecte sota la nova versió de la llicència de
                <a href="http://creativecommons.org/licenses/by/2.5/es/deed.ca">Creative Commons</a>
            </p>
        </nav>
    </div>



</body>
</html>
