<!DOCTYPE html>
<html>
<head lang="cat">
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="description" content="Associació d'usuaris de GNU/Linux de la Catalunya Central">
    <meta name="keywords" content="gnu/linux, linux, programari lliure, gnu, lug, associacio, manresa, sant joan de vilatorrada, catalan, català, catalunya">
    <meta name="author" content="Catux">
    <link rel="icon" href="https://catux.org/images/favicon.ico">

    <title>Catux</title>

    <link rel="stylesheet" type="text/css" href="https://catux.org/css/main.css">
    <script src="https://catux.org/js/main.js"></script>
</head>
<body>
    <div class="navbar-wrapper">
        <div class="container">

            <nav class="navbar navbar-inverse">
                <div class="container">
                    <div class="navbar-header col-sm-5">
                        <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
                            <span class="sr-only">Toggle navigation</span>
                            <span class="icon-bar"></span>
                            <span class="icon-bar"></span>
                            <span class="icon-bar"></span>
                        </button>
                        <a href="https://catux.org/">
                            <img src="https://catux.org/images/catuxlogo.png" alt="Catux" width="40%"><br>
                            <div class="visible-lg"> Associació d'usuaris de GNU/Linux de la Catalunya Central</div>
                        </a>
                    </div>
                    <div id="navbar" class="navbar-collapse collapse navbar-links">
                        <ul class="nav navbar-nav navbar-right">
                            <li><a href="https://catux.org/post_list.html">Blog</a></li>
                            <li><a href="https://catux.org/traduccio.html">Traducció</a></li>
                            <li><a href="https://catux.org/contactar.html">Contactar</a></li>
                        </ul>
                    </div>
                </div>
            </nav>
        </div>
    </div> <!-- /.navbar-wrapper -->

    <div class="container">
        
    <div class="container-fluid">

        <div class="post">
            <a href="https://catux.org/post_list.html">
                <i class="fas fa-chevron-left"></i>
                Arxius
            </a>

            <h1>
                
        Uso de la Catux-USB 0.1 (Versión Sólo Linux, castellano)
    
            </h1>

            <h3>
                Escrit al
                
        2004-11-13 00:00:00
    
                per
                
        cpina
    
            </h3>

            <p>
                
        <span class="noticia">Tal com es va comentar al mes de Setembre es va publicar a la S&oacute;lo Linux un article sobre Catux-USB.<br /> <br /> El vem posar en catal&agrave; fa poc i ara el posem en castell&agrave;.<br /> <br /> Aix&iacute; que qui no entengui el catal&agrave; pot llegir-lo en castell&agrave;.<br /> --------------------------------------------------------<br /> <br /> Tal como se comento en el mes de setiembre se public&oacute; en la S&oacute;lo Linux un art&iacute;culo sobre Catux-USB.<br /> <br /> Lo pusimos en catalan<a href="http://www.catux.org/index.php?contingut=articles&amp;num=74"></a> hace poco y ahora lo publicamos en castellano.<br /> <br /> As&iacute; que quien no entienda el catal&aacute;n lo puede leer en castellano.</span><br />    <div id="article" class="article_normal"><h2>CATUX-USB: UNA DISTRIBUCI&Oacute;N EJECUTADA DESDE USB</h2><br /> Nota: hay <a href="http://bulma.net/body.phtml?nIdNoticia=2058">un art&iacute;culo</a> m&aacute;s breve sobre Catux-USB que quiz&aacute;s te interese tambi&eacute;n.<br /> Nota2: este art&iacute;culo fue publicado en la S&oacute;lo Linux en Setiembre pasado. Tambi&eacute;n lo tenemos disponible <a href="http://www.catux.org/index.php?contingut=articles&amp;num=74">en catal&aacute;n</a>.<br /> <br /> <br /> <a name="indice" title="indice"></a><br /> <h3>&Iacute;ndice</h3><br /> <br /> <li><a href="http://catux.org/index.php?contingut=articles&amp;num=75#intro">Introducci&oacute;n</a></li><br /> <li><a href="http://catux.org/index.php?contingut=articles&amp;num=75#util">Utilidades de Catux-USB</a></li><br /> <li><a href="http://catux.org/index.php?contingut=articles&amp;num=75#desavantatges">Desaventajas de un dispositivo USB</a></li><br /> <li><a href="http://catux.org/index.php?contingut=articles&amp;num=75#install">&quot;Instalando&quot; Catux-USB</a></li><br /> <li><a href="http://catux.org/index.php?contingut=articles&amp;num=75#bios">Configurando la BIOS</a></li><br /> <li><a href="http://catux.org/index.php?contingut=articles&amp;num=75#problemes">Posibles problemas con el arranque desde USB</a></li><br /> <li><a href="http://catux.org/index.php?contingut=articles&amp;num=75#cdrom">Arranque mediante CD-ROM</a></li><br /> <li><a href="http://catux.org/index.php?contingut=articles&amp;num=75#primer">Arrancando por primera vez</a></li><br /> <li><a href="http://catux.org/index.php?contingut=articles&amp;num=75#login">Haciendo login</a></li><br /> <li><a href="http://catux.org/index.php?contingut=articles&amp;num=75#unitats">Unidades montadas</a></li><br /> <li><a href="http://catux.org/index.php?contingut=articles&amp;num=75#fitxers">Repaso de los ficheros</a></li><br /> <li><a href="http://catux.org/index.php?contingut=articles&amp;num=75#mida">Cambiando el tama&ntilde;o del sistema de ficheros</a></li><br /> <li><a href="http://catux.org/index.php?contingut=articles&amp;num=75#arranc">Proceso de arranque</a></li><br /> <li><a href="http://catux.org/index.php?contingut=articles&amp;num=75#kernel">Como cambiar el Kernel</a></li><br /> <li><a href="http://catux.org/index.php?contingut=articles&amp;num=75#noucd">Generer un nuevo CD</a></li><br /> <li><a href="http://catux.org/index.php?contingut=articles&amp;num=75#micro">Como preparar la instalaci&oacute;n desde Microsoft Windows</a></li><br /> <li><a href="http://catux.org/index.php?contingut=articles&amp;num=75#agraits">Agradecimientos</a></li><br /> <li><a href="http://catux.org/index.php?contingut=articles&amp;num=75#conclu">Conclusiones</a></li><br /> <br /> <br /> <a name="intro" title="intro"></a><br /> <h3>Introducci&oacute;n</h3><br /> Catux es una asociaci&oacute;n de usuarios de GNU/Linux de Catalu&ntilde;a Central (http://www.catux.org) que existe desde hace m&aacute;s o menos un a&ntilde;o.<br /> <br /> A lo largo de este a&ntilde;o hemos realizado diversas actividades como la configuraci&oacute;n de nuestro propio servidor, la realizaci&oacute;n en PHP de un gestor de contenido para nuestra Web o la distribuci&oacute;n de GNU/Linux que aqu&iacute; explicaremos.<br /> <br /> En este art&iacute;culo intentaremos explicaros por qu&eacute; usar esta distribuci&oacute;n, qu&eacute; ventajas tiene, como instalarla (en un Pendrive, no en un disco), trucos, etc. <br /> Catux-USB es una distribuci&oacute;n de GNU/Linux basada inicialmente en los paquetes de Damn Small Linux, pero con el sistema de ficheros ext2 y el parche e2compr. <br /> <br /> Eso significa que nos encontramos ante la primera distribuci&oacute;n que permite arrancar y ejecutarse desde un Pendrive de forma comprimida que tiene un uso convencional, es decir, podemos instalar, desinstalar, actualizar cuantos paquetes queramos o nos sean necesarios,... todo ello s&oacute;lo con la intervenci&oacute;n del conocido apt-get, tal y como si se tratara de una Debian convencional.<br /> <br /> Adem&aacute;s Catux-USB tiene la detecci&oacute;n de hardware autom&aacute;tica que usa Knoppix, y unos scripts que hemos realizado o modificado (de Knoppix, Damn Small Linux,...) sobre la configuraci&oacute;n de X-Window. De esta manera es muy f&aacute;cil llevarnos la distribuci&oacute;n a cualquier ordenador y que se adapte de forma f&aacute;cil.<br /> <br /> La idea es facilitar un sistema base, totalmente usable, de unos 100 MB (usable en Pendrives de 128 MB, o mejor a&uacute;n de 256 MB) con el cual el usuario de Catux-USB sin realizar m&aacute;s trabajo que el uso de apt-get actualice los paquetes que desee, o haga personalizaciones a medida de algunas necesidades. En ning&uacute;n caso es necesario ser un experto en Debian para usar la distribuci&oacute;n. El sistema que ofrecemos, a&uacute;n siendo un sistema base para posteriormente a&ntilde;adir los paquetes que deseemos, es por defecto totalmente funcional, con XFree, un cliente Web (dillo), un cliente FTP (Xftp), otro de correo (sylpheed), un gestor de ventanas (Fluxbox), etc.<br /> <br /> Catux-USB no intenta ser una distribuci&oacute;n completa y que tenga todo. Sino que nace con vocaci&oacute;n de ser una distribuci&oacute;n base que cubra la mayor parte de las necesidades. Aportamos en pocos MB un sistema que arranca y que tiene X-Window, un cliente de Web, FTP y correo.<br /> <br /> <br /> <a href="http://catux.org/index.php?contingut=articles&amp;num=75#indice">&Iacute;ndice</a><br /> <br /> <a name="util" title="util"></a><br /> <h3>Utilidades de Catux-USB</h3><br /> &iquest;Es &uacute;til tener una distribuci&oacute;n en un Pendrive? seguramente m&aacute;s de un lector estar&aacute; pensando eso.<br /> <br /> A continuaci&oacute;n describimos unas cuantas situaciones en las que s&iacute; ser&aacute; &uacute;til tener un sistema como &eacute;ste a nuestra disposici&oacute;n:<br /> <br /> Por ejemplo, tendremos en nuestro bolsillo un dispositivo de 256 MB (por un precio bastante econ&oacute;mico), o de 512 MB con nuestra distribuci&oacute;n y configuraciones personales. Eso significa que podremos usar cualquier ordenador con arquitectura i386 que disponga de puerto USB como si se tratara de nuestro ordenador, entendiendo como nuestro un ordenador aquel en el que se ejecutan nuestras aplicaciones favoritas, con nuestra configuraci&oacute;n personalizada, etc. y todo ello sin tener que hacer nada &ldquo;raro&rdquo; (no tenemos que remasterizar la distribuci&oacute;n, ya que podemos escribir en ella, etc.). De este modo podemos desplazarnos con nuestro &ldquo;kit&rdquo; de herramientas y trabajar del modo en el que estamos acostumbrados sin tener que llevarnos un ordenador port&aacute;til.<br /> <br /> Otro caso ser&iacute;a, si necesitamos un ordenador muy silencioso. Uno de los componentes que generan ruido en un ordenador es el disco duro, y mediante Catux-USB podemos conseguir un ordenador funcional sin disco duro. Como curiosidad, hay fuentes de alimentaci&oacute;n sin ventilador y tambi&eacute;n configuraciones de procesadores y disipadores sin necesidad de ventiladores, por tanto podr&iacute;amos conseguir un ordenador sin partes m&oacute;viles.<br /> <br /> Algunas veces es muy importante el peso (m&aacute;s que la capacidad) o bien el consumo el&eacute;ctrico. En ambos casos, un dispositivo USB pesa mucho menos que un disco duro y tambi&eacute;n consume del orden de 10 veces menos que un disco duro.<br /> <br /> O bien, en un entorno con muchas vibraciones o golpes, un dispositivo USB es mucho m&aacute;s resistente que un disco duro t&iacute;pico. Un dispositivo USB puede recibir un choque de 1000G, en cambio un disco duro t&iacute;pico operando puede soportar un choque de 60G (seg&uacute;n las especificaciones del fabricante).<br /> <br /> <br /> <a href="http://catux.org/index.php?contingut=articles&amp;num=75#indice">&Iacute;ndice</a><br /> <br /> <a name="desavantatges" title="desavantatges"></a><br /> <h3>Desventajas de un dispositivo USB</h3><br /> Las desventajas, son las t&iacute;picas de un dispositivo USB frente un dispositivo IDE como es el disco duro.<br /> <br /> Una de las desventajas es el coste que tiene un dispositivo USB (de momento mucho m&aacute;s caro que un disco duro, al menos la relaci&oacute;n &euro;/MB). Esta desventaja con el tiempo se ir&aacute; reduciendo, al ir apareciendo cada vez dispositivos de mayor capacidad y m&aacute;s econ&oacute;micos.<br /> <br /> Otra desventaja es la velocidad, con USB 1.0 es unas 22 veces m&aacute;s lento que un disco duro. En todo caso, actualmente los procesadores tienen una capacidad de procesamiento muy alta, y al usar el parche e2compr podemos suponer que cada MB le&iacute;do son 2 MB descomprimidos, ayud&aacute;ndos as&iacute; a reducir algo esta desventaja. Con USB 2.0, cada vez m&aacute;s habitual, se nota algo menos la diferencia. <br /> <br /> Sin embargo, y salvando las diferencias existentes, en el uso habitual de una distribuci&oacute;n (abrir y cerrar programas, modificar ficheros, etc.) nos sorprender&aacute; agradablemente el uso de la distribuci&oacute;n, ya que en la pr&aacute;ctica no notaremos diferencias significativas. Ser&iacute;a en usos m&aacute;s intensivos de entrada/salida del dispositivo donde s&iacute; notar&iacute;amos bastante dicha disminuci&oacute;n de velocidad.<br /> <br /> Una caracter&iacute;stica de los pendrive que podr&iacute;a parecer una desventaja, pero mirada con atenci&oacute;n no lo es, es el n&uacute;mero limitado de veces que podemos escribir en un dispositivo tipo Pendrive. Los fabricantes dan una estimaci&oacute;n de 1.000.000 escrituras en una zona determinada. Esto es, que si escribimos 2 veces al d&iacute;a en el mismo sitio, resultan unas 300 sobreescrituras al a&ntilde;o, es decir, el Pendrive nos durar&aacute; m&aacute;s de 1.000 a&ntilde;os, bastante m&aacute;s que suficiente. Pero por si fuera poco, GNU/Linux aporta un sistema de buffers/cach&eacute; para acelerar el acceso a disco, que evita, como efecto colateral, las escrituras innecesarias sobre una misma zona. Adem&aacute;s, los logs est&aacute;n configurados para que syslog-ng los tenga en buffers y no vaya a&ntilde;adiendo l&iacute;nea a l&iacute;nea. Tambi&eacute;n diponemos de una opci&oacute;n adicional, con la que podr&iacute;amos montar el sistema con la opci&oacute;n noatime (modificando el /etc/fstab) para evitar que escriba el tiempo de acceso a los inodos cada vez que se acceda a un fichero.<br /> <br /> <br /> <a href="http://catux.org/index.php?contingut=articles&amp;num=75#indice">&Iacute;ndice</a><br /> <br /> <a name="install" title="install"></a><br /> <h3>&ldquo;Instalando&rdquo; Catux-USB</h3><br /> Catux-USB est&aacute; pensada para ser usada en Pendrives de 128 MB , 256 MB o incluso de mayor capacidad, por lo que en ning&uacute;n caso su uso modificar&aacute; el disco duro.<br /> En los servidores, para descargarla encontraremos dos ficheros: el fichero para 128MB y el fichero para el pendrive de 256MB (llamados respectivamente catuxusb-0.1a-128.tar.bz y catuxusb-0.1a-256.tar). Hacer notar que una vez la tengamos siempre podremos adaptarla de forma f&aacute;cil al tama&ntilde;o que deseemos mediante unos scripts ya preparados. <br /> <br /> Entre las versiones de un tama&ntilde;o o del otro tan s&oacute;lo cambia el dimensionamiento del sistema, los paquetes son los mismos. As&iacute; si usamos el de 256 MB tendremos m&aacute;s espacio para poder a&ntilde;adir nuestros paquetes.<br /> <br /> En primer lugar lo descargamos de: <br /> <br />http://catux.org/distribucions/catux/<br /> <br /> Una vez lo tengamos en el disco podremos hacer:<br /> <br /> bunzip2 catuxusb-0.1a-256.tar.gz<br /> tar -xvf catuxusb-0.1a-256.tar<br /> <br /> De esa forma ya tendremos en el directorio catuxusb-0.1a-256 la distribuci&oacute;n lista para copiarla en el Pendrive. M&aacute;s adelante veremos en qu&eacute; consisten los ficheros que hay en ella.<br /> <br /> En el Pendrive tendr&iacute;amos que tener una partici&oacute;n del tipo FAT, por ejemplo tipo 6. Podemos hacer, como root, eso:<br /> <br /> pinux:~# fdisk -l /dev/sda<br /> <br /> <br /> Y veremos algo parecido a:<br /> <br /> pinux:~# fdisk -l /dev/sda<br /> <br /> Disk /dev/sda: 255 MB, 255590400 bytes<br /> 8 heads, 61 sectors/track, 1022 cylinders<br /> Units = cylinders of 488 * 512 = 249856 bytes<br /> <br />    Device Boot      Start         End      Blocks   Id  System<br /> /dev/sda1   *            1        1022      249337+   6  FAT16<br /> pinux:~# <br /> <br /> <br /> (suponiendo que el dispositivo para el Pendrive sea /dev/sda)<br /> Este tipo de configuraci&oacute;n (una sola partici&oacute;n tipo FAT16) es la configuraci&oacute;n que suele venir por defecto en los dispositivos Pendrives, as&iacute; que seguramente no tendremos que modificar la tabla de particiones. Si por alg&uacute;n motivo hubi&eacute;ramos modificado esta configuraci&oacute;n con anterioridad deberemos dejarla en FAT16 de nuevo, al menos la primera partici&oacute;n.<br /> <br /> Fij&eacute;monos que tenga el asterisco en la columna Boot. Esto indica que esta partici&oacute;n es la activa. En caso que no lo tengamos marcado as&iacute; haremos:<br /> fdisk /dev/sda<br /> <br /> Entonces presionaremos &ldquo;a&rdquo; y la partici&oacute;n n&uacute;mero 1 para marcarla como activa.<br /> Comentar que Catux-USB no se ejecuta sobre la partici&oacute;n FAT, sin&oacute; que crea un fichero tipo ext2 compressed en la partici&oacute;n y se ejecuta desde all&iacute; (es transparante al usuario). Tambi&eacute;n crea otro fichero tipo ext2 para el HOME (este sin comprimir). <br /> <br /> Una vez tengamos la partici&oacute;n de tipo FAT16 se ha de montar en un punto del sistema. Para montar el contenido del pendrive en el directorio /mnt/pendrive(este directorio ha de existir) ejecutaremos lo siguiente:<br /> <br /> mount -t vfat /dev/sda1 /mnt/pendrive<br /> <br /> A continuaci&oacute;n copiamos el contenido de Catux-USB aqu&iacute; dentro:<br /> <br /> cp catuxusb-0.1a-256/* /mnt/pendrive<br /> <br /> Y desmontar el dispositivo:<br /> <br /> umount /mnt/pendrive<br /> <br /> Este umount puede tardar bastante, ya que Linux tendr&aacute; que escribir realmente datos que a&uacute;n est&aacute;n en la cach&eacute;.<br /> <br /> <br /> Una vez hayamos hecho eso, si queremos que arranque desde el mismo USB ejecutaremos:<br /> <br /> syslinux /dev/sda1<br /> <br /> De esa forma se est&aacute; escribiendo el inicio de la partici&oacute;n para que sea arrancable mediante un gestor de arranque llamado syslinux.<br /> Si no dispusi&eacute;ramos del programa syslinux, se puede encontrar seguramente en nuestra distribuci&oacute;n en un paquete llamado syslinux, o bien en esta misma direcci&oacute;n: <a href="http://syslinux.zytor.com/">http://syslinux.zytor.com/</a>.<br /> <br /> <br /> <a href="http://catux.org/index.php?contingut=articles&amp;num=75#indice">&Iacute;ndice</a><br /> <br /> <a name="bios" title="bios"></a><br /> <h3>Configurando la BIOS</h3><br /> Si nuestra BIOS es relativamente reciente y puede arrancar por USB los pasos a seguir ser&aacute;n poner el Pendrive, entrar en la BIOS. Algunas BIOS si no detectan el Pendrive mientras la estamos configurando no nos lo muestran como opci&oacute;n de arranque, as&iacute; que mejor lo pondremos para poder configurar correctamente la BIOS.<br /> <br /> En la secci&oacute;n normalmente de &ldquo;Boot Options&rdquo;, en la &ldquo;Boot Sequence&rdquo; pondremos antes que el disco duro el USB-FDD (o bien USB-Floppy) y saldremos guardando las opciones.<br /> <br /> As&iacute;, cuando tengamos insertado el Pendrive nos aparecer&aacute; la car&aacute;tula de la distribuci&oacute;n (una mano) lista para arrancar.<br /> <br /> <br /> <a href="http://catux.org/index.php?contingut=articles&amp;num=75#indice">&Iacute;ndice</a><br /> <br /> <a name="problemes" title="problemes"></a><br /> <h3>Posibles problemas del arranque de USB</h3><br /> Ante todo no nos tenemos que desesperar. El arranque por dispositivos USB es muy reciente y es posible que nuestra BIOS no lo soporte (en este caso no encontraremos la opci&oacute;n USB-FDD en el men&uacute; de la secuencia de arranque).<br /> Tambi&eacute;n es posible que la BIOS lo soporte pero no correctamente, o bien que tenga alg&uacute;n tipo de incompatibilidad con nuestro dispositivo Pendrive.<br /> Siempre estamos a tiempo de arrancar mediante el CD-ROM, aunque tenemos algunas &uacute;ltimas configuraciones que verificar.<br /> <br /> Algo que hemos de verificar es que la opci&oacute;n en la BIOS de como manejar dispositivos USB est&eacute; en modo &quot;BIOS&quot; i no modo &quot;legacy&rdquo;. Este cambio hace que si tenemos dispositivos USB que se necesitan en el arranque (sin ning&uacute;n sistema operativo) est&eacute;n disponible (por ejemplo, un teclado USB, que tiene que estar disponible antes que haya algun sistema operativo para poder escribir opciones en el arranque) o en el nuestro caso: un dispositivo USB necesario para arrancar el sistema operativo.<br /> <br /> Si no tenemos la opci&oacute;n para arrancar desde USB-FDD o bien la tenemos pero no nos funciona correctamente, podemos ejecutar el syslinux con la opci&oacute;n -s:<br /> <br /> syslinux -s /dev/sda1<br /> <br /> <br /> Y volverlo a intentar.<br /> <br /> Otra opci&oacute;n seria buscar una actualizaci&oacute;n de la BIOS en la p&aacute;gina Web del fabricante. Hay algunos casos que arreglan errores en el arranque relacionados con los dispositivos USB.<br /> <br /> De todas formas, las placas y BIOS que van saliendo actualmente cada vez son m&aacute;s claras en este aspecto. En el inicio de los CD-ROMs arrancables tambi&eacute;n hab&iacute;a problemas e incompatibilidades, como toda tecnolog&iacute;a nueva.<br /> <br /> <a name="cdrom" title="cdrom"></a><br /> <h3>Arrancando mediante CD-ROM</h3><br /> Si sigue sin arrancar podemos arrancar la distribuci&oacute;n desde un CD-ROM. Veremos que no se pierde casi ninguna de las ventajas de Catux-USB, s&oacute;lo que:<br /> tendremos que trastear con el CD-ROM el ordenador necesitar&aacute; de CD-ROM para arrancar.<br /> <br /> Una vez arrancado el sistema, el CD-ROM quedar&aacute; libre para insertar nuevos CDs, gravar CDs, etc.<br /> <br /> Si arrancamos mediante CD-ROM evidentemente en la secuencia de arranque de la BIOS seleccionaremos CD-ROM como seguramente ya ten&iacute;amos o hemos usado para instalar sistemas operativos.<br /> <br /> Comentar que si arrancamos mediante CD-ROM la parte inicial del proceso de arranque es bastante m&aacute;s r&aacute;pida que haci&eacute;ndolo mediante el mismo dispositivo USB.<br /> <br /> La imagen del ISO necesaria para el arranque est&aacute; en /mnt/pendrive o donde hayamos descomprimido la Catux-USB. Se llama disk.iso y lo podemos grabar con el programa que usemos para grabar CD&#39;s, o si estamos en la l&iacute;nea de comandos mediante:<br /> <br /> cdrecord -v dev=0,3,0 -eject -data disk.iso<br /> <br /> (donde dev es el que tengamos en cada ordenador)<br /> Arrancando por primera vez<br /> <br /> Ya sea mediante el CD-ROM de arranque o mediante el dispositivo USB tendremos el logo del gestor de arranque en pantalla.<br /> <br /> Podemos presionar F3 para ver las opciones de arranque en castellano.<br /> Catux-USB es totalmente triling&uuml;e (catal&aacute;n, castellano, ingles), as&iacute; que podemos arrancar mediante:<br /> <br /> knoppix lang=es<br /> <br /> <br /> Para tenerla en castellano, desde los mensajes de reconocimiento iniciales a los programas, men&uacute;s, scripts.<br /> <br /> Si es la primera vez que arranca y le pasamos un par&aacute;metro de lenguaje Catux-USB lo guardar&aacute; en el USB para las siguientes veces; siempre los mensajes a partir de donde haya accedido al USB (hay algunos mensajes anteriores que si no se especifica nada en el par&aacute;metro de arranque lang ser&aacute;n en ingl&eacute;s).<br /> <br /> Las otras dos opciones son lang=ca para catal&aacute;n o bien lang=en para ingl&eacute;s.<br /> Al usar los scripts de autodetecci&oacute;n de Knoppix podemos pasarle otros par&aacute;metros que veremos en pantalla como puede ser noscsi, nopcmcia, etc.<br /> Al ser la primera vez que arranca, cuando intente montar el directorio HOME no podr&aacute; ya que no existir&aacute; el fichero que lo representa (el HOME es un fichero en el USB en formato ext2).<br /> <br /> Ser&aacute; entonces cuando nos pedir&aacute; el tama&ntilde;o del fichero HOME que deseemos. El sistema, si estamos en un Pendrive de 256 MB ocupa por defecto 170 MB as&iacute; que tenemos unos 85 MB disponibles para el HOME. Haremos un HOME de m&aacute;s de 1 o 2 MB y menos de 85, para que no nos falte pero que no nos quedemos cortos, eso depende de lo que pensamos que guardaremos en el HOME.<br /> <br /> Lo que no sea ni sistema ni HOME quedar&aacute; disponible como un Pendrive de forma habitual, as&iacute; que tiene sentido ajustar un poco el HOME.<br /> <br /> Una vez le hayamos indicado el tama&ntilde;o del HOME nos pedir&aacute; de forma manual que lo va a formatear y que no es un dispositivo de bloques donde le indicaremos &ldquo;y&rdquo; para que lo haga.<br /> <br /> Despu&eacute;s continuar&aacute; con el arranque normal del sistema. Veremos que el arranque, despu&eacute;s de la ejecuci&oacute;n del script de Knoppix de autodetecci&oacute;n de hardware es el de una Debian normal.<br /> <br /> <br /> <a href="http://catux.org/index.php?contingut=articles&amp;num=75#indice">&Iacute;ndice</a><br /> <br /> <a name="login" title="login"></a><br /> <h3>Haciendo login</h3><br /> Nos dejar&aacute; entonces en la pantalla de login. Por defecto Catux-USB tiene el usuario catux con contrase&ntilde;a catux y el usuario root con contrase&ntilde;a catux, tal como nos indicar&aacute; desde la misma pantalla.<br /> <br /> Podemos cambiar de forma habitual la contrase&ntilde;a de estos usuarios (mediante el comando passwd) o hasta eliminar estos usuarios, a&ntilde;adir otros, etc.<br /> En caso que queramos que Catux-USB sea una distribuci&oacute;n segura de forma local deber&iacute;amos modificar la configuraci&oacute;n de sudo ya que este en la pr&aacute;ctica da permisos de root al usuario catux.<br /> <br /> Una vez estemos en la l&iacute;nea de comandos podemos trabajar como si de una Debian normal se tratara. Por tanto, y a nivel de referencia para quien no use Debian o apt-get de forma habitual podemos hacer:<br /> <br /> <br /> apt-get update<br /> <br /> Y as&iacute; podr&iacute;amos actualizar la lista de paquetes.<br /> O bien:<br /> <br /> apt-get install mozilla-firefox<br /> <br /> Si deseamos instalar el mozilla-firefox o cualquiera de los m&aacute;s de 10.000 programas que Debian tiene disponibles.<br /> Para buscar un paquete podr&iacute;amos hacer:<br /> <br /> apt-cache search &ldquo;descripci&oacute;n&rdquo;<br /> <br /> Para ver el listado de paquetes:<br /> <br /> dpkg -l<br /> <br /> <br /> Y para eliminar un paquete en concreto<br /> <br /> dpkg --purge nombre_paquete<br /> <br /> Hemos realizado un script que facilita la configuraci&oacute;n de varios aspectos de la distribuci&oacute;n. Este se llama configurar.sh y nos permitir&aacute; configurar:<br /> <br /> <li>X-Window<br /> </li><li>Red<br /> </li><li>Idioma<br /> </li><li>M&oacute;dem<br /> <br /> Veremos que los scripts son intuitivos, realizados con dialog. Son scripts de Knoppix, Damn Small Linux, del mismo sistema o propios pero adaptados para que sea triling&uuml;es en funci&oacute;n del idioma seleccionado en el sistema.<br /> <br /> Podremos configurar las X-Window. Normalmente usa el driver vesa que es compatible con casi todo tipo de tarjeta gr&aacute;fica, aunque podemos usar el que deseemos, para tener un rendimiento superior, aceleraci&oacute;n 3D, etc.<br /> <br /> Mediante startx podremos arrancar el sistema gr&aacute;fico, el cual se basa en XFree 4.3 y como gestor de ventanas hemos usado fluxbox, aunque se puede cambiar f&aacute;cilmente.<br /> <br /> En fluxbox tenemos un fondo que presionando con el bot&oacute;n derecho del rat&oacute;n nos aparecer&aacute; un men&uacute; con algunos de los programas que est&aacute;n instalados en el sistema.<br /> <br /> Como comentario r&aacute;pido, hay disponible dillo como navegador Web (ya que ocupaba poco), sylpheed como cliente de correo, axftp como cliente FTP. Podemos a&ntilde;adir o quitar programas como hemos visto anteriormente.<br /> <br /> Tambi&eacute;n tenemos el cliente ssh para conectarnos a otras m&aacute;quinas, un cliente VNC, y un largo etc&eacute;tera de aplicaciones aparte de las que podemos instalar.<br /> <br /> <br /> <a href="http://catux.org/index.php?contingut=articles&amp;num=75#indice">&Iacute;ndice</a><br /> <br /> <a name="unitats" title="unitats"></a><br /> <h3>Unidades montadas</h3><br /> Una vez dentro de Catux-USB tendremos varias unidades montadas o preconfiguradas para montar.<br /> <br /> En /mnt tendremos hda1, hda2, hdb1, etc. que ser&aacute;n las particiones de nuestro sistema que podemos montar mediante mount /mnt/hda1. Si hay un CD-ROM lo deja tambi&eacute;n listo para montar.<br /> <br /> Desde el dock en el fluxbox, podemos montar o desmontar las unidades de forma gr&aacute;fica.<br /> <br /> Adem&aacute;s tendremos en /mnt/pendrive nuestro dispositivo USB para acceder a &eacute;l si queremos.<br /> <br /> En /mnt/catux-usb est&aacute; montado el fichero que contiene el HOME (por tanto, /home es un enlace a /mnt/catux-usb/home)<br /> <br /> El sistema / (root) es el mismo que miniroot.gz (un sistema en RAM) pero todos los directorios son enlaces a /KNOPPIX, el cual es el punto de montaje del fichero (tipo ext2 compressed) /mnt/pendrive/knoppix/knoppix.<br /> <br /> <br /> <a href="http://catux.org/index.php?contingut=articles&amp;num=75#indice">&Iacute;ndice</a><br /> <br /> <a name="fitxers" title="fitxers"></a><br /> <h3>Repaso de los ficheros</h3><br /> Desde nuestra distribuci&oacute;n habitual, si miramos el contenido de /mnt/pendrive veremos:<br /> <br /> </li><li>/mnt/pendrive/knoppix/knoppix. Aqu&iacute; hay el sistema, es un fichero con formato comprimido mediante el parche <a href="http://e2compr.sourceforge.net/">e2compr</a>. As&iacute; podemos tener m&aacute;s capacidad para programas con un sistema de ficheros totalmente escribible (hay otros como cloop que est&aacute;n orientados a s&oacute;lo lectura). Esto tiene un problema: si no tenemos en nuestra distribuci&oacute;n un Kernel con el parche e2compr (y de momento s&oacute;lo est&aacute; disponible para los Kernels 2.4.x) no podemos acceder a este fichero, por eso tenemos el HOME aparte:<br /> /mnt/pendrive/catux-usb.ext2. Aqu&iacute; tenemos el directorio HOME de la distribuci&oacute;n. As&iacute; que si hemos trabajado con Catux-USB y guardamos alg&uacute;n fichero en el HOME de ella est&aacute; en este fichero. Si lo queremos montar desde nuestra distribuci&oacute;n haremos:<br /> <br /> mount -t ext2 -o loop /mnt/pendrive/catux-usb.ext2 /mnt/home_catux<br /> <br />      (siempre y cuando exista el directorio /mnt/home_catux)<br /> </li><li>miniroot.gz. Contiene el sistema de ficheros inicial, lo comentaremos m&aacute;s adelante explicando la secuencia de arranque. <br /> boot.msg, f2, f3, f4. Ficheros con los textos que se usan en el syslinux (el gestor de arranque)<br /> </li><li>logo.16. Fichero gr&aacute;fico que contienen el logo de arranque<br /> </li><li>syslinux.cfg. Es la configuraci&oacute;n de syslinux<br /> </li><li>ldlinux.sys. Fichero auxiliar para syslinux<br /> </li><li>utils/ . Directorio con unos ficheros auxiliares y un script para modificar el tama&ntilde;o del fichero knoppix/knoppix<br /> <br /> <br /> <br /> <a href="http://catux.org/index.php?contingut=articles&amp;num=75#indice">&Iacute;ndice</a><br /> <br /> <a name="mida" title="mida"></a><br /> <h3>Cambiando el tama&ntilde;o del sistema de ficheros</h3><br /> La versi&oacute;n de 256 viene con el sistema base unos 100 MB ocupados y dimensionado a 170 MB (por tanto tenemos unos 70 MB de espacio, m&aacute;s lo que ganamos en la compresi&oacute;n, para instalar programas).<br /> <br /> La versi&oacute;n de 128 MB tiene unos 20 MB libres (m&aacute;s compresi&oacute;n) para nuestros paquetes.<br /> <br /> Es posible que el tama&ntilde;o dimensionado no se adapte a nuestras necesidades y deseemos cambiarlo. Lo haremos con el programa resize2fs, pero este tiene que estar compilado para tener soporte para compresi&oacute;n.<br /> Hemos hecho un script que nos pedir&aacute; el incremento de tama&ntilde;o o el nuevo tama&ntilde;o si es m&aacute;s reducido y adem&aacute;s incluimos una versi&oacute;n del resize2ffs y del fsck.ext2 compilados en modo est&aacute;tico y con el parche de e2compr para no tener problemas.<br /> <br /> El modo de uso ser&iacute;a:<br /> mount -t vfat -o exec /dev/sda1 /mnt/pendrive<br /> Y entonces:<br /> <br /> cd /mnt/pendrive/utils<br /> ./modify_size.sh<br /> <br /> <br /> Es necesario montarlo con la opci&oacute;n exec ya que por defecto muchas distribuciones montan los sistemas vfat sin capacidad para ejecutar los ficheros de su interior.<br /> <br /> Este script nos pedir&aacute; el idioma y los tama&ntilde;os para cambiarlo. El proceso no dura m&aacute;s de 5 minutos, y nos permite dimensionar el sistema a nuestro gusto.<br /> <br /> <br /> <a href="http://catux.org/index.php?contingut=articles&amp;num=75#indice">&Iacute;ndice</a><br /> <br /> <a name="arranc" title="arranc"></a><br /> <h3><a name="arranc" title="arranc"></a>Proceso de arranque</h3><a name="arranc" title="arranc"></a><br /> Aqu&iacute; describiremos el proceso de arranque de Catux-USB, para saber qu&eacute; pasa si hay alg&uacute;n problema o bien para los curiosos.<br /> Una vez tenemos el logo del arranque de Catux-USB en pantalla estamos en syslinux, un gestor de arranque bastante curioso, ya que sabe acceder a ficheros que est&aacute;n en la partici&oacute;n FAT que se le indica. Por tanto, cuando hacemos F2, F3, F4 (para ver las ayudas en los diferentes idiomas) accede al dispositivo y lee el fichero a mostrar.<br /> <br /> Cuando presionamos &ldquo;Enter&rdquo; y pasa a arrancar el Kernel, sabe en qu&eacute; fichero est&aacute; porqu&eacute; lo hemos configurado en el fichero syslinux.cfg. Tambi&eacute;n se ha configurado para que use el fichero miniroot.gz como fichero de initrd. <br /> <br /> Por tanto entonces se ejecuta el Kernel y este accede al fichero minroot.gz. El fichero miniroot.gz es un fichero comprimido con gzip, que a su vez es un fichero tipo ext2 que contiene lo imprescindible para poder detectar el dispositivo USB. Hasta que se detecta el dispositivo USB a nivel de m&oacute;dulos del Kernel es la BIOS quien se est&aacute; encargando de gestionar la entrada/salida.<br /> <br /> En el caso que estuvieramos arrancando desde CD-ROM, el proceso es el mismo pero se lee el Kernel y el miniroot.gz desde el mismo CD. <br /> Una vez ha cargado miniroot.gz en RAM, pasa a ejecutarse el fichero linuxrc que es un script compatible con Bourne Shell, aunque se ejecuta con ash. <br /> Ash es un int&eacute;rprete, como podr&iacute;a ser Bash, pero tiene la caracter&iacute;stica que es muy peque&ntilde;o. Este ash est&aacute; compilado de forma est&aacute;tica para que no se necesiten librer&iacute;as (el miniroot tiene una capacidad limitada) y un bash compilado est&aacute;tico ser&iacute;a excesivo (2.3 MB) en contra de los XXX KB de ash (como es evidente, ash no tiene todas las capacidades que tiene Bash).<br /> <br /> El script linuxrc se encarga de varias tareas, aunque una y seguramente la m&aacute;s importante es cargar los m&oacute;dulos USB necesarios.<br /> <br /> En /static/modules tenemos los m&oacute;dulos USB, por ejemplo usb-uhci, usb-ohci, usb-ehcd. Dependiendo de la placa que tenga el usuario se cargar&aacute; un m&oacute;dulo u otro m&oacute;dulo. Tambi&eacute;n carga el m&oacute;dulo usb-storage para poder acceder al dispositivo. Cuando carga un m&oacute;dulo aparece su nombre al lado.<br /> <br /> A continuaci&oacute;n linuxrc monta en /KNOPPIX el fichero que contiene el sistema, pasa el control a /sbin/init y se elimina a &eacute;l mismo (para no ver un fichero llamado linuxrc en el /) <br /> <br /> Todo el conjunto de directorios de GNU/Linux (por ejemplo /bin, /sbin, /lib, /usr, etc.) son enlaces simb&oacute;licos hacia /KNOPPIX. Podr&iacute;amos haber evitado estos enlaces &ldquo;pivotando&rdquo; con chroot por ejemplo a /KNOPPIX pero no ha hecho falta.<br /> <br /> Si linuxrc no puede pasar el control a /sbin/init porqu&eacute; no ha podido montar la Catux-USB lo que har&aacute; es dejar una shell muy limitada para intentar saber qu&eacute; ha pasado. Si no lo ha podido montar se puede deber a que el USB no est&aacute; enchufado (y est&aacute;bamos arrancando desde CD-ROM), a que la imagen del sistema ha tenido alg&uacute;n problema (y por tanto no se ha podido montar), o no ha podido cargar ning&uacute;n controlador para gestionar nuestro USB, ...<br /> <br /> En el caso que nos deje en la shell limitada, comentar que no tendremos ni ls pero para ver los directorios y ficheros del directorio actual podemos hacer echo *, s&iacute; que tenemos cd y insmod para intentar cargar los m&oacute;dulos y ver qu&eacute; error dan exactamente.<br /> A continuaci&oacute;n, si ha ido bien, init entrar&aacute; en el runlevel 2 habitual en Debian ejecutando los scripts de iniciaci&oacute;n de System V (los /etc/rc2.d). A partir de este momento estamos en una Debian normal para el uso que deseemos.<br /> <br /> <br /> <a href="http://catux.org/index.php?contingut=articles&amp;num=75#indice">&Iacute;ndice</a><br /> <br /> <a name="kernel" title="kernel"></a><br /> <h3>C&oacute;mo cambiar el Kernel</h3><br /> Cambiar el Kernel en esta distribuci&oacute;n es un poco diferente y m&aacute;s laborioso que otras distribuciones.<br /> <br /> De todas formas es posible que necesitemos cambiarlo por alg&uacute;n motivo (actualizaci&oacute;n urgente, necesidad de un parche no incluido, etc.) as&iacute; que intentaremos resumir aqu&iacute; el proceso.<br /> <br /> El Kernel (t&iacute;pico fichero bzImage) reside en /mnt/pendrive bajo el nombre de vmlinuz. Este Kernel tiene que concordar con la versi&oacute;n de los m&oacute;dulos necesarios para la detecci&oacute;n del dispositivo USB que hay en miniroot.gz.<br /> <br /> A su vez, en el fichero que contiene el sistema (/mnt/pendrive/knoppix/knoppix), en el directorio /lib/modules/version_kernel hay los m&oacute;dulos del resto de dispositivos.<br /> <br /> Adem&aacute;s, y muy importante, el Kernel que instalemos tiene que tener el parche de e2compr, ya que sin&oacute; no se podr&aacute; montar el sistema. Este parche se encuentra en http://e2compr.sourceforge.net y se tiene que aplicar en un Kernel antes de compilarlo. <br /> <br /> Para las opciones, tenemos que intentar que sea lo m&aacute;s modular posible para tener soporte para todo tipo de dispositivos bajo demanda.<br /> Para cambiar el vmlinuz es suficiente sobrescribirlo con el nuevo, o bien modificar el fichero de configuraci&oacute;n de syslinux (syslinux.cfg) e intentar tener los dos disponibles.<br /> <br /> Para cambiar el /lib/modules/version_kernel, podemos hacerlo arrancando la Catux-USB y copiando los nuevos m&oacute;dulos all&aacute; dentro, deber&iacute;a ser suficiente. Copiamos toda la estructura del /lib/modules/version_kernel del Kernel que hayamos arrancado, incluido el modules.dep.<br /> <br /> Por &uacute;ltimo, para cambiar los m&oacute;dulos que est&aacute;n contenidos en el fichero miniroot.gz, desde Catux-USB o nuestra distribuci&oacute;n deber&iacute;amos hacer algo como:<br /> <br /> gunzip miniroot.gz<br /> mkdir m<br /> mount -t ext2 -o loop miniroot m<br /> cd m<br /> cd static/modules<br /> <br /> Y los veremos all&aacute; dentro, podemos sobrescribirlos.<br /> <br /> <br /> <a href="http://catux.org/index.php?contingut=articles&amp;num=75#indice">&Iacute;ndice</a><br /> <br /> <a name="noucd" title="noucd"></a><br /> <h3>Generar un nuevo CD</h3><br /> Si por alg&uacute;n motivo hemos cambiado el Kernel, quiz&aacute;s necesitamos hacer de nuevo el CD-ROM para poder arrancar, en caso que no podamos arrancar desde USB.<br /> Para hacerlo, primero haremos un fichero de 2880 KB:<br /> <br /> <br /> dd if=/dev/zero of=disk.vfat bs=1k count=2880<br /> <br /> A continuaci&oacute;n formatearemos el fichero con format VFAT, &uacute;til para poder usar syslinux:<br /> <br /> mkfs -t vfat disk.vfat<br /> <br /> Y haremos un directorio llamado, por ejemplo, d:<br /> <br /> mkdir d<br /> <br /> Y en &eacute;l montaremos el nuevo fichero:<br /> <br /> mount -t disk.vfat d<br /> <br /> Y finalmente copiaremos los ficheros necesarios para esta parte del arranque:<br /> cp boot.msg f2 f3 f4 ldlinux.sys logo.16 miniroot.gz syslinux.cfg vmlinuz d<br /> Desmontamos el fichero:<br /> <br /> umount d<br /> <br /> Le instalamos syslinux:<br /> <br /> syslinux disk.vfat<br /> <br /> Ponemos el fichero dentro del mismo directorio d:<br /> <br /> mv disk.vfat d<br /> <br /> Y finalmente generamos la ISO nueva:<br /> <br /> mkisofs -l -J -o disk.iso -v -b disk.vfat -V catux-usb d/<br /> <br /> De esa forma ya tenemos una ISO para grabar como vimos anteriormente con el nuevo Kernel.<br /> <br /> <br /> <a href="http://catux.org/index.php?contingut=articles&amp;num=75#indice">&Iacute;ndice</a><br /> <br /> <a name="micro" title="micro"></a><br /> <h3>C&oacute;mo preparar la instalaci&oacute;n desde Microsoft Windows</h3><br /> Hasta ahora hemos visto como instalarlo desde una distribuci&oacute;n de GNU/Linux. Ahora veremos como podemos hacerlo desde un Microsoft Windows, &uacute;til en el caso que no tuvi&eacute;ramos una distribuci&oacute;n instalada.<br /> <br /> En todo caso, siempre podr&iacute;amos instalarla desde una Knoppix (un CD arrancable que nos dejar&iacute;a en las condiciones parecidas a la instalaci&oacute;n ya vista en el art&iacute;culo).<br /> <br /> Deberemos descargar igualmente uno de los ficheros, ya sea catuxusb-0.1-128a.tar.bz2 o bien catuxusb-0.1a-256.tar.bz2. A continuaci&oacute;n utilizaremos algun programa como 7-zip (http://www.7-zip.org) o bien Winzip (http://www.winzip.com, comercial)p ara descomprimir y desempaquetar los ficheros contenidos con &eacute;l. Los podemos extraer directamente en la unidad que tengamos el Pendrive (por ejemplo, e:) siempre que esa sea tipo FAT (tipo por defecto).<br /> <br /> Una vez copiados en el Pendrive, tendremos que prepararlo para que arranque autom&aacute;ticamente al iniciar el ordenador. Para ello utilizaremos un peque&ntilde;o programa llamado syslinux. <br /> <br /> Este programa modificar&aacute; el inicio del Pendrive y crear&aacute; unos ficheros en &eacute;l para que se pueda arrancar.<br /> <br /> Lo podemos encontrar aqu&iacute;:<br /> <a href="http://syslinux.zytor.com/download.php">http://syslinux.zytor.com/download.php</a><br /> <br /> En esta p&aacute;gina encontramos un enlace al ftp de kernel.org. Descargamos el <a href="http://www.kernel.org/pub/linux/utils/boot/syslinux/syslinux-2.10.zip">syslinux-2.10.zip</a>.<br /> Dentro de este fichero encontraremos syslinux.exe, el cual extraeremos a c:\ o cualquier directorio conocido.<br /> Iremos al bot&oacute;n Inicio, y a continuaci&oacute; Ejecutar. Teclearemos en la cajetilla cmd. <br /> En la pantalla S&iacute;mbolo de sistema que nos aparacer&aacute; teclearemos:<br /> c:\<br /> syslinux e:<br /> Siempre suponiendo que en e: se encuentra nuestro Pendrive. Tendremos que ver en qu&eacute; unidad est&aacute;, por ejemplo mediante Mi Pc.<br /> Ahora el pendrive ya est&aacute; preparado para arrancar la Catux-USB.<br /> A partir de aqu&iacute; deber&iacute;amos comprobar las opciones de la BIOS, ver m&aacute;s detalles en la secci&oacute;n del art&iacute;culo llamado &ldquo;<a href="http://catux.org/index.php?contingut=articles&amp;num=75#bios">Configurando la BIOS</a>&rdquo;.<br /> <br /> <br /> <a href="http://catux.org/index.php?contingut=articles&amp;num=75#indice">&Iacute;ndice</a><br /> <br /> <a name="agraits" title="agraits"></a><br /> <h3>Agradecimientos</h3><br /> Desde Catux hemos hecho un trabajo fuerte para conseguir esta distribuci&oacute;n, desde gente teste&aacute;ndola durante meses (us&aacute;ndola como distribuci&oacute;n habitual durante meses) a gente traduciendo textos, corrigiendo textos, aportando ideas, material, etc.<br /> <br /> De todas formas no hubi&eacute;ramos podido hacer la distribuci&oacute;n si no fuera por las miles de personas que han trabajado durante a&ntilde;os en proyectos como el Kernel de Linux, como GNU, Debian, Knoppix, y un largo etc. <br /> <br /> Gente que adem&aacute;s ha hecho su trabajo con licencias libres (sean GPL, LGPL o similares) y hemos podido aprovechar sus trabajos. Si no fuera por todo ello ahora no estar&iacute;amos escribiendo esto, sino que estar&iacute;amos a&uacute;n reinventando el sistema completo de nuevo.<br /> <br /> <a href="http://catux.org/index.php?contingut=articles&amp;num=75#indice">&Iacute;ndice</a><br /> <br /> <a name="conclu" title="conclu"></a><br /> <h3>Conclusiones</h3><br /> La distribuci&oacute;n funciona correctamente, aunque al ser la primera versi&oacute;n siempre tendr&aacute; algunos errores que tendr&aacute;n que ser corregidos.<br /> <br /> En los pr&oacute;ximos meses haremos una segunda versi&oacute;n de la distribuci&oacute;n con esos errores solucionados y con m&aacute;s ideas y aportaciones generales.<br /> Quien tenga problemas, recomendaciones, ideas, etc. le invitamos a nuestra <a href="http://catux.org//">p&aacute;gina Web</a> donde hay una lista de correo para solucionarle problemas, dudas, etc.</li></div>
    
            </p>

            <h3>
                Categories:
                
        Articles, Catux
    
            </h3>

            <hr />
            <h1>Comentaris</h1>
            <ul class="list-group">
                
        <li class="list-group-item">Sense comentaris</li>
    
            </ul>


            <a href="https://catux.org/post_list.html">
                <i class="fas fa-chevron-left"></i>
                Arxius
            </a>
        </div>

    </div>


    </div> <!-- /.container -->

    <div class="container">
        <nav class="navbar navbar-inverse catux-footer">
            <p class="navbar-text">
                Tot el contingut de Catux està subjecte sota la nova versió de la llicència de
                <a href="http://creativecommons.org/licenses/by/2.5/es/deed.ca">Creative Commons</a>
            </p>
        </nav>
    </div>



</body>
</html>
